using System;
using Microsoft.EntityFrameworkCore.Migrations;

#nullable disable

namespace TouristAgency.Infrastructure.Migrations
{
    public partial class Seeded_Database_1 : Migration
    {
        protected override void Up(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.AlterColumn<string>(
                name: "Name",
                table: "RoomTypes",
                type: "nvarchar(35)",
                maxLength: 35,
                nullable: false,
                comment: "Name of RoomType",
                oldClrType: typeof(string),
                oldType: "nvarchar(30)",
                oldMaxLength: 30,
                oldComment: "Name of RoomType");

            migrationBuilder.AlterColumn<int>(
                name: "ActivityId",
                table: "OrganizedOfferDays",
                type: "int",
                nullable: true,
                comment: "Activity identifier",
                oldClrType: typeof(int),
                oldType: "int",
                oldComment: "Activity identifier");

            migrationBuilder.AlterColumn<string>(
                name: "Name",
                table: "Hotels",
                type: "nvarchar(80)",
                maxLength: 80,
                nullable: false,
                comment: "Name of Hotel",
                oldClrType: typeof(string),
                oldType: "nvarchar(60)",
                oldMaxLength: 60,
                oldComment: "Name of Hotel");

            migrationBuilder.AlterColumn<string>(
                name: "Name",
                table: "Activities",
                type: "nvarchar(100)",
                maxLength: 100,
                nullable: false,
                comment: "Name of activity",
                oldClrType: typeof(string),
                oldType: "nvarchar(60)",
                oldMaxLength: 60,
                oldComment: "Name of activity");

            migrationBuilder.InsertData(
                table: "Continents",
                columns: new[] { "Id", "Name" },
                values: new object[,]
                {
                    { 1, "Европа" },
                    { 2, "Южна Америка" },
                    { 3, "Азия" },
                    { 4, "Африка" }
                });

            migrationBuilder.InsertData(
                table: "CruiseRoomTypes",
                columns: new[] { "Id", "Description", "Name" },
                values: new object[,]
                {
                    { 1, "Най-малката по размер и квадратура, без прозорец и е разположена от вътрешната страна на кораба", "Вътрешнa каютa" },
                    { 2, "Известна още като каюта с прозорец, е тази която представя изглед към външният свят чрез прозорец или илюминатор (кръгъл прозорец). Обикновено външната каюта е малко по-голяма от вътрешната като квадратура", "Външна каюта" },
                    { 3, "Предоставя ви частна веранда, която ви позволява да излезете навън без да сте на обществена палуба", "Външна каюта" },
                    { 4, "Апартаментите са големи каюти с балкон, които са с отделна всекидневна и често допълнителни спални, понякога с две нива тип мезонет и предлагат повече пространство и  удобства. Също така придобивките към тях са: ол инлузив включени напитки, бакшиши към персонала, вип зони отделени само за гостите на апартаменти например: специален ресторант, лаундж бар, басейн и релакс открита частна палуба; консиерж за резервации по време на вашето пътуване; иконом 24 часа на разположение; приоритетно качване и слизане от кораба", "Апартамент" }
                });

            migrationBuilder.InsertData(
                table: "Cruises",
                columns: new[] { "Id", "Description", "EmbarkDate", "IsActive", "MaxPeople", "MinPeopleNeeded", "Name", "Price", "ReturnDate" },
                values: new object[,]
                {
                    { 1, "Атина (Пирея) - Солун - Кавала - Истанбул - Дикили - Кушадасъ - Патмос - Атина (Пирея)", new DateTime(2024, 10, 12, 0, 0, 0, 0, DateTimeKind.Unspecified), true, 100, 30, "8-дневен круиз Steps of Paul", 2240m, new DateTime(2024, 10, 19, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 2, "Рим - Неапол - Палермо - Каляри - Тунис - Рим", new DateTime(2024, 9, 2, 0, 0, 0, 0, DateTimeKind.Unspecified), true, 100, 25, "7-дневен круиз Steps of Marcelo", 1820m, new DateTime(2024, 9, 8, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 3, "Нант - Ла Рошел - Билбао - Порто - Лисабон - Нант", new DateTime(2024, 11, 9, 0, 0, 0, 0, DateTimeKind.Unspecified), true, 100, 35, "8-дневен круиз Steps of Napoleon", 2500m, new DateTime(2024, 11, 16, 0, 0, 0, 0, DateTimeKind.Unspecified) }
                });

            migrationBuilder.InsertData(
                table: "RoomTypes",
                columns: new[] { "Id", "Description", "Name" },
                values: new object[,]
                {
                    { 1, "Стая, определена за един човек. Може да има едно или повече легла. Площта на единичните стаи обикновено е между 37 m² и 45 m²", "Единичина" },
                    { 2, "Стая, разпределена за двама души. Може да има спалня или две единични легла. Площта на двойните стаи обикновено са между 40 m² и 45 m²", "Двойна" },
                    { 3, "Стая, която може да побере трима души и е оборудвана с три единични легла, едно двойно легло и две единични или едно двойно легло или две единични. Площта на тройните стаи обикновено са между 45 m² и 65 m²", "Тройна" },
                    { 4, "Стая за четирима души. Може да има две или повече легла. Площта на стаите с четири стаи обикновено са между 70 m² и 85 m²", "Четворна" },
                    { 5, "Стая с две двойни (или може би кралска спалня). Може да побере от двама до четирима души. Площта на стаите обикновено е между 50 m² до 70 m²", "Двойна-Двойна" },
                    { 6, "Стая с много голямо легло. Може да бъде заета от един или повече души. Площта на стаите King са обикновено между 32 m² до 50 m²", "Кралска" },
                    { 7, "Най-скъпата стая, предоставена от хотела. Обикновено в един хотелски хотел се предлага само един президентски апартамент. Подобно на нормалните суити, президентският апартамент винаги има една или повече спални и жилищна площ със силен акцент върху великолепна декорация в стаята, висококачествени удобства, консумативи и лични услуги(например личен иконом по време на престоя). Площта на президентските апартаменти обикновено са между 80 m² и 350 m²", "Президентска" },
                    { 8, "Стая, оборудвана с разтегателен диван или легло Мърфи (т.е. легло, което се сгъва от стена. Стаята се трансформира от спалня през нощта в дневна през деня. Площта на типовете стаи Мърфи обикновено са между 20 m² до 40 m²", "Мърфи" },
                    { 9, "Този тип стая винаги е прилежаща към басейна или има свой частен басейн. Площта на типовете стаи Cabana обикновено са между 30 m² и 45 m²", "Кабана" },
                    { 10, "Този тип стая е предназначена главно за гости с увреждания и по закон се изисква хотелите да осигуряват определен брой достъпни стаи, за да се избегне дискриминация.Площта на типовете стаи за достъп обикновено са между 30 m² до 42 m²", "Достъпна стая / стая за инвалиди" }
                });

            migrationBuilder.InsertData(
                table: "TransportTypes",
                columns: new[] { "Id", "Name" },
                values: new object[,]
                {
                    { 1, "Самолет" },
                    { 2, "Автобус" },
                    { 3, "Собствен" }
                });

            migrationBuilder.InsertData(
                table: "Countries",
                columns: new[] { "Id", "ContinentId", "Name" },
                values: new object[,]
                {
                    { 1, 1, "България" },
                    { 2, 1, "Гърция" },
                    { 3, 1, "Италия" },
                    { 4, 1, "Франция" },
                    { 5, 1, "Испания" },
                    { 6, 1, "Турция" },
                    { 7, 1, "Португалия" },
                    { 8, 1, "Чехия" },
                    { 9, 2, "Аржентина" },
                    { 10, 2, "Куба" },
                    { 11, 2, "Перу" },
                    { 12, 2, "Бразилия" },
                    { 13, 3, "Япония" },
                    { 14, 3, "Шри Ланка" },
                    { 15, 3, "Китай" },
                    { 16, 3, "Сингапур" },
                    { 17, 3, "Малдиви" },
                    { 18, 4, "Египет" },
                    { 19, 4, "Мароко" },
                    { 20, 4, "Тунис" }
                });

            migrationBuilder.InsertData(
                table: "CruiseDays",
                columns: new[] { "Id", "CruiseId", "DayNumber", "Description" },
                values: new object[,]
                {
                    { 1, 1, 1, "16:00 ч. Начало на круиза с кораб CELESTYAL JOURNEY. Корабът потегля от пристанището в Пирея в посока Солун. Нощувка на кораба" },
                    { 2, 1, 2, "09:30 ч. Акостиране на пристанището в Солун. Свободно време за посещение и разглеждане на забележителности. Връщане на кораба. 20:00 ч. Отплаване към Кавала. Нощувка на кораба" },
                    { 3, 1, 3, "08:00 ч. Корабът акостира на пристанището в Кавала. Свободно време за посещение и разглеждане на забележителности. Връщане на кораба. 16:00 ч. Отплаване в посока Солун. Нощувка на кораба" },
                    { 4, 1, 4, "09:30 ч. Акостиране на пристанището в Истанбул. Свободно време за посещение и разглеждане на забележителности. Връщане на кораба. 20:00 ч. Отплаване в посока Дикили. Нощувка на кораба. " },
                    { 5, 1, 5, "12:00 ч. Акостиране на пристанището в Дикили. Свободно време за посещение и разглеждане на забележителности. Връщане на кораба. 20:00 ч. Отплаване в посока Кушадасъ. Нощувка на кораба" },
                    { 6, 1, 6, "08:00 ч. Пристигане в Кушадасъ. Възможност за свободно време или допълнителна екскурзия в Кушадасъ! 23:30 ч. Отплаване в посока Патмос" },
                    { 7, 1, 7, "07:00 ч. пристигане на остров Патмос. Тук слизането на брега става с лодки и е безплатно. Патмос: Историческото минало на Патмос му е заслужила прозвището Йерусалим на Егейско море. Разположен на север от Лерос (Leros) и на юг от остров Кирил (Ikaria), Патмос се състои от три малки суши, свързани помежду си с провлак. Общата им площ е около 28 кв. км на които са разположени красиво пристанище, доста плажове, хотели и заведения, както и няколко забележителни исторически обекта. Един от тях е пещерата, където свети Йоан Богослов прекарва изгнанието си и където пише Апокалипсис. Според историята той създал своето Откровение, след като Бог му проговорил, явявайки му се през пукнатина в една скала. Днес пред пещерата има изграден малък параклис – „Света Ана”, който датира още от 11 в. Друга от забележителностите на острова е укрепеният манастир на Свети Йоан. Обителта е издигната на красиво място, което се издига на целия район на острова. В тази най-висока част на Патмос, заемана от красивия манастир има и богата библиотека, която според тукашните монаси през 17 в. е била посещавана и от български духовници. Както пещерата на Йоан Богослов, така и укрепеният манастир са включени в списъка със световното културно наследство на ЮНЕСКО. Възможност да посетите града и други забележителности с екскурзия организирана от кораба или самостоятелно! 18:30 ч. отплаване към Пирея" },
                    { 8, 1, 8, "В 07:00 ч. корабът пристига в Атина (Пирея) и следва напускане на борда. Приключване на прогрмата заредени с много положителна емоция и спомени за цял живот!" },
                    { 9, 2, 1, "10:00 ч. Начало на круиза. Корабът потегля от пристанището в Рим в посока Неапол. Нощувка на кораба" },
                    { 10, 2, 2, "07:30 ч. Акостиране на пристанището в Неапол. Свободно време за посещение и разглеждане на забележителности. Връщане на кораба. 18:00 ч. Отплаване към Палермо. Нощувка на кораба" },
                    { 11, 2, 3, "11:30 ч. Акостиране на пристанището в Палермо. Свободно време за посещение и разглеждане на забележителности. Връщане на кораба. 19:00 ч. Отплаване към Каляри. Нощувка на кораба" },
                    { 12, 2, 4, "11:00 ч. Акостиране на пристанището в Каляри. Свободно време за посещение и разглеждане на забележителности. Връщане на кораба. 17:00 ч. Отплаване към Тунис. Нощувка на кораба" },
                    { 13, 2, 5, "09:00 ч. Акостиране на пристанището в Тунис. Свободно време за посещение и разглеждане на забележителности. Връщане на кораба. 20:00 ч. Отплаване към Рим. Нощувка на кораба" },
                    { 14, 2, 6, "Престой на кораба. Възползване от удобствата, които предоставя. Нощувка на кораба" },
                    { 15, 2, 7, "В 8:00 корабът пристига в Рим. Напускане на круиза" },
                    { 16, 3, 1, "12:00 ч. Начало на круиза. Корабът потегля от пристанището в Нант в посока Ла Рошел. Нощувка на кораба" },
                    { 17, 3, 2, "07:00 ч. Акостиране на пристанището в Ла Рошел. Свободно време за посещение и разглеждане на забележителности. Връщане на кораба. 16:00 ч. Отплаване към Билбао. Нощувка на кораба" },
                    { 18, 3, 3, "07:00 ч. Акостиране на пристанището в Билбао. Свободно време за посещение и разглеждане на забележителности. Връщане на кораба. 16:00 ч. Отплаване към Порто. Нощувка на кораба" },
                    { 19, 3, 4, "07:00 ч. Акостиране на пристанището в Порто. Свободно време за посещение и разглеждане на забележителности. Връщане на кораба. 18:30 ч. Отплаване към Лисабон. Нощувка на кораба" },
                    { 20, 3, 5, "08:30 ч. Акостиране на пристанището в Лисабон. Свободно време за посещение и разглеждане на забележителности. Връщане на кораба. 20:30 ч. Отплаване към Нант. Нощувка на кораба" },
                    { 21, 3, 6, "Престой на кораба. Възползване от удобствата, които предоставя. Нощувка на кораба" },
                    { 22, 3, 7, "Престой на кораба. Възползване от удобствата, които предоставя. Нощувка на кораба" }
                });

            migrationBuilder.InsertData(
                table: "CruiseDays",
                columns: new[] { "Id", "CruiseId", "DayNumber", "Description" },
                values: new object[] { 23, 3, 8, "В 8:00 корабът пристига в Нант. Напускане на круиза" });

            migrationBuilder.InsertData(
                table: "CruiseRoomTypesCruisesPrices",
                columns: new[] { "CruiseId", "CruiseRoomTypeId", "PricePerNight" },
                values: new object[,]
                {
                    { 1, 1, 70.20m },
                    { 2, 1, 69.10m },
                    { 3, 1, 78.70m },
                    { 1, 2, 79.10m },
                    { 2, 2, 75.90m },
                    { 3, 2, 88.80m },
                    { 1, 3, 91.50m },
                    { 2, 3, 89.10m },
                    { 3, 3, 101.10m },
                    { 1, 4, 118.90m },
                    { 2, 4, 116.40m },
                    { 3, 4, 129.20m }
                });

            migrationBuilder.InsertData(
                table: "Destinations",
                columns: new[] { "Id", "CountryId", "Description", "Name" },
                values: new object[,]
                {
                    { 1, 2, "Кавала е град в Северна Гърция, най-важното пристанище в Източна Македония и Тракия и център на дем Кавала. Градът е и център на Филипийската, Неаполска и Тасоска епархия на Гръцката православна църква", "Кавала" },
                    { 2, 2, "Крит е една от тринадесетте административни области на Република Гърция. Той е най-големият гръцки остров с площ от 8336 км², и петият по големина в Средиземно море, като на него е най-южната точка на Гърция. Населението му е над 600 000 души", "Остров Крит" },
                    { 3, 2, "Лефкада е гръцки остров в Йонийско море. Островът разполага с няколко средно големи курорта по източното крайбрежие и голям брой отделни плажове, най-известни от които са Порто Кацики, Егремни и Нидри. В административно отношение Лефкада е отделен дем в област Йонийски острови. Столица и най-голям град е Лефкада. Другите населени места са типични курорти, които се оживяват предимно през летните месеци. Пристанището на Нидри е изходен пункт за посещение на съседните острови Итака, Кефалония, Скорпио", "Остров Лефкада" },
                    { 4, 2, "Тасос е остров в северната част на Бяло море, наричана източно от него Тракийско море, близо до брега на Източна Македония и Западна Тракия, при устието на река Места. Днес главен и най-голям град е Лимен (с българско име Боровец), често наричан и Тасос. Второто по големина селище е Лименария", "Тасос" },
                    { 5, 3, "Рим е столицата на Италия и област Лацио. Разположен е на реките Тибър и Аниене. Бил е столица на Римската империя, най-могъщата, голяма и най-дълго просъществувалата империя в класическата западна цивилизация. Ватиканът, анклав в Рим, е суверенна държава, седалище на Римската католическа църква и папата.\r\nРим е най-големият град в Италия и един от най-големите европейски градове с площ от 1287,36 кв. км. Предградията му достигат до Тиренско море. В границите на града населението е 2,8 милиона жители (към 31 декември 2019 г.); почти 4,4 милиона живеят в района на Рим.", "Рим" },
                    { 6, 3, "Сицилия е най-големият остров в Средиземно море, с площ 25 460 km² Островът е отделен от Апенинския полуостров чрез Месинския пролив. Три морета мият бреговете ѝ: Тиренско, Йонийско и Средиземно. Релефът е предимно хълмист и планински. На острова се намира вулканът Етна, висок 3323 m. Административен център на Сицилия и най-голям град е Палермо.\r\n", "Сицилия" },
                    { 7, 3, "Остров Сардиния е вторият по големина остров в Средиземно море (след Сицилия). Климатът е типичен средиземноморски. Има площ от 24,090 км2", "Сардиния" },
                    { 8, 4, "Ница е град в Югоизточна Франция, регион Прованс-Алпи-Лазурен бряг. Градът е важен туристически център на Средиземно море. Населението му е 344 064 души, а на градската агломерация – около 933 000 души (1999).\r\nГрадът е разположен по бреговете на Залива на ангелите, заобиколен от приморските Алпи, защитаващи града от хладни ветрове. Столицата на Лазурния бряг е петият по големина град във Франция (след Париж, Марсилия, Лион и Тулуза) и най-големият на френската Ривиера", "Ница" },
                    { 9, 4, "Париж възбужда всички сетива, настояващ да бъде видян, чут, докоснат, усетен на вкус и мирис. От романтичната Сена до просторните многоцветни пейзажи и изтънченото поведение на местните, Париж е същината на всичко френско. Вгледайте се в булевардите, обсипани с внушителни паметници, велики произведения на изкуството и магически светлини. Насладете се на невероятния вкус на сирената, шоколада, виното и морските деликатеси. Почувстайте как вятърът гали лицето ви, докато се движите с ролери покрай Бастилията или усетете пристъпа на страх и еуфория на върха на Айфеловата кула", "Париж" },
                    { 10, 5, "Барселона (Barcelona) е столица на автономната област Каталония и вторият по големина град в Испания.\r\n\r\nИсторията на Барселона може да се разгледа из целия град. Най-старите райони са разположени в близост до морето, включително и пазарната зона, разположена в  готическия квартал (Barri Gotic). От другата страна на главния булевард Ла Рамбла (La Rambla) е известният квартал Равал (Raval). До 80-те години на ХХ в. това е бил бедняшки квартал, включващ и китайски квартал. Днес там може да намерите скъпи бутици и заведения", "Барселона" },
                    { 11, 5, "Със своите 325 слъчневи дни в годината Ла Манга дел Мар Менор е описван като Рая между две морета и когато дойдете в тази част на испанското крайбрежие, ще разберете, че това е най-точното възможно описание. Ла Манга е тясна ивица суша, дълга около 20 километра, която разделя двете \"морета\" – Средиземно и Мар Менор (което не е море, а солена лагуна)", "Ла Манга" },
                    { 12, 5, "Коста Бланка (Costa Blanca - означава Бяло крайбрежие) е брегова линия с дължина над 200 км в испанската провинцията Аликанте. Простира се от Дения на север, през Коста дел Таронгерс, на юг от Торевиеха, през Коста Калида. Включва в себе си много известни дестинации в Испания, като туризма там е много добре развит", "Коста Бланка" },
                    { 13, 5, "Бенидорм (Benidorm) е пристанищен град в провинция Аликанте в автономната област Валенсия. Бенидорм е едно от най-популярните курортни селища в Испания и е част от Коста Бланка. Градът е известен още като „Манхатън на Испания“ или „Бенийорк“ заради многобройните си високи хотели и блокове с ваканционни апартаменти, които често на повече от 25 етажа\r\n\r\nБенидорм е популярен с нощния си живот. Има барове и клубове, концентрирани в центъра на града, а безплатните кабаре представления (от 21 часа до ранните часове) го отличават от подобни курорти", "Бенидорм" },
                    { 14, 6, "Анта̀лия е град на средиземноморското крайбрежие на Турция, административен център на едноименния вилает Анталия\r\nНаселението на града сега е около 1 000 000 жители\r\nАнталия е живописен град, заобиколен от високи планини, Средиземно море, притежаващ красив плаж. Районът на града е изпълнен с множество археологически и исторически обекти. Градът е един от важните центрове на така наречената Турска ривиера", "Анталия" },
                    { 15, 6, "Кушадасъ е град във вилает Айдън, Западна Турция, разположен на брега на Егейско море. Селището е отдалечено на 90 км от третия по големина град в Турция — Измир. Населението наброява приблизително 44 000 души (2005 г.). Кушадасъ е атрактивна туристическа дестинация, посещавана от хиляди души годишно. Буквално преведено, името на града означава Птичият остров", "Кушадасъ" },
                    { 16, 6, "Бодрум (Bodrum) се намира в Югозападна Турция, разположен е на полуостров Бодрум.\r\nБодрум се намира на територията на древният град Халикарнас, където се е намирал мавзолеят от Халикарнас - едно от Седемте чудеса на древния свят. Самият мавзолей е разрушен през Средновековието от силно земетресение, като някои части от него са запазени и са изложени в Британския музей", "Бодрум" },
                    { 17, 6, "Чешме – \"Перлата на Егейска Турция\" , \"Оазисът на турската аристокрация\" или \"Раят за сърфистите на Средиземно море\" е курорт с уникална атмосфера, основан от Римляните през 196 г. пр.н.е., като важно пристанище. Разположен е на върха на полуостров, част от залива на Измир (на 81 км. западно от града). В превод името му означава \"Фонтан\" , наименованието се дължи на изобилието от лечебни извори с топла вода. Освен с изворите, Чешме е известен с винопроизводството си, природните красоти, белите пясъчни плажове и исторически забележителности и предлага на посетителите си красиви природни гледки и богата култура", "Чешме" },
                    { 18, 7, "Разположението на Лисабон (Lisboa, на португалски се произнася Лижбоа) върху седем ниски хълмчета до река Тежу, привличаща някога търговци и заселници, е истински впечатляваща гледка. Добавете културното разнообразие и архитектурата и ще получите един от най-интересните градове в Европа\r\n\r\nЛисабон просто сияе в отражението си в реката - един поглед и ще сте влюбени в него  В центъра на Лисабон има широки, оградени с дървета площади, украсени със сгради в стил арт нуво, тротоари с мозайка и улични кафенета. Старият град със своите стръмни улички и уютни барове предлага невероятна атмосфера", "Лисабон" },
                    { 19, 8, "Прага е столицата и най-големият град на Чехия\r\nНаселението на града през 2012 година е 1 241 273 души, което е над 10% от населението на Чешката република. Разположен е на река Вълтава. Прага е смятана за един от най-красивите градове в света и е сред най-посещаваните от туристи\r\nИзвестна е с многообразната си архитектура от различни периоди - барок, рококо, готика, романтизъм, кубизъм и др.", "Прага" },
                    { 20, 9, "Ще почувствате колко различен е този град. Различен от всички, които сте виждали до сега. Сгради, повечето бели и масивни, следващи прави линии, които се кръстосват по цялата площ на града като бяла рибарска мрежа. Подреденост, избегнала напълно тягостното внушение на урбанизацията. След обиколка на града всички изтъркани фрази на възхищение, вече изпразнени от съдържание, изведнъж отново ще имат смисъл. Неволно ще повтаряте убедено „Това е най–красивият град в Южна Америка!“", "Буенос Айрес" },
                    { 21, 10, "Хавана е столицата на Куба и най-голям град в страната и на Антилските острови. Градът е една от четиринадесетте провинции на страната, наричана Сиудад де ла Абана. Населението му е около 2 110 000 души", "Хавана" },
                    { 22, 11, "Лѝма (на испански: Lima) е столица и най-голям град на Република Перу. Градът е разположен в алувиалната долина на историческата река Римак, на пустинния и висок тихоокеански перуански бряг. Заедно с пристанищния град Каляо образува най-голямата урбанизирана зона в Перу (известна като голяма Лима) и една от най-големите в Южна Америка", "Лима" },
                    { 23, 12, "Рио де Жанейро (на португалски: Rio de Janeiro, което означава януарска река) е град в Югоизточна Бразилия, център на щат Рио де Жанейро\r\n\r\nНаселението на града е около 6 100 000 души (2006),[1] а на градската агломерация – около 11 582 000 души (2009). Рио де Жанейро е вторият по големина град в Бразилия след Сао Пауло и служи за столица на страната от 1764 до 1960, когато столицата е преместена в Бразилия. През 1808 – 1821, градът е столица на Португалската империя", "Рио де Жанейро" },
                    { 24, 13, "Токио е столицата на Япония. Градът е една от 47-те префектури в страната и център на Голямо Токио, най-големият метрополен регион в света.[3] Токио е седалище на японското правителство и на Императорския дворец. Разположен е в региона Канто в югоизточната част на главния японски остров Хоншу и включва в административните си граници архипелазите Идзу и Бонински острови", "Токио" },
                    { 25, 13, "Киото е град в Япония с население 1,5 милиона души. В миналото е бил столица на императорска Япония, сега е столица на префектура Киото и част от района Осака-Кобе-Киото. Киото е разделен на 11 квартала\r\nКиото е една от най-популярните туристически дестинации в Япония", "Киото" },
                    { 26, 14, "Канди е известен със своята архитектура. „Храмът на Зъба“ е един от най-забележителните будистки храмове в Канди и страната. Намира се в дворцов комплекс. В него се съхранява безценна будистка реликва – зъб на Буда. Други значими архитектурни обекти са: Дворцовият комплекс, храмът на Бог Ната, храмът на Бог Вишну и храмът на Бог Катарагама", "Канди" },
                    { 27, 15, "С население от над 21 000 000 жители и площ от около 16 801 km² градът е сред най-населените и най-обширните в света\r\n\r\nПекин има статут на град-провинция и граничи с Тиендзин на югозапад и с провинция Хъбей на север, запад и юг. Градът се разделя на 14 окръга – градски и предградия, и две селски общини. От 1949 г. Пекин е столица на Китайската народна република. Той е вторият по население град в страната и е нейният политически, образователен и културен център", "Пекин" },
                    { 28, 16, "Името Сингапур произхожда от санскрит, съставено е от думите синга, сингха и пура, и означава „Лъвски град“. При заселването през 7. – 8. век, тогавашното княжество получава името Темасек („Морски град“), но според легендата то скоро след това било сменено на „Лъвски град“. Причина за това била появата на морско чудовище, наподобяващо лъв. „Мерлион“ – знакът на града – води от там своето начало", "Сингапур" },
                    { 29, 17, "Малдивите са островна държава в Индийския океан, състояща се от група атоли и намираща се на югозапад от Индия и на около 700 км югозападно от Шри Ланка. Те са най-малката азиатска държава и по население, и по територия\r\n\r\nНай-високата им точка е 2,3 метра над морското равнище, а средната им височина е 1,5 м. Общата им площ е 300 км². Столицата се намира на най-големия атол и се нарича Мале. Малдивите нямат нито една река или голямо езеро и се чувства недостига на питейна вода. Температурата на въздуха целогодишно е между 24°C до 33°C", "Мале" },
                    { 30, 18, "Хургада е курортен град в Египет, административен център на мухафаза Червено море. В миналото курортът е бил малко рибарско селище, но сега със своите чисти брегове и рифове се се нарежда сред най-добрите египетски курорти\r\nС повече от 20 км плажна ивица изпъстрена с много хотели, Хургада може да задоволи изискванията на всеки турист. Предлага атракции като гмуркане с акваланг, уиндсърфинг и пустинни сафарита. Хурагда е често посещавана дестинация от руснаци, немци и чехи, както и от други европейски туристи", "Хургада" },
                    { 31, 18, "Сома Бей е крайбрежен курорт на Червено море в Египет, на 45 км южно от международното летище Хургада и на около 28 км северно от пристанището Сафага. Самостоятелната общност от 10 000 000 m² в Сома Бей се намира на полуостров, заобиколен от всички страни от морето", "Сома Бей" },
                    { 32, 18, "Макади Бей е курортен град – част от ривиерата на Червено море, осеян с хотели и спа центрове. Пясъчните плажове са популярни за водолазно гмуркане и гмуркане с шнорхел. В района се предлагат организирани екскурзии, които включват гмуркане в пещери край коралови рифове, както и разглеждане на морски обитатели, като баракуди. Край залива са разположени множество работещи до късно дискотеки и ресторанти, където се предлагат морска храна и кухня от цял свят. Популярните сред семействата атракции включват аквапарк и парка Mini Egypt с модели на известни египетски забележителности", "Макада Бей" },
                    { 33, 19, "Мароко е един от туристическите гиганти в Африка. Всяка година страната се посещава от милиони туристи, които идват заради топлия климат, прекрасни плажове, огнено червени пейзажи и ориенталска култура. Най-посещасваните градове в Кралство Мароко са Касабланка, Маракеш и Агадир. Колкото и да е странно тези градове са изключително различни един от друг и всеки от тях притежава своя собствена неповторима идентичност", "Мароко" },
                    { 34, 20, "Джерба или Джарба е остров на Тунис в област Меденин. Намира се в залива Габес на Средиземно море\r\n\r\nТова е най-големият средиземноморски остров на Африка. Площта му е 514 км². Повърхността на острова е равнинна. За източници на вода се използват артезиански кладенци", "Остров Джерба" },
                    { 35, 20, "Тунис е държава в Северна Африка, населена предимно от араби. Има излаз на Средиземно море. Граничи с Алжир на запад и с Либия на юг и изток", "Тунис" }
                });

            migrationBuilder.InsertData(
                table: "PassByDestinations",
                columns: new[] { "Id", "CountryId", "Name" },
                values: new object[,]
                {
                    { 1, 2, "Атина (Пирея)" },
                    { 2, 2, "Солун" },
                    { 3, 2, "Кавала" },
                    { 4, 6, "Истанбул" },
                    { 5, 6, "Дикили" },
                    { 6, 6, "Кушадасъ" },
                    { 7, 2, "Патмос" }
                });

            migrationBuilder.InsertData(
                table: "PassByDestinations",
                columns: new[] { "Id", "CountryId", "Name" },
                values: new object[,]
                {
                    { 8, 3, "Рим" },
                    { 9, 3, "Неапол" },
                    { 10, 3, "Палермо" },
                    { 11, 3, "Каляри" },
                    { 12, 20, "Тунис" },
                    { 13, 4, "Нант" },
                    { 14, 4, "Ла Рошел" },
                    { 15, 5, "Билбао" },
                    { 16, 7, "Порто" },
                    { 17, 7, "Лисабон" }
                });

            migrationBuilder.InsertData(
                table: "CruisesPassByDestinations",
                columns: new[] { "CruiseId", "PassByDestinationId", "DestinationId", "PositionOfDestination" },
                values: new object[,]
                {
                    { 1, 1, null, 1 },
                    { 1, 2, null, 2 },
                    { 1, 3, null, 3 },
                    { 1, 4, null, 4 },
                    { 1, 5, null, 5 },
                    { 1, 6, null, 6 },
                    { 1, 7, null, 7 },
                    { 2, 8, null, 1 },
                    { 2, 9, null, 2 },
                    { 2, 10, null, 3 },
                    { 2, 11, null, 4 },
                    { 2, 12, null, 5 },
                    { 3, 13, null, 1 },
                    { 3, 14, null, 2 },
                    { 3, 15, null, 3 },
                    { 3, 16, null, 4 },
                    { 3, 17, null, 5 }
                });

            migrationBuilder.InsertData(
                table: "UnorganizedOffers",
                columns: new[] { "Id", "DestinationId", "IsAvailable" },
                values: new object[,]
                {
                    { 1, 1, true },
                    { 2, 2, true },
                    { 3, 3, true },
                    { 4, 4, true },
                    { 5, 5, true },
                    { 6, 6, true },
                    { 7, 7, true },
                    { 8, 8, true },
                    { 9, 9, true },
                    { 10, 10, true },
                    { 11, 11, true },
                    { 12, 12, true },
                    { 13, 13, true },
                    { 14, 14, true },
                    { 15, 15, true },
                    { 16, 16, true },
                    { 17, 17, true },
                    { 18, 18, true },
                    { 19, 19, true },
                    { 20, 20, true },
                    { 21, 21, true },
                    { 22, 22, true },
                    { 23, 23, true },
                    { 24, 24, true },
                    { 25, 25, true }
                });

            migrationBuilder.InsertData(
                table: "UnorganizedOffers",
                columns: new[] { "Id", "DestinationId", "IsAvailable" },
                values: new object[,]
                {
                    { 26, 26, true },
                    { 27, 27, true },
                    { 28, 28, true },
                    { 29, 29, true },
                    { 30, 30, true },
                    { 31, 31, true },
                    { 32, 32, true },
                    { 33, 33, true },
                    { 34, 34, true },
                    { 35, 35, true }
                });

            migrationBuilder.InsertData(
                table: "Hotels",
                columns: new[] { "Id", "Location", "Name", "UnorganizedOfferId" },
                values: new object[,]
                {
                    { 1, "El. Venizelou 27, Kavala 653 02, Гърция", "Airotel Galaxy", 1 },
                    { 2, "Erithrou Stavrou 32, Kavala 654 03, Гърция", "Oceanis Hotel", 1 },
                    { 3, "Erithrou Stavrou 44, Kavala 654 03, Гърция", "Esperia Hotel", 1 },
                    { 4, "Kalami, Kiani Beach, Kalives 730 03, Гърция", "Kiani Beach Resort Family All Inclusive", 2 },
                    { 5, "Peninsula Hotel, Agia Pelagia, Iraklio 715 00, Гърция", "Peninsula Resort & Spa", 2 },
                    { 6, "stella island, Analipsi 700 14, Гърция", "Stella Island Luxury Resort & Spa", 2 },
                    { 7, "Epar.Od. Lefkas - Kato Exanthias, Lefkada 310 80, Гърция", "Mylos Mountain Villas", 3 },
                    { 8, "Beach of Ponti Vasiliki, Lefkada 310 82, Гърция", "Ponti Beach Hotel", 3 },
                    { 9, "ag.nikitas, Lefkada 310 80, Гърция", "Santa Marina Hotel", 3 },
                    { 10, "Unnamed Road, Skala Marion 640 02, Гърция", "Atoli Studios", 4 },
                    { 11, "Thasou, Limenas Thassos 640 04, Гърция", "Anassa Blue Boutique Hotel", 4 },
                    { 12, "Skala, Prinos 640 10, Гърция", "Elektra Comfort Hotel", 4 },
                    { 13, "Via del Babuino, 148, 00187 Roma RM, Италия", "Babuino house", 5 },
                    { 14, "Via di S. Croce in Gerusalemme, 83, 00185 Roma RM, Италия", "Seven Miracles Inn", 5 },
                    { 15, "Viale Gorizia, 14, 00198 Roma RM, Италия", "Agnes Roma", 5 },
                    { 16, "Contrada Samuele, snc, 97018 Sampieri RG, Италия", "VOI Marsa Siclà Essentia", 6 },
                    { 17, "Via Migliaro, 4, 90011 Bagheria PA, Италия", "La Casa del Ducato", 6 },
                    { 18, "Contrada Salsa, 92010 Siculiana AG, Италия", "ADLER Spa Resort SICILIA", 6 },
                    { 19, "Via Serchio, 139, 09045 Quartu Sant'Elena CA, Италия", "Sighientu Resort", 7 },
                    { 20, "Via Li Fureddi, 20, 07052 San Teodoro SS, Италия", "Le Tre Querce", 7 },
                    { 21, "Viale la Pelosa, 35, 07040 Stintino SS, Италия", "Residence Hotel La Pelosetta", 7 },
                    { 22, "Ница, Франция", "Grand T1 proche Promenade des Anglais", 8 },
                    { 23, "21 Rue Massena, 06000 Nice, Франция", "Residence Share Inn", 8 },
                    { 24, "2 Rue Halévy, 06000 Nice, Франция", "Hôtel Mercure Nice Promenade des Anglais", 8 },
                    { 25, "25 Rue Washington Finestate, 75008 Paris, Франция", "FINESTATE Coliving Champs-Elysées", 9 },
                    { 26, "5 Rue des Carmes, 75005 Paris, Франция", "Hotel des Carmes by Malone", 9 },
                    { 27, "122-126 Rue du Château des Rentiers, 75013 Paris, Франция", "Domitys L'Ellipse", 9 },
                    { 28, "Pg. de Pujades, 11-13, Sant Martí, 08018 Barcelona, Испания", "Motel One Barcelona-Ciutadella", 10 },
                    { 29, "C/ de Ramon Turró, 169, B, Sant Martí, 08005 Barcelona, Испания", "Acta Voraport", 10 },
                    { 30, "479-487, Carrer de Ramon Llull, 08930 Barcelona, Испания", "Tembo Barcelona", 10 },
                    { 31, "Gran Vía de la Manga, 30380 La Manga, Murcia, Испания", "AluaSun Doblemar", 11 },
                    { 32, "Pl. del Cavanna, s/n, 30380 La Manga, Murcia, Испания", "Hotel Izán Cavanna", 11 },
                    { 33, "Gran Vía de la Manga, s/n, Km. 1,4, 30380 La Manga, Murcia, Испания", "Hotel Los Delfines", 11 },
                    { 34, "Av. de Estocolmo, 4, 03503 Benidorm, Alicante, Испания", "Port Benidorm Hotel & Spa 4* Sup", 12 },
                    { 35, "Av de Cataluña, 20, 03540 Alicante, Испания", "Port Alicante City & Beach", 12 },
                    { 36, "Avenida Finlandia, 15 Urb, 03130 Gran Alacant, Alicante, Испания", "AJ Gran Alacant by SH Hoteles", 12 },
                    { 37, "Av. de Panamá, 5, 03502 Benidorm, Alicante, Испания", "Mercure Benidorm", 13 },
                    { 38, "Av. de Europa, 1, 03503 Benidorm, Alicante, Испания", "Hotel Cimbel", 13 },
                    { 39, "C. Gerona, 39, 41, 03503 Benidorm, Alicante, Испания", "Ambassador Playa II", 13 },
                    { 40, "Kızıltoprak, 978. Sk No.14, 07300 Muratpaşa/Antalya, Турция", "Toprak Otel", 14 },
                    { 41, "Tahılpazarı, 462. Sk. NO:2, 07040 Muratpaşa/Antalya, Турция", "Lupo Libero Hotel Spa", 14 },
                    { 42, "Yıldız, 244. Sk. No:84 D:97, 07050 Muratpaşa/Antalya, Турция", "La Paloma Hotel", 14 }
                });

            migrationBuilder.InsertData(
                table: "Hotels",
                columns: new[] { "Id", "Location", "Name", "UnorganizedOfferId" },
                values: new object[,]
                {
                    { 43, "Camiatik, Aslanlar Cd. no:1, 09400 Kuşadası/Aydın, Турция", "Eliada Hotel", 15 },
                    { 44, "Türkmen, Atatürk Blv. No:42, 09400 Kuşadası/Aydın, Турция", "Ilayda Avantgarde Hotel", 15 },
                    { 45, "Türkmen, Gazi Beğendi Sk. No:7, 09400 Kuşadası/Aydın, Турция", "Charisma De Luxe Hotel", 15 },
                    { 46, "Gümbet, 1510. Sk. No:8, 48400 Bodrum/Muğla, Турция", "Smart Stay Beach Bodrum - All Inclusive", 16 },
                    { 47, "Hacıahmetler Mevkii Bitez, Pomelan Cd. No:32, 48470 Bodrum/Muğla, Турция", "Hotel Ambrosia", 16 },
                    { 48, "Eskiçeşme, Eskiçeşme Mahallesi Osman Nuri Bilgin Caddesi, Haremtan Sk. No: 48, 48400 Bodrum/Muğla, Турция", "Degirmenburnu Residence", 16 },
                    { 49, "Sakarya, 3100. Sk. No:1, 35930 Çeşme/İzmir, Турция", "Grand Yayla Hotel", 17 },
                    { 50, "İsmet İnönü, 2032. Sk. No:32, 35930 Çeşme/İzmir, Турция", "Amber Boutique Hotel", 17 },
                    { 51, "16 Eylül, 3011. Sk. 37/A, 35930 Çeşme/İzmir, Турция", "Bayram Hotel", 17 },
                    { 52, "Av. Óscar Monteiro Torres 39, 1000-220 Lisboa, Португалия", "Oscar Concept Apartments", 18 },
                    { 53, "Av. Eng. Arantes e Oliveira 9, 1900-221 Lisboa, Португалия", "Ramada by Wyndham Lisbon", 18 },
                    { 54, "R. Filipe Folque 12, 1069-191 Lisboa, Португалия", "VIP Executive Picoas Hotel", 18 },
                    { 55, "Biskupská 1347, 110 00 Petrská čtvrť, Чехия", "Luxury Family Hotel Bílá Labuť", 19 },
                    { 56, "Teplická 492, 190 00 Praha 9, Чехия", "Hotel Duo", 19 },
                    { 57, "65, Seifertova 615, Žižkov, 130 00 Praha 3, Чехия", "Hotel Ariston", 19 },
                    { 58, "Sarmiento 1431, C1042 Cdad. Autónoma de Buenos Aires, Аржентина", "Huinid Obelisco Hotel", 20 },
                    { 59, "Tucumán 451, C1049 Cdad. Autónoma de Buenos Aires, Аржентина", "HTL Urbano", 20 },
                    { 60, "Lavalle 560, C1047 AAL, Cdad. Autónoma de Buenos Aires, Аржентина", "Grand King Hotel", 20 },
                    { 61, "4H54+GW5, Avenida 3ra, La Habana 11300, Куба", "Hotel Meliá Habana", 21 },
                    { 62, "4JQR+5VG, Calle San Rafael (entre Monserrate y, Agramonte, La Habana 10100, Куба", "Gran Hotel Manzana Kempinski La Habana", 21 },
                    { 63, "267 Agramonte, La Habana, Куба", "Iberostar Parque Central", 21 },
                    { 64, "Q4H9+F2X, Ferrocarril, Lima 15823, Перу", "Casa Pachacamac", 22 },
                    { 65, "Jr, Jiron Martinez de Pinillos 270, Barranco 15063, Перу", "Amazing Casa Wynwood in Barranco", 22 },
                    { 66, "Jr. Independencia 141, Lima 15074, Перу", "DoubleTree by Hilton Lima Miraflores El Pardo", 22 },
                    { 67, "R. Sen. Dantas, 25 - Centro, Rio de Janeiro - RJ, 20031-202, Бразилия", "Hotel Atlântico Business Centro", 23 },
                    { 68, "R. do Rezende, 87 - Centro, Rio de Janeiro - RJ, 20231-091, Бразилия", "Hotel Atlantico Prime", 23 },
                    { 69, "R. Sen. Dantas, 24 - Centro, Rio de Janeiro - RJ, 20031-200, Бразилия", "Hotéis OK", 23 },
                    { 70, "3 Chome-39-5 Ryusen, Taito City, Tokyo 110-0012, Япония", "plat hostel keikyu minowa forest", 24 },
                    { 71, "Япония, 〒101-0041 Tokyo, Chiyoda City, Kanda Sudacho, 1 Chome−4−7 ベルケンホテル神田", "Belken Hotel Kanda", 24 },
                    { 72, "2 Chome-9-1 Tabatashinmachi, Kita City, Tokyo 114-0012, Япония", "Tabata Oji Hotel", 24 },
                    { 73, "411 Iwatoyamacho, Shimogyo Ward, Kyoto, 600-8445, Япония", "Imu Hotel Kyoto", 25 },
                    { 74, "240 Odawaracho, Shimogyo Ward, Kyoto, 600-8430, Япония", "Hotel Doria Kyoto Karasuma Gojo", 25 },
                    { 75, "Япония, 〒605-0856 Kyoto, Higashiyama Ward, Atarashicho, 133番地 ・134番地 3", "West Japan Kyoto Kiyomizu", 25 },
                    { 76, "84 Rajapihilla Mawatha, Kandy 20000, Шри Ланка", "Kandy Hills", 26 },
                    { 77, "34 Rajapihilla Mawatha, Kandy 20000, Шри Ланка", "Rivora Heights", 26 },
                    { 78, "39/3 Rajapihilla Mawatha, Kandy 20000, Шри Ланка", "Lakewood Residence", 26 },
                    { 79, "WCQR+RXF, Dongcheng, Beijing, Китай, 100007", "Holiday Inn Express Beijing Dongzhimen, an IHG Hotel", 27 },
                    { 80, "Китай, Beijing, Dongcheng, 东单灯市口大街88号 邮政编码: 100006", "Sunworld Hotel Wangfujing", 27 },
                    { 81, "Китай, Beijing, Dongcheng, 建国门内大街建国门内大街甲18号 邮政编码: 100005", "Howard Johnson Paragon Hotel Beijing", 27 },
                    { 82, "2 Serangoon Rd, #03-01, Сингапур 218227", "Citadines Rochor", 28 },
                    { 83, "8 Club St, Сингапур 069472", "Mercure ICON Singapore City Centre", 28 },
                    { 84, "500 Jln Sultan, Сингапур 199020", "Hotel Boss", 28 }
                });

            migrationBuilder.InsertData(
                table: "Hotels",
                columns: new[] { "Id", "Location", "Name", "UnorganizedOfferId" },
                values: new object[,]
                {
                    { 85, "Rozemead Goalhi, Rasdhoo, Малдиви", "Local Paradise Rasdhoo", 29 },
                    { 86, "A.A Villanufannu Magu, Rasdhoo 09020, Малдиви", "Beach Cottage", 29 },
                    { 87, "Lankanfinolhu, 08420, Малдиви", "Villa Nautica, Maldives", 29 },
                    { 88, "Mamsha Road (The Corniche St, Hurghada, Red Sea Governorate 84517, Египет", "Pickalbatros Blu Spa Resort - Adults Friendly 16 Years Plus- Ultra All-Inclusive", 30 },
                    { 89, "El-Nasr, Hurghada 2, Red Sea Governorate 1972703, Египет", "Moon beach resort", 30 },
                    { 90, "Hurghada, Red Sea Governorate 1964413, Египет", "Redcon Suites", 30 },
                    { 91, "CMF9+93, Kite center, street, Hurghada 2, Red Sea Governorate 84513, Египет", "Casa Cook El Gouna", 31 },
                    { 92, "Hill Villas Rd, Hurghada 2, Red Sea Governorate 84513, Египет", "The Chedi El Gouna", 31 },
                    { 93, "Between Phases 1 & 2, 84513, Red Sea Governorate, Египет", "Club Paradisio El Gouna - Red Sea", 31 },
                    { 94, "XW99+7QF طريق الغردقة, Red Sea Governorate, Египет", "Siva Golden Bay Makadi", 32 },
                    { 95, "Hurghada 1, Ал Бахр ал Ахмар 1960510, Египет", "Tia Heights Makadi Bay", 32 },
                    { 96, "Km 32 طريق الغردقة - سفاجا, Hurghada 1, Red Sea Governorate 84945, Египет", "Stella Makadi Hotels & Resorts", 32 },
                    { 97, "Route des Camps Désert, Agafay 40272, Мароко", "Selina Agafay Nomad Camp", 33 },
                    { 98, "Tinghir, Мароко", "Auberge Le Festival Todra Gorge", 33 },
                    { 99, "n, 13 Rue fath, Errachidia 52000, Мароко", "Kenzi Rissani", 33 },
                    { 100, "BP467, 4116, Тунис", "Dar Yasmine Djerba", 34 },
                    { 101, "Route Touristique Midoun Djerba, Djerba 4116, Тунис", "Iberostar Mehari Djerba", 34 },
                    { 102, "Houmt Souk 4128, Тунис", "Radisson Blu Palace Resort & Thalasso, Djerba", 34 },
                    { 103, "Q5XH+2MF, Rue de Suisse, Tunis, Тунис", "Hôtel Suisse Tunis", 35 },
                    { 104, "Gouvernorat de, 6 Rue des Andalous, Tunis 1008, Тунис", "Palais Bayram", 35 },
                    { 105, "Tunis, Тунис", "El Oumara Hotel", 35 }
                });

            migrationBuilder.InsertData(
                table: "UnorganizedOffersTransportTypesPrices",
                columns: new[] { "TransportTypeId", "UnorganizedOfferId", "Price" },
                values: new object[,]
                {
                    { 2, 1, 40m },
                    { 3, 1, 0m },
                    { 1, 2, 400m },
                    { 1, 3, 450m },
                    { 2, 3, 60m },
                    { 3, 3, 0m },
                    { 1, 4, 225m },
                    { 2, 4, 80m },
                    { 3, 4, 0m },
                    { 1, 5, 500m },
                    { 2, 5, 150m },
                    { 3, 5, 0m },
                    { 1, 6, 500m },
                    { 1, 7, 525m },
                    { 1, 8, 550m },
                    { 2, 8, 210m },
                    { 3, 8, 0m },
                    { 1, 9, 600m },
                    { 2, 9, 240m },
                    { 3, 9, 0m },
                    { 1, 10, 700m }
                });

            migrationBuilder.InsertData(
                table: "UnorganizedOffersTransportTypesPrices",
                columns: new[] { "TransportTypeId", "UnorganizedOfferId", "Price" },
                values: new object[,]
                {
                    { 2, 10, 280m },
                    { 3, 10, 0m },
                    { 1, 11, 650m },
                    { 2, 11, 300m },
                    { 3, 11, 0m },
                    { 1, 12, 670m },
                    { 2, 12, 310m },
                    { 3, 12, 0m },
                    { 1, 13, 680m },
                    { 2, 13, 295m },
                    { 3, 13, 0m },
                    { 1, 14, 320m },
                    { 2, 14, 110m },
                    { 3, 14, 0m },
                    { 1, 15, 250m },
                    { 2, 15, 95m },
                    { 3, 15, 0m },
                    { 1, 16, 310m },
                    { 2, 16, 105m },
                    { 3, 16, 0m },
                    { 1, 17, 240m },
                    { 2, 17, 85m },
                    { 3, 17, 0m },
                    { 1, 18, 750m },
                    { 2, 18, 310m },
                    { 3, 18, 0m },
                    { 1, 19, 200m },
                    { 2, 19, 70m },
                    { 3, 19, 0m },
                    { 1, 20, 1400m },
                    { 1, 21, 1320m },
                    { 1, 22, 1350m },
                    { 1, 23, 1380m },
                    { 1, 24, 1500m },
                    { 1, 25, 1490m },
                    { 1, 26, 1200m },
                    { 1, 27, 1440m },
                    { 1, 28, 1400m },
                    { 1, 29, 1300m },
                    { 1, 30, 480m },
                    { 1, 31, 490m },
                    { 1, 32, 500m }
                });

            migrationBuilder.InsertData(
                table: "UnorganizedOffersTransportTypesPrices",
                columns: new[] { "TransportTypeId", "UnorganizedOfferId", "Price" },
                values: new object[] { 1, 33, 880m });

            migrationBuilder.InsertData(
                table: "UnorganizedOffersTransportTypesPrices",
                columns: new[] { "TransportTypeId", "UnorganizedOfferId", "Price" },
                values: new object[] { 1, 34, 680m });

            migrationBuilder.InsertData(
                table: "UnorganizedOffersTransportTypesPrices",
                columns: new[] { "TransportTypeId", "UnorganizedOfferId", "Price" },
                values: new object[] { 1, 35, 650m });

            migrationBuilder.InsertData(
                table: "HotelsRoomTypesPrices",
                columns: new[] { "HotelId", "RoomTypeId", "PricePerNight" },
                values: new object[,]
                {
                    { 1, 1, 81.50m },
                    { 1, 2, 90.50m },
                    { 1, 5, 110m },
                    { 1, 10, 59.50m },
                    { 2, 1, 80.50m },
                    { 2, 2, 92.50m },
                    { 2, 5, 112m },
                    { 2, 10, 58m },
                    { 3, 1, 81m },
                    { 3, 2, 93.40m },
                    { 3, 5, 114.50m },
                    { 3, 10, 62m },
                    { 4, 1, 91.70m },
                    { 4, 2, 99.90m },
                    { 4, 3, 105.20m },
                    { 4, 4, 112m },
                    { 4, 5, 115m },
                    { 4, 10, 69m },
                    { 5, 1, 90.10m },
                    { 5, 2, 101.10m },
                    { 5, 5, 115m },
                    { 5, 9, 147.90m },
                    { 5, 10, 73.20m },
                    { 6, 1, 91.10m },
                    { 6, 2, 100.10m },
                    { 6, 5, 111m },
                    { 6, 9, 150.90m },
                    { 6, 10, 68.20m },
                    { 7, 1, 89.20m },
                    { 7, 2, 97.10m },
                    { 7, 3, 105m },
                    { 7, 4, 114.40m },
                    { 7, 8, 104m },
                    { 7, 10, 71m },
                    { 8, 1, 88.20m },
                    { 8, 2, 96.10m },
                    { 8, 5, 115m },
                    { 8, 9, 139.70m },
                    { 8, 10, 70.10m },
                    { 9, 1, 88.90m },
                    { 9, 2, 96.40m },
                    { 9, 5, 115.80m }
                });

            migrationBuilder.InsertData(
                table: "HotelsRoomTypesPrices",
                columns: new[] { "HotelId", "RoomTypeId", "PricePerNight" },
                values: new object[,]
                {
                    { 9, 10, 70.20m },
                    { 10, 1, 95.20m },
                    { 10, 2, 103.40m },
                    { 10, 10, 75.20m },
                    { 11, 1, 96.20m },
                    { 11, 2, 103.30m },
                    { 11, 5, 113.30m },
                    { 11, 10, 74.10m },
                    { 12, 1, 96.70m },
                    { 12, 2, 102.30m },
                    { 12, 5, 113.39m },
                    { 12, 8, 107m },
                    { 12, 10, 72.10m },
                    { 13, 1, 103.10m },
                    { 13, 2, 113.30m },
                    { 13, 5, 121.15m },
                    { 13, 10, 82.10m },
                    { 14, 1, 105.10m },
                    { 14, 2, 111.30m },
                    { 14, 8, 115.15m },
                    { 14, 10, 83.10m },
                    { 15, 1, 104.20m },
                    { 15, 2, 114.30m },
                    { 15, 10, 82.10m },
                    { 16, 1, 98.20m },
                    { 16, 2, 109.30m },
                    { 16, 8, 112.05m },
                    { 16, 10, 75.10m },
                    { 17, 1, 98.50m },
                    { 17, 2, 109.10m },
                    { 17, 8, 113m },
                    { 17, 10, 75.90m },
                    { 18, 1, 100.50m },
                    { 18, 2, 111.30m },
                    { 18, 5, 119.05m },
                    { 18, 10, 79.90m },
                    { 19, 1, 96.50m },
                    { 19, 2, 108.30m },
                    { 19, 5, 119.05m },
                    { 19, 9, 145.05m },
                    { 19, 10, 81.90m },
                    { 20, 1, 93.10m }
                });

            migrationBuilder.InsertData(
                table: "HotelsRoomTypesPrices",
                columns: new[] { "HotelId", "RoomTypeId", "PricePerNight" },
                values: new object[,]
                {
                    { 20, 2, 104.30m },
                    { 20, 8, 111.11m },
                    { 20, 10, 75.90m },
                    { 21, 1, 94.30m },
                    { 21, 2, 103.90m },
                    { 21, 8, 112.20m },
                    { 21, 10, 70.90m },
                    { 22, 1, 105.30m },
                    { 22, 2, 114.90m },
                    { 22, 5, 123.20m },
                    { 22, 6, 170.90m },
                    { 22, 10, 60.90m },
                    { 23, 1, 99.30m },
                    { 23, 2, 109.90m },
                    { 23, 3, 114.20m },
                    { 23, 4, 119.90m },
                    { 23, 10, 68.90m },
                    { 24, 1, 97.30m },
                    { 24, 2, 106.90m },
                    { 24, 5, 114.20m },
                    { 24, 8, 109.90m },
                    { 24, 10, 69.90m },
                    { 25, 1, 120.20m },
                    { 25, 2, 131.90m },
                    { 25, 5, 143.40m },
                    { 25, 6, 210.90m },
                    { 25, 7, 370.80m },
                    { 25, 10, 59.90m },
                    { 26, 1, 121.20m },
                    { 26, 2, 132.90m },
                    { 26, 5, 143.20m },
                    { 26, 6, 215.90m },
                    { 26, 7, 365.80m },
                    { 26, 10, 59.90m },
                    { 27, 1, 120.20m },
                    { 27, 2, 130.90m },
                    { 27, 5, 143.90m },
                    { 27, 6, 215.10m },
                    { 27, 7, 364.40m },
                    { 27, 10, 59.90m },
                    { 28, 1, 110.20m },
                    { 28, 2, 119.90m }
                });

            migrationBuilder.InsertData(
                table: "HotelsRoomTypesPrices",
                columns: new[] { "HotelId", "RoomTypeId", "PricePerNight" },
                values: new object[,]
                {
                    { 28, 5, 128.90m },
                    { 28, 6, 190.10m },
                    { 28, 7, 310.40m },
                    { 28, 10, 57.50m },
                    { 29, 1, 109.20m },
                    { 29, 2, 118.90m },
                    { 29, 5, 129.80m },
                    { 29, 6, 191.10m },
                    { 29, 7, 315.40m },
                    { 29, 10, 56.50m },
                    { 30, 1, 109.50m },
                    { 30, 2, 118.50m },
                    { 30, 5, 129.10m },
                    { 30, 6, 191.60m },
                    { 30, 7, 315.90m },
                    { 30, 10, 56.40m },
                    { 31, 1, 93.10m },
                    { 31, 2, 101.50m },
                    { 31, 5, 113.10m },
                    { 31, 6, 170.60m },
                    { 31, 10, 58.40m },
                    { 32, 1, 93.50m },
                    { 32, 2, 101.70m },
                    { 32, 5, 113.20m },
                    { 32, 6, 168.80m },
                    { 32, 10, 58.90m },
                    { 33, 1, 94.50m },
                    { 33, 2, 102.50m },
                    { 33, 5, 112.20m },
                    { 33, 6, 165.90m },
                    { 33, 10, 58.10m },
                    { 34, 1, 85.50m },
                    { 34, 2, 94.40m },
                    { 34, 5, 103.20m },
                    { 34, 8, 99.90m },
                    { 34, 10, 57.20m },
                    { 35, 1, 83.50m },
                    { 35, 2, 92.40m },
                    { 35, 8, 98.90m },
                    { 35, 10, 57.40m },
                    { 36, 1, 82.50m },
                    { 36, 2, 90.40m }
                });

            migrationBuilder.InsertData(
                table: "HotelsRoomTypesPrices",
                columns: new[] { "HotelId", "RoomTypeId", "PricePerNight" },
                values: new object[,]
                {
                    { 36, 8, 97.10m },
                    { 36, 10, 52.40m },
                    { 37, 1, 82.60m },
                    { 37, 2, 90.30m },
                    { 37, 8, 97.20m },
                    { 37, 10, 52.50m },
                    { 38, 1, 82.10m },
                    { 38, 2, 91.30m },
                    { 38, 8, 95.20m },
                    { 38, 10, 52.40m },
                    { 39, 1, 80.10m },
                    { 39, 2, 90.30m },
                    { 39, 8, 96.90m },
                    { 39, 10, 53.40m },
                    { 40, 1, 90.30m },
                    { 40, 2, 98.10m },
                    { 40, 8, 103.90m },
                    { 40, 10, 71.40m },
                    { 41, 1, 90.50m },
                    { 41, 2, 98.50m },
                    { 41, 8, 104.90m },
                    { 41, 10, 72.40m },
                    { 42, 1, 90.90m },
                    { 42, 2, 99.50m },
                    { 42, 8, 103.90m },
                    { 42, 10, 72.10m },
                    { 43, 1, 96.80m },
                    { 43, 2, 103.50m },
                    { 43, 3, 107.90m },
                    { 43, 4, 114.90m },
                    { 43, 9, 140.90m },
                    { 43, 10, 71.10m },
                    { 44, 1, 96.40m },
                    { 44, 2, 103.60m },
                    { 44, 3, 108.90m },
                    { 44, 4, 116.10m },
                    { 44, 9, 140.10m },
                    { 44, 10, 70.10m },
                    { 45, 1, 96.60m },
                    { 45, 2, 103.70m },
                    { 45, 3, 108.50m },
                    { 45, 4, 116.90m }
                });

            migrationBuilder.InsertData(
                table: "HotelsRoomTypesPrices",
                columns: new[] { "HotelId", "RoomTypeId", "PricePerNight" },
                values: new object[,]
                {
                    { 45, 9, 144.10m },
                    { 45, 10, 71.10m },
                    { 46, 1, 86.60m },
                    { 46, 2, 94.70m },
                    { 46, 5, 103.50m },
                    { 46, 9, 144.40m },
                    { 46, 10, 72.10m },
                    { 47, 1, 86.20m },
                    { 47, 2, 94.90m },
                    { 47, 5, 103.90m },
                    { 47, 9, 144.10m },
                    { 47, 10, 72.20m },
                    { 48, 1, 87.20m },
                    { 48, 2, 95.90m },
                    { 48, 5, 102.90m },
                    { 48, 9, 144.50m },
                    { 48, 10, 72.20m },
                    { 49, 1, 95.20m },
                    { 49, 2, 104.80m },
                    { 49, 5, 109.90m },
                    { 49, 7, 290.90m },
                    { 49, 10, 49.10m },
                    { 50, 1, 95.10m },
                    { 50, 2, 103.20m },
                    { 50, 5, 110.90m },
                    { 50, 7, 291.90m },
                    { 50, 10, 49.10m },
                    { 51, 1, 95.40m },
                    { 51, 2, 103.90m },
                    { 51, 5, 112.90m },
                    { 51, 7, 291.40m },
                    { 51, 10, 49.10m },
                    { 52, 1, 92.10m },
                    { 52, 2, 101.50m },
                    { 52, 5, 109.60m },
                    { 52, 6, 152.80m },
                    { 52, 8, 105.10m },
                    { 52, 10, 61.10m },
                    { 53, 1, 92.90m },
                    { 53, 2, 101.60m },
                    { 53, 5, 110.10m },
                    { 53, 6, 154.10m }
                });

            migrationBuilder.InsertData(
                table: "HotelsRoomTypesPrices",
                columns: new[] { "HotelId", "RoomTypeId", "PricePerNight" },
                values: new object[,]
                {
                    { 53, 8, 105.90m },
                    { 53, 10, 61.20m },
                    { 54, 1, 93.90m },
                    { 54, 2, 102.60m },
                    { 54, 5, 112.10m },
                    { 54, 6, 155.10m },
                    { 54, 8, 106.90m },
                    { 54, 10, 62.20m },
                    { 55, 1, 104.15m },
                    { 55, 2, 112.60m },
                    { 55, 6, 170.10m },
                    { 55, 7, 390.10m },
                    { 55, 10, 40.20m },
                    { 56, 1, 104.25m },
                    { 56, 2, 112.70m },
                    { 56, 6, 170.30m },
                    { 56, 7, 390.50m },
                    { 56, 10, 40.30m },
                    { 57, 1, 104.20m },
                    { 57, 2, 112.50m },
                    { 57, 6, 170.10m },
                    { 57, 7, 390.90m },
                    { 57, 10, 40.90m },
                    { 58, 1, 120.20m },
                    { 58, 2, 132.50m },
                    { 58, 5, 147.50m },
                    { 58, 7, 440.90m },
                    { 58, 10, 31.90m },
                    { 59, 1, 120.50m },
                    { 59, 2, 134.50m },
                    { 59, 5, 148.30m },
                    { 59, 7, 442.40m },
                    { 59, 10, 31.80m },
                    { 60, 1, 121.40m },
                    { 60, 2, 136.10m },
                    { 60, 5, 148.90m },
                    { 60, 7, 444.40m },
                    { 60, 10, 30.90m },
                    { 61, 1, 111.40m },
                    { 61, 2, 120.10m },
                    { 61, 3, 127.90m },
                    { 61, 10, 50.90m }
                });

            migrationBuilder.InsertData(
                table: "HotelsRoomTypesPrices",
                columns: new[] { "HotelId", "RoomTypeId", "PricePerNight" },
                values: new object[,]
                {
                    { 62, 1, 111.30m },
                    { 62, 2, 124.10m },
                    { 62, 3, 128.80m },
                    { 62, 10, 51.90m },
                    { 63, 1, 111.40m },
                    { 63, 2, 124.30m },
                    { 63, 3, 129.80m },
                    { 63, 10, 50.80m },
                    { 64, 1, 99.40m },
                    { 64, 2, 107.30m },
                    { 64, 4, 117.80m },
                    { 64, 8, 113.40m },
                    { 64, 10, 61.10m },
                    { 65, 1, 99.30m },
                    { 65, 2, 107.40m },
                    { 65, 4, 118.30m },
                    { 65, 8, 113.10m },
                    { 65, 10, 61.30m },
                    { 66, 1, 100.10m },
                    { 66, 2, 108.40m },
                    { 66, 4, 119.90m },
                    { 66, 8, 114.60m },
                    { 66, 10, 61.10m },
                    { 67, 1, 121.10m },
                    { 67, 2, 133.40m },
                    { 67, 5, 144.50m },
                    { 67, 6, 190.60m },
                    { 67, 7, 460.60m },
                    { 67, 10, 34.10m },
                    { 68, 1, 121.60m },
                    { 68, 2, 133.90m },
                    { 68, 5, 145.40m },
                    { 68, 6, 191.70m },
                    { 68, 7, 461.50m },
                    { 68, 10, 33.50m },
                    { 69, 1, 121.90m },
                    { 69, 2, 134.60m },
                    { 69, 5, 145.90m },
                    { 69, 6, 192.60m },
                    { 69, 7, 461.90m },
                    { 69, 10, 33.70m },
                    { 70, 1, 134.90m }
                });

            migrationBuilder.InsertData(
                table: "HotelsRoomTypesPrices",
                columns: new[] { "HotelId", "RoomTypeId", "PricePerNight" },
                values: new object[,]
                {
                    { 70, 2, 145.60m },
                    { 70, 3, 154.90m },
                    { 70, 4, 166.60m },
                    { 70, 6, 210.90m },
                    { 70, 10, 42.70m },
                    { 71, 1, 135.70m },
                    { 71, 2, 146.60m },
                    { 71, 3, 155.60m },
                    { 71, 4, 167.60m },
                    { 71, 6, 211.60m },
                    { 71, 10, 42.60m },
                    { 72, 1, 135.90m },
                    { 72, 2, 146.90m },
                    { 72, 3, 155.90m },
                    { 72, 4, 167.90m },
                    { 72, 6, 211.90m },
                    { 72, 10, 42.90m },
                    { 73, 1, 128.90m },
                    { 73, 2, 134.50m },
                    { 73, 3, 142.60m },
                    { 73, 4, 151.40m },
                    { 73, 10, 39.90m },
                    { 74, 1, 129.30m },
                    { 74, 2, 135.40m },
                    { 74, 3, 143.20m },
                    { 74, 4, 151.90m },
                    { 74, 10, 39.80m },
                    { 75, 1, 129.90m },
                    { 75, 2, 135.90m },
                    { 75, 3, 143.80m },
                    { 75, 4, 152.60m },
                    { 75, 10, 40.20m },
                    { 76, 1, 111.70m },
                    { 76, 2, 122.10m },
                    { 76, 3, 131.20m },
                    { 76, 4, 142.60m },
                    { 76, 10, 44.20m },
                    { 77, 1, 112.50m },
                    { 77, 2, 122.70m },
                    { 77, 3, 131.90m },
                    { 77, 4, 143.30m },
                    { 77, 10, 44.40m }
                });

            migrationBuilder.InsertData(
                table: "HotelsRoomTypesPrices",
                columns: new[] { "HotelId", "RoomTypeId", "PricePerNight" },
                values: new object[,]
                {
                    { 78, 1, 113.30m },
                    { 78, 2, 123.40m },
                    { 78, 3, 131.50m },
                    { 78, 4, 145.10m },
                    { 78, 10, 44.50m },
                    { 79, 1, 120.10m },
                    { 79, 2, 131.40m },
                    { 79, 3, 142.50m },
                    { 79, 4, 151.10m },
                    { 79, 6, 211.70m },
                    { 79, 10, 34.50m },
                    { 80, 1, 120.80m },
                    { 80, 2, 131.90m },
                    { 80, 3, 143.30m },
                    { 80, 4, 151.70m },
                    { 80, 6, 212.60m },
                    { 80, 10, 34.60m },
                    { 81, 1, 121.60m },
                    { 81, 2, 132.60m },
                    { 81, 3, 143.70m },
                    { 81, 4, 152.50m },
                    { 81, 6, 213.10m },
                    { 81, 10, 34.70m },
                    { 82, 1, 101.50m },
                    { 82, 2, 109.60m },
                    { 82, 3, 118.70m },
                    { 82, 4, 124.40m },
                    { 82, 10, 32.70m },
                    { 83, 1, 101.80m },
                    { 83, 2, 109.50m },
                    { 83, 3, 117.60m },
                    { 83, 4, 124.70m },
                    { 83, 10, 32.80m },
                    { 84, 1, 102.20m },
                    { 84, 2, 109.80m },
                    { 84, 3, 118.10m },
                    { 84, 4, 125.40m },
                    { 84, 10, 32.90m },
                    { 85, 1, 141.10m },
                    { 85, 2, 152.80m },
                    { 85, 5, 161.10m },
                    { 85, 8, 158.40m }
                });

            migrationBuilder.InsertData(
                table: "HotelsRoomTypesPrices",
                columns: new[] { "HotelId", "RoomTypeId", "PricePerNight" },
                values: new object[,]
                {
                    { 85, 9, 220.70m },
                    { 85, 10, 50.90m },
                    { 86, 1, 142.40m },
                    { 86, 2, 153.50m },
                    { 86, 5, 161.70m },
                    { 86, 8, 158.10m },
                    { 86, 9, 221.50m },
                    { 86, 10, 50.60m },
                    { 87, 1, 142.80m },
                    { 87, 2, 154.50m },
                    { 87, 5, 162.70m },
                    { 87, 8, 159.10m },
                    { 87, 9, 222.50m },
                    { 87, 10, 51.60m },
                    { 88, 1, 99.80m },
                    { 88, 2, 107.50m },
                    { 88, 3, 114.70m },
                    { 88, 4, 121.10m },
                    { 88, 10, 21.60m },
                    { 89, 1, 99.50m },
                    { 89, 2, 107.10m },
                    { 89, 3, 114.30m },
                    { 89, 4, 120.60m },
                    { 89, 10, 21.50m },
                    { 90, 1, 99.10m },
                    { 90, 2, 106.50m },
                    { 90, 3, 113.80m },
                    { 90, 4, 120.10m },
                    { 90, 10, 21.10m },
                    { 91, 1, 99.60m },
                    { 91, 2, 106.90m },
                    { 91, 3, 114.30m },
                    { 91, 4, 120.40m },
                    { 91, 10, 21.20m },
                    { 92, 1, 99.40m },
                    { 92, 2, 106.70m },
                    { 92, 3, 114.20m },
                    { 92, 4, 120.20m },
                    { 92, 10, 21.00m },
                    { 93, 1, 99.90m },
                    { 93, 2, 107.80m },
                    { 93, 3, 114.90m }
                });

            migrationBuilder.InsertData(
                table: "HotelsRoomTypesPrices",
                columns: new[] { "HotelId", "RoomTypeId", "PricePerNight" },
                values: new object[,]
                {
                    { 93, 4, 120.70m },
                    { 93, 10, 21.50m },
                    { 94, 1, 102.90m },
                    { 94, 2, 113.80m },
                    { 94, 3, 120.90m },
                    { 94, 4, 128.70m },
                    { 94, 10, 23.50m },
                    { 95, 1, 102.50m },
                    { 95, 2, 113.40m },
                    { 95, 3, 120.30m },
                    { 95, 4, 128.10m },
                    { 95, 10, 23.30m },
                    { 96, 1, 102.70m },
                    { 96, 2, 113.60m },
                    { 96, 3, 120.70m },
                    { 96, 4, 128.50m },
                    { 96, 10, 23.50m },
                    { 97, 1, 91.60m },
                    { 97, 2, 99.30m },
                    { 97, 3, 106.40m },
                    { 97, 4, 113.10m },
                    { 97, 10, 24.60m },
                    { 98, 1, 91.90m },
                    { 98, 2, 99.80m },
                    { 98, 3, 106.90m },
                    { 98, 4, 113.40m },
                    { 98, 10, 24.20m },
                    { 99, 1, 92.60m },
                    { 99, 2, 100.90m },
                    { 99, 3, 107.80m },
                    { 99, 4, 113.90m },
                    { 99, 10, 23.70m },
                    { 100, 1, 87.50m },
                    { 100, 2, 95.80m },
                    { 100, 3, 104.30m },
                    { 100, 4, 111.10m },
                    { 100, 10, 23.90m },
                    { 101, 1, 87.90m },
                    { 101, 2, 96.30m },
                    { 101, 3, 104.90m },
                    { 101, 4, 111.70m },
                    { 101, 10, 23.80m }
                });

            migrationBuilder.InsertData(
                table: "HotelsRoomTypesPrices",
                columns: new[] { "HotelId", "RoomTypeId", "PricePerNight" },
                values: new object[,]
                {
                    { 102, 1, 87.80m },
                    { 102, 2, 96.20m },
                    { 102, 3, 104.80m },
                    { 102, 4, 111.60m },
                    { 102, 10, 23.70m },
                    { 103, 1, 81.10m },
                    { 103, 2, 88.90m },
                    { 103, 3, 95.60m },
                    { 103, 4, 102.30m },
                    { 103, 10, 23.90m },
                    { 104, 1, 81.60m },
                    { 104, 2, 89.40m },
                    { 104, 3, 95.90m },
                    { 104, 4, 102.90m },
                    { 104, 10, 23.10m },
                    { 105, 1, 81.40m },
                    { 105, 2, 89.40m },
                    { 105, 3, 95.70m },
                    { 105, 4, 102.40m },
                    { 105, 10, 23.30m }
                });

            migrationBuilder.InsertData(
                table: "OrganizedOffers",
                columns: new[] { "Id", "DestinationId", "Discount", "HotelId", "IsActive", "MaxPeople", "MinPeopleNeeded", "Name", "Price", "TransportTypeId" },
                values: new object[,]
                {
                    { 1, 1, null, 1, true, 50, 15, "Екскурзия в Кавала - 4 нощувки", 380m, 2 },
                    { 2, 2, 2f, 5, true, 150, 60, "Екскурзия на о-в Крит - 7 нощувки", 850m, 1 },
                    { 3, 3, 1f, 9, true, 60, 20, "Вълшебството на Йонийските острови - остров Лефкада", 480m, 2 },
                    { 4, 4, 3f, 10, true, 60, 20, "Почивка на остров Тасос - 5 нощувки", 560m, 2 },
                    { 5, 5, 5f, 14, true, 80, 30, "Рим - Вечният град", 700m, 1 },
                    { 6, 6, 2f, 16, true, 120, 50, "Сицилия от А до Я 2024 - Душата на Италия", 950m, 1 },
                    { 7, 7, 4f, 21, true, 120, 40, "Почивка в тюркоазена Сардиния", 900m, 1 },
                    { 8, 8, null, 22, true, 100, 30, "Ница - Уикенд на Френската Ривиера", 700m, 1 },
                    { 9, 9, 3f, 27, true, 80, 20, "Bonjour Paris! - Уикенд в Париж", 800m, 1 },
                    { 10, 10, 7f, 28, true, 50, 20, "Уикенд в Барселона", 950m, 1 },
                    { 11, 11, 6f, 31, true, 90, 35, "Почивка в Испания - Мурсия, Ла Манга Дел Мар Менор", 1010m, 1 },
                    { 12, 12, 9f, 35, true, 90, 35, "Почивка в Испания - Коста Бланка, Бенидорм", 1040m, 1 },
                    { 13, 13, 10f, 39, true, 90, 35, "Почивка в Испания - Коста Бланка, Бенидорм", 1020m, 1 },
                    { 14, 14, null, 40, true, 100, 40, "Почивка в Анталия, Турция", 700m, 1 },
                    { 15, 15, null, 44, true, 65, 30, "Почивка в Кушадасъ, Турция - 7 нощувки", 610m, 2 },
                    { 16, 16, 4f, 47, true, 65, 30, "Почивка в Бодрум, Турция - 7 нощувки", 720m, 2 },
                    { 17, 17, 3f, 50, true, 65, 30, "Почивка в Чешме", 520m, 2 },
                    { 18, 18, 2f, 53, true, 70, 25, "Екскурзия в Португалия - Лисабон", 900m, 1 },
                    { 19, 19, 3f, 55, true, 75, 20, "Златна Прага", 420m, 1 },
                    { 20, 20, null, 58, true, 100, 40, "Екскурзия до Боенос Айрес", 2430m, 1 },
                    { 21, 21, null, 62, true, 100, 40, "Екскурзия в Куба - Хавана и Варадеро", 3060m, 1 },
                    { 22, 22, 3f, 64, true, 100, 40, "Екскурзия в Лима", 2100m, 1 }
                });

            migrationBuilder.InsertData(
                table: "OrganizedOffers",
                columns: new[] { "Id", "DestinationId", "Discount", "HotelId", "IsActive", "MaxPeople", "MinPeopleNeeded", "Name", "Price", "TransportTypeId" },
                values: new object[,]
                {
                    { 23, 23, 2f, 68, true, 100, 40, "Екскурзия до Рио де Жанейро", 2530m, 1 },
                    { 24, 24, 3f, 70, true, 80, 35, "Екскурзия до Япония, Токио", 4100m, 1 },
                    { 25, 25, 2f, 74, true, 80, 35, "Екскурзия до Япония, Киото", 4040m, 1 },
                    { 26, 26, 7f, 77, true, 80, 35, "Екскурзия до Канди, Шри Ланка", 2220m, 1 },
                    { 27, 27, null, 81, true, 80, 35, "Екскурзия до Пекин, Китай", 3920m, 1 },
                    { 28, 28, null, 83, true, 80, 35, "Екскурзия Сингапур", 2490m, 1 },
                    { 29, 29, 6f, 86, true, 80, 19, "Екскурзия на Малдивите", 2280m, 1 },
                    { 30, 30, 2f, 89, true, 100, 25, "Екскурзия в Хургада, Египет", 970m, 1 },
                    { 31, 31, 1f, 92, true, 100, 25, "Екскурзия Сома Бей, Египет", 950m, 1 },
                    { 32, 32, 4f, 94, true, 100, 25, "Екскурзия Макада Бей, Египет", 900m, 1 },
                    { 33, 33, 2f, 99, true, 75, 30, "Екскурзия в Мароко", 1170m, 1 },
                    { 34, 34, null, 101, true, 75, 25, "Екскурзия на остров Джерба, Тунис", 880m, 1 },
                    { 35, 35, 8f, 105, true, 90, 20, "Екскурзия в Тунис, Тунис", 920m, 1 }
                });

            migrationBuilder.InsertData(
                table: "OrganizedOfferDays",
                columns: new[] { "Id", "ActivityId", "DayNumber", "Description", "OrganizedOfferId" },
                values: new object[,]
                {
                    { 1, null, 1, "Отпътуване от София в 7.30 ч. от ул. \"Оборище\" (в участъка между пл. „Александър Невски“ и бул. „Васил Левски“), в 8.00 ч. от автогара „Сердика“, в 8.30 ч. от Студена - бензиностанция \"Shell/Mc Donald's\", в 9.00 ч. от Дупница, в 9.30 ч. от Благоевград, в 10.30 ч. от Сандански по маршрут ГКПП Кулата - Кавала. Пристигане в хотел \"Airotel Galaxy\" 4* ранния следобяд. Настаняване. Свободно време. Вечеря. Нощувка", 1 },
                    { 2, 1, 2, "Закуска. Свободно време или пешеходна разходка в Кавала: пристанището; акведуктът, построен по заповед на Сюлейман Великолепни през 1550 г.; църквата „Св. Богородица“, родната къща на Али Паша, който провежда значими реформи в Османската империя през 19 в.; турската крепост от 16 в., станала символ на града. Свободно време за самостоятелна разходка в града. Връщане в хотела на обяд. Свободно време. Вечеря. Нощувка", 1 },
                    { 3, 2, 3, "Закуска. Свободно време за плаж или целодневна туристическа програма по желание: панорамна обиколка на остров Тасос с посещение на традиционна фабрика за производство на зехтин, манастира \"Св. Архангели\" и на златарското ателие \"Iris Gold\". Пешеходна разходка и свободно време в столицата Лименас. Отпътуване за хотела късния следобяд. Вечеря. Нощувка", 1 },
                    { 4, null, 4, "Закуска. Свободно време. Използване на включените в пакета услуги. Вечеря. Нощувка", 1 },
                    { 5, null, 5, "Закуска. Отпътуване за България в 10:00 ч. Пристигане в София на бензиностанция „Lukoil“ (бул. „Сливница“, след кръстовище Орион), автогара „Сердика“, ул. \"Оборище\" (в участъка между пл. „Александър Невски“ и бул. „Васил Левски“) привечер", 1 },
                    { 6, null, 1, "Сборен час на Летище София - Терминал 2 с полет София – Крит с European Air Charter. Пристигане на летище Крит. Трансфер до избрания хотел.\r\n\r\nНастаняване – в периода от пристигане в хотела до настаняване, туристите могат да се възползват от всички услуги, включени в концепцията на хотела.\r\n\r\nСвободно време. Нощувка", 2 },
                    { 7, 3, 2, "Свободно време за плаж и забавления или възможност за допълнителна екскурзия", 2 },
                    { 8, 4, 3, "Свободно време за плаж и забавления или възможност за допълнителна екскурзия", 2 },
                    { 9, 5, 4, "Свободно време за плаж и забавления или възможност за допълнителна екскурзия", 2 },
                    { 10, 6, 5, "Свободно време за плаж и забавления или възможност за допълнителна екскурзия", 2 },
                    { 11, 7, 6, "Свободно време за плаж и забавления или възможност за допълнителна екскурзия", 2 },
                    { 12, 8, 7, "Свободно време за плаж и забавления или възможност за допълнителна екскурзия", 2 },
                    { 13, null, 8, "Закуска. Tрансфер за полет Крит – София с European Air Charter", 2 },
                    { 14, null, 1, "Отпътуване от София в 6.30 ч. от автогара „Сердика“, в 7.00 ч. от Студена - бензиностанция \"Shell/Mc Donald's\", в 7.30 ч. от Дупница, в 8.00 ч. от Благоевград, в 9.00 ч. от Сандански по маршрут Кулата - остров Лефкада. Пристигане вечерта. Настаняване. Вечеря. Нощувка", 3 },
                    { 15, 9, 2, "Закуска. Свободно време. По желание - отпътуване за град Нидри за целодневен круиз с кораб (продължителност 9 часа): Порто Кацики или Егремни - най-красивите плажове на острова с възможност за скачане и плуване в кристалната вода на Йонийско море; остров Кефалония със свободно време в градчето Фискардо; остров Итака с възможност за разходка или плаж на острова на Одисей; пещерите на остров Меганиси; трите острова на семейство Онасис - Скорпиос, Спарти и Скорпиди; остров Мадури, известен със своята вечнозелена растителност. Връщане в хотела привечер. *препоръчителни са аква обувки, бански, слънчеви очила и шапки*  Вечеря. Нощувка", 3 },
                    { 16, 10, 3, "Закуска. Свободно време. По желание - отпътуване за Парга за целодневен круиз с корабче: остров Антипаксос с възможност за плуване в топлите и чисти води на Йонийско море; Сините пещери, известни с причудливите си форми, образувани през годините от морските води; остров Паксос с посещение на столицата Гайос и свободно време за разходка и обяд в някоя от местните рибни таверни. Връщане в хотела привечер. *препоръчителни са бански, слънчеви очила и шапки* Вечеря. Нощувка", 3 },
                    { 17, 11, 4, "Закуска. Свободно време. По желание - обиколка на острова с посещение на: град Лефкада - Централният площад, църквата „Св. Спиридон“, построена през 1685 г. от венецианците, кметството, църквата „Св. Мина“ и катедралата; манастира \"Панагия Фанеромени\" - най-важният религиозен център на острова, построен през 1634 г. върху руините на древен храм, посветен на богинята Артемида; плажа „Катизма“ - един от най-добрите на острова. Връщане в хотела привечер. *препоръчителни са аква обувки, бански, слънчеви очила и шапки*  Вечеря. Нощувка", 3 },
                    { 18, null, 5, "Закуска. Отпътуване за България. Пристигане в София на автогара „Сердика“ вечер", 3 },
                    { 19, null, 1, "Отпътуване от София в 7.00 ч. от ул. \"Оборище\" (в участъка между пл. „Александър Невски“ и бул. „Васил Левски“), 7.30 ч. - Автогара \"Сердика\", 8.00 ч. от Студена - бензиностанция \"Shell/Mc Donald's\", Дупница - 8.30 ч., Благоевград - 9.00 ч., Сандански - 10.00 ч. по маршрут ГКПП Кулата - Керамоти. Пътуване с ферибот до един от най-красивите егейски острови - Тасос. Пристигане следобед. Настаняване късния следобед. Свободно време за плаж. Вечеря. Нощувка", 4 },
                    { 20, null, 2, "Закуска. Свободен ден за плаж. Вечеря. Нощувка", 4 },
                    { 21, 12, 3, "Закуска. Свободно време или туристическа програма по желание: панорамна обиколка на остров Тасос с посещение на златарско ателие \"Iris Gold\", традиционна фабрика за производство на зехтин и манастира \"Св. Архангели\". Пешеходна разходка в столицата Лименас. Вечеря. Нощувка", 4 },
                    { 22, null, 4, "Закуска. Свободен ден за плаж. Вечеря. Нощувка", 4 },
                    { 23, null, 5, "Закуска. Свободен ден за плаж. Вечеря. Нощувка", 4 },
                    { 24, null, 6, "Закуска. Отпътуване за Кавала. Пешеходна разходка: пристанището; акведуктът, построен по заповед на Сюлейман Великолепни през 1550 г.; църквата „Св. Богородица“, родната къща на Али паша, който провежда значими реформи в Османската империя през 19 в.; турската крепост от 16 в., станала символ на града. Свободно време. Отпътуване за България. Пристигане в София на бензиностанция \"Lukoil\" (бул. \"Сливница\", след кръстовище Орион), Автогара \"Сердика\", ул. \"Оборище\" (в участъка между пл. „Александър Невски“ и бул. „Васил Левски“) вечерта", 4 },
                    { 25, null, 1, "Събиране на летище София. Отпътуване за Рим с директен полет на Wizz air. Кацане на летището. Трансфер до центъра на Рим. Панорамна обиколка на Рим (включена в цената). Настаняване. Нощувка", 5 },
                    { 26, 13, 2, "Закуска. Свободно време или екскурзия по желание: Сутринта – Екскурзия до град-държава Ватикана, Следобяда – Площадите на Рим. Нощувка", 5 },
                    { 27, 14, 3, "Закуска. Свободно време или екскурзия по желание: Допълнителна екскурзия Колизеум и Римски форуми. Нощувка", 5 },
                    { 28, 15, 4, "Закуска. Свободно време или екскурзия по желание: Допълнителна екскурзия до Тиволи. Нощувка", 5 },
                    { 29, null, 5, "Закуска. Освобождаване на хотела. Трансфер до летището. Директен полет от Рим за София", 5 },
                    { 30, null, 1, "Среща на Летище София. Директен полет до Катания. Трансфер и настаняване в хотел в района на Сиракуза или Рагуза", 6 },
                    { 31, null, 2, "Закуска. Отпътуване от хотела за посещение на Сиракуза и Ното.\r\nПосещение на Сиракуза - Пешеходна разходка с местен екскурзовод в стария град на Сиракуза, остров Ортиджа, известен с богатата си древногръцка история, част от световното културно наследство на ЮНЕСКО. Сиракуза е най-известната гръцка колония в Средиземноморието.\r\nПосещение на Ното - В ранният следобед се отправяме към Ното, обявен за перфектният бароков град. Истинско бижу на барока, включено в листата на ЮНЕСКО. Настаняване в хотела. Вечеря. Нощувка в района на Сиракуза или Рагуза", 6 },
                    { 32, null, 3, "Закуска. Отпътуване от хотела за посещение на Модика и Рагуза.\r\nПосещение на Модика - Модика е включен в списъка на световното културно наследство на ЮНЕСКО. Градът е основан от сикулите около VII век пр. н. е. По-късно е бил окупиран от римляните.\r\nПосещение на Рагуза - Градът е разделен на две части. В едната част няма забележителности, тя се е появила след земетресението през 1693 г. Другата част, наречена Рагуза Ибла, се разполага на хълма и е възстановена в средновековния си вид от местните жители след земетресението. Настаняване в хотела в района на Агридженто. Вечеря. Нощувка", 6 },
                    { 33, null, 4, "Закуска. Отпътуване за екскурия до Агридженто.\r\nПосещение на Агридженто – Ще разгледате една от основните забележителности на Сицилия, която включва останките на седем древногръцки храма от V век пр.н.е., посветени на боговете Хера, Зевс Олимпийски, Херкулес, храма Конкордия. Долината на Храмовете е включена в списъка със световното културно наследство на ЮНЕСКО.\r\nПосещение на Мазара Дел Вало - Мазара дел Вало e земеделски и риболовен център, разположен в провинция Трапани, Югозападна Сицилия. Като основан още по времето на финикийците град, той има древна и богата история, която личи в останалите запазени в него много древни руини и красиви сгради от Средновековието. Настаняване в хотела в района на Палермо/ Чефалу. Вечеря. Нощувка", 6 },
                    { 34, null, 5, "Закуска. Свободно време или допълнителна екскурзия до Палермо и Монреале.\r\nПосещение на Палермо – Разходка из столицата на Сицилия. Сърцето на Палермо е белязано от бароковото кръстовище „Куатро Канти”, непосредсвено до него се намира „Пиаца Претория” с „Фонтана на срама”, зад сградата на Общината е разположена църквата „Марторана”, където афрески, византийска мозайка и барок се сливат в хармоничен шедъовър.\r\nПосещение на Монреале - Посещение на Катедралата на града – изключителен шедьовър на норманската архитектура от 12 в. с впечатляващи мозайки във византийски стил, които разказват стария и новия завет. Вечеря. Нощувка в района на Палермо/ Чефалу", 6 },
                    { 35, null, 6, "Закуска. Отпътуване за Чефалу и Месина.\r\nПосещение на Чефалу – Градът е построен под огромна канара, наподобяваща крепост, в подножието, на която се е сгушил един от най-елегантните главни площади в Сицилия – Дуомо и величествената норманска катедрала от 12 в.\r\nПосещение на Месина - Разходка из Месина - третият по големина град в Сицилия и столица на провинцията Месина. Религиозните здания в Месина са няколко – катедралата на Месина от 12-ти век разрушавана и построявана два пъти - след земетресение (1908г.) и бомбардировки (1943г.), Annunziata dei Catalani – със засилен арабски архитектурен стил, Santa Maria degli Alemanni – било е параклис на тевтонските рицари. Настаняване в хотела в района на Етна или Катания. Вечеря. Нощувка", 6 },
                    { 36, null, 7, "Закуска. Свободно време или допълнителна екскурзия до Етна и Таормина.\r\nПосещение на Етна - Етна е най-високият действащ вулкан в Европа. Изкачване с автобус до 1910 м. Свободно време с възможност за разходка на страничните кратери „Силвестри”, които са били активни 1986 г., да си купите сувенири от лава в някое от многобройните магазинчета, да опитате мед от Дзаферана или ракията „Огъня на Етна”.\r\nПосещение на Таормина – Автобусът ни оставя на паркинг в подножието на града, откъдето се придвижваме до централната улица с безплатно бусче. Свободно време за разходка по живописните улички на града. Връщане в хотела в района на Етна или Катания. Вечеря. Нощувка", 6 },
                    { 37, null, 8, "Закуска. Трансфер до летище Катания. Прибиране в България с директен полет Катания - София", 6 },
                    { 38, null, 1, "Директен полет София – Олбия/Сардиния. Трансфер до хотела. Информационна среща. Вечеря. Нощувка", 7 },
                    { 39, 16, 2, "Закуска. Информационна среща. Свободно време за плаж или възможност за допълнителна екскурзия по желание - Каляри и Баруминими", 7 },
                    { 40, 17, 3, "Закуска. Свободно време за плаж или възможност за допълнителна екскурзия по желание - Коста Смералда", 7 },
                    { 41, 18, 4, "Закуска. Свободно време за плаж или възможност за допълнителна екскурзия по желание - Сасари и Кастелсардо", 7 },
                    { 42, 19, 5, "Закуска. Свободно време за плаж или възможност за допълнителна екскурзия по желание - Архипелага Магдалена (Ла Мадалена)", 7 }
                });

            migrationBuilder.InsertData(
                table: "OrganizedOfferDays",
                columns: new[] { "Id", "ActivityId", "DayNumber", "Description", "OrganizedOfferId" },
                values: new object[,]
                {
                    { 43, 20, 6, "Закуска. Свободно време за плаж или възможност за допълнителна екскурзия по желание - Корсика", 7 },
                    { 44, 21, 7, "Закуска. Свободно време за плаж или възможност за допълнителна екскурзия по желание - Панорамна обиколка на Алгеро", 7 },
                    { 45, null, 8, "Закуска. Трансфер до летище Олбия. Директен полет Олбия - София с авиокомпания European Air Charter", 7 },
                    { 46, null, 1, "Среща на летище София, за директен полет с авиокомпания Wizz air до Ница. Трансфер до Ница и пешеходен тур на Ница, включен в цената. Настаняване. Информационна среща с вашият представител. Нощувка", 8 },
                    { 47, 22, 2, "Закуска. Свободно време или възможност за допълнителна екскурзия по желание - Целодневна екскурзия до Сен Пол дьо Ванс, Кан и Сен Тропе. Прибиране в хотела. Нощувка", 8 },
                    { 48, 23, 3, "Закуска. Свободно време или възможност за допълнителна екскурзия по желание - Целодневна екскурзия до: Ментон, Монако и Монте Карло. Прибиране в хотела. Нощувка", 8 },
                    { 49, null, 4, "Закуска. Свободно време. Освобождаване на хотела. Трансфер до летището за полет Ница – София", 8 },
                    { 50, null, 1, "Полет от Терминал 2 на летище София в 07:10 ч. Кацане на летище „Шарл дьо Гол” в 09:10 ч. Трансфер до хотела. Свободно време. Нощувка", 9 },
                    { 51, 24, 2, "Закуска. Свободно време или възможност за допълнителна екскурзия Bonjour Paris – пешеходна обиколка с  екскурзовод на български език: посещение на   Латинския квартал - остров  Ла Сите, Нотр Дам, Съдебната палата, Сорбоната, Пантеона, Люксембургската градина с Двореца, крепостта Консиержери, разходка с панорамно корабче по Сена, посещение на Айфеловата кула, Марсово поле", 9 },
                    { 52, 25, 3, "Закуска. Свободно време и възможност за допълнителна екскурзия – Пешеходна обиколка с посещение на операта „Гарние”, площад „Вандом” с  колона на Наполеон, ул. „Риволи”, Лувъра, градините на двореца „Тюйлери”, площад „Конкорд”, Парламента, Домa на инвалидите с гроба на Наполеон, мостa „Александър III”,  Триумфалната арка, Шан-з-Елизе. Нощувка", 9 },
                    { 53, null, 4, "Закуска. Освобождаване на хотела. Трансфер до летище „Шарл дьо Гол” за полет в 10:15 ч. и кацане на летище София в 14:00 ч.", 9 },
                    { 54, null, 1, "Среща на летище София 2 часа преди полета. Директен полет до Барселона. Трансфер до хотела. Настаняване. Свободно време. Нощувка в хотел Catalonia Park Putxet 4*", 10 },
                    { 55, null, 2, "Закуска. Панорамна обиколка на Барселона(включена в цената). Връщане в хотела. Свободно време или по желание и срещу допълнително заплащане Фламенко вечер с включена напитка. Нощувка", 10 },
                    { 56, 26, 3, "Закуска. Свободно време или по желание и срещу допълнително заплащане целодневна екскурзия Шедьоврите на Гауди – световно наследство под закрилата на ЮНЕСКО", 10 },
                    { 57, 27, 4, "Закуска. Освобождаване на хотела. Свободно време или по желание и срещу допълнително заплащане екскурзия до Абатство Монсерат с Черната Мадона. Трансер до летище. Директен полет до София. Кацане на летище София", 10 },
                    { 58, null, 1, "Отпътуване от летище София в 21,10 ч. с директен полет за Аликанте. Кацане на летището в Аликанте. Трансфер до Ла Манга дел Мар Менор (около 1.30 ч.). Настаняване. Вечеря (Студена вечеря/сух пакет). Нощувка", 11 },
                    { 59, null, 2, "Закуска. Информационна среща. Обяд. Свободно време за плаж или самостоятелно разглеждане. Вечеря. Нощувка", 11 },
                    { 60, 28, 3, "Закуска. Свободно време или по желание полудневна екскурзия до Картахена – потопете се в историята на древния град Картахена, вървейки по неговите улици, по които в миналото са преминали цивилизациите на Картахенците, Римляните и Византийците и са оставили своя отпечатък  в историята на това място. Отпътуване сутринта за Картахена. Разглеждане на пристанището, паметника на героите от Кавие, площада на общината и реновирания наскоро дворец. Спускане надолу по главната улица за разглеждане на \"Гранд Хотел\" и други впечатляващи сгради като \"Ла каса Сервантес\" и сградата на казиното. По пътя за Римския театър се минава покрай църквата \"Санта Мария ла Виеха\". Римският театър датира от първи век пр. Хр. До него могат да се видят останките от стара катедрала, бомбардирана по време на Гражданската война. Накрая разглеждане на Църквата на благотворителността с патронния светец на града. По желание има възможност за изкачване с панорамен лифт над града (цена около 1 евро), за да се видят прекрасните пейзажи, които се откриват. Връщане в хотела. Обяд. Свободно време. Вечеря. Нощувка", 11 },
                    { 61, 29, 4, "Закуска. Свободно време или по желание полудневна екскурзия до Мурсия – столицата на едноименната автономна област. Посещение на най-голямата забележителност – катедралата в Мурсия, построена върху основите на древна джамия, където могат да се видят различни художествени стилове – от готика до неокласицизъм. Разглеждане на църквата \"Сан Хуан де Диос\", разположена на площад в стария град. Екскурзията завършва с посещение на Музея на Салсийо, където могат да се видят най-големите и впечатляващи колекции от работата на великия бароков скулптор от Мурсия. Връщане в хотела. Вечеря. Нощувка", 11 },
                    { 62, 30, 5, "Закуска. Свободно време или по желание полудневна екскурзия до Лорка – градът на слънцето, на стоте щита или на стоте имена. Както и да го наречем, той определено се откроява с множеството архитектурни паметници – комбинация от средновековен, ренесансов и бароков стил. От палеолита до днес град Лорка е бил дом на различни култури, всяка от които е оставила своя отпечатък в историята на града. Разходката ще ни отведе през емблематичния площад \"Испания\" с катедралата \"Свети Патрик\" от 18-ти век, съдебната палата и кметството. Продължаваме към Археологическия музей, житницата от 16-ти век, църква \"Свети Франциск\" и бароковия дворец \"Гевара\" (разглеждане отвън). Най-впечатляващ обаче е средновековният замък на Лорка (Крепостта на слънцето), който се издига на хълма над града. Екскурзията до Лорка е като машина на времето, която ни връща назад в историческото минало чрез средновековните улички, архитектурните шедьоври и градската атмосфера. Връщане в хотела. Вечеря. Нощувка", 11 },
                    { 63, 31, 6, "Закуска. Свободно време или екскзурзия по желание. Обяд. Свободно време. Вечеря. Нощувка", 11 },
                    { 64, 32, 7, "Закуска. Свободно време или по желание целодневна екскурзия до Валенсия. Туристическа програма във Валенсия – третият по големина испански град, съхранил хармонията на средиземноморските и испано-арабските традиции. Панорамна обиколка: архитектурно-културният комплекс \"Град на изкуствата и науките\", дело на архитекта Сантяго Калатрава и включващ впечатляващите Л’Емисферик, Музей на науките, Опера, Л’Осеанографик (най-големият аквариум в Европа); пешеходна разходка в историческият център: Арената - една от най-големите в Испания, централният площад с Кметството и Историческият музей на града, Копринената борса - шедьовър на валенсианския готически стил, включен в списъка на ЮНЕСКО за Световно културно наследство, Катедралата, строена между 1252 г. и 1482 г. върху основите на по-стара джамия; Торес де Серанoс - една от запазените средновековни порти и сградата на валенсианското правителство. Свободно време. Връщане в хотела. Вечеря. Нощувка", 11 },
                    { 65, null, 8, "Закуска. Освобождаване на стаите.  Отпътуване за Аликанте. Панорамна обиколка на Аликанте (включена в цената). Любителите на забележителна архитектура, богата история и културно наследство, отлични плажове, шопинг центрове и множество забавления, със сигурност ще останат очаровани от посещението на Аликанте: крепостта \"Санта Барбара\", построена на 166 м височина на хълма Бенакантил; преминаване по крайбрежната улица \"Еспланада\" с нейната знаменита алея от палми – символ на морската душа на града; катедралата със син купол \"Сан Николас\"; кметството на Аликанте, отличаващо се с орнаментирани елементи и интересни фасади на двете му кули.  Трансфер до летището в Аликанте и отпътуване за България в 16,30 ч.. Пристигане на летище София", 11 },
                    { 66, null, 1, "Отпътуване от летище София с директен полет на авиокомпания „Wizz Air“. Кацане на летището в Аликанте. Панорамна обиколка на Аликанте (включена в цената). Любителите на забележителна архитектура, богата история и културно наследство, отлични плажове, шопинг центрове и множество забавления, със сигурност ще останат очаровани от посещението на Аликанте: крепостта „Санта Барбара“, построена на 166 м височина на хълма Бенакантил; преминаване по крайбрежната улица „Еспланада“ с нейната знаменита алея от палми – символ на морската душа на града; катедралата със син купол „Сан Николас“; кметството на Аликанте, отличаващо се с орнаментирани елементи и интересни фасади на двете му кули. Tрансфер до Бенидорм. Настаняване. Вечеря. Нощувка", 12 },
                    { 67, null, 2, "Закуска. Информационна среща. Обяд. Свободно време. Вечеря. Нощувка", 12 },
                    { 68, 33, 3, "Закуска. Свободно време или по желание целодневна екскурзия до Валенсия - третият по големина град в Испания, разположен при вливането на река Турия в Средиземно море. Градът очарова посетителите си с малки, тесни улички, внушителни сгради и паркове с портокалови и лимонови дръвчета. Пешеходна  разходка: парламентът, църквата \"Санта Каталина\", катедралата на Валенсия, Музеят на фаите. Свободно време в историческия квартал Кармен с типични тесни улички с много магазини, ресторанти и кафенета. Връщане в хотела. Вечеря. Нощувка", 12 },
                    { 69, 34, 4, "Закуска. Свободно време или по желание полудневна екскурзия до Елче. Програмата включва - транспорт с автобус, екскурзоводско обслужване на български език, панорамен тур на Стария град, базиликата Санта Мария, Кулата Калхора, двореца Алтимира, Арабските бани. Елче е разположен на двата бряга на река Виналопо и е едно от най-старите населени места на Иберийския полуостров. Елче е обявен за най-добър европейски град за отглеждане на палми. Тук има ботаническа градина с всички видове палми, които растат на Земята, както и цитрусови дървета, кактуси и бамбук. Друга голяма забележителност на града е \"Мистерията на Елче\" - традиционен средновековен празник, включен в Списъка на ЮНЕСКО като културен шедьовър. Вечеря. Нощувка", 12 },
                    { 70, 35, 5, "Закуска. Свободно време или по желание полудневна екскурзия до Гуадалест - планинско селце, основано от маврите, разположено на 600 м. надморска височина, сгушено на самотно, но много красиво място. Красиви замъци се издигат между гранитни скали, сливащи се в едно със заобикалящата ги природа. Преди да пристигнете в долината на Гуадалест, пътувайки по планински криволичещи пътища, ще минете през няколко други очарователни малки селца. Едно от тях е Ла Нуция, с великолепна гледка към Средиземно море, така и към заобикалящите го планини. Фотопауза в красивото малко селце Полоп и посещение на магазин за типични местни продукти като мед, плодове, вина. Вечеря. Нощувка", 12 },
                    { 71, 36, 6, "Закуска. Свободно време. Обяд. Свободно време или по желание вечерно фламенко шоу. Вечеря. Нощувка", 12 },
                    { 72, null, 7, "Закуска. Свободно време. Обяд. Вечеря. Нощувка", 12 },
                    { 73, null, 8, "Закуска. Освобождаване на стаите. Трансфер до летището в Аликанте и полет за България на авиокомпания „Wizz Air“. Пристигане на летище София", 12 },
                    { 74, null, 1, "Отпътуване от летище София с директен полет на авиокомпания „Wizz Air“. Кацане на летището в Аликанте. Панорамна обиколка на Аликанте (включена в цената). Любителите на забележителна архитектура, богата история и културно наследство, отлични плажове, шопинг центрове и множество забавления, със сигурност ще останат очаровани от посещението на Аликанте: крепостта „Санта Барбара“, построена на 166 м височина на хълма Бенакантил; преминаване по крайбрежната улица „Еспланада“ с нейната знаменита алея от палми – символ на морската душа на града; катедралата със син купол „Сан Николас“; кметството на Аликанте, отличаващо се с орнаментирани елементи и интересни фасади на двете му кули. Tрансфер до Бенидорм. Настаняване. Вечеря. Нощувка", 13 },
                    { 75, null, 2, "Закуска. Информационна среща. Обяд. Свободно време. Вечеря. Нощувка", 13 },
                    { 76, 37, 3, "Закуска. Свободно време или по желание целодневна екскурзия до Валенсия - третият по големина град в Испания, разположен при вливането на река Турия в Средиземно море. Градът очарова посетителите си с малки, тесни улички, внушителни сгради и паркове с портокалови и лимонови дръвчета. Пешеходна  разходка: парламентът, църквата \"Санта Каталина\", катедралата на Валенсия, Музеят на фаите. Свободно време в историческия квартал Кармен с типични тесни улички с много магазини, ресторанти и кафенета. Връщане в хотела. Вечеря. Нощувка", 13 },
                    { 77, 38, 4, "Закуска. Свободно време или по желание полудневна екскурзия до Елче. Програмата включва - транспорт с автобус, екскурзоводско обслужване на български език, панорамен тур на Стария град, базиликата Санта Мария, Кулата Калхора, двореца Алтимира, Арабските бани. Елче е разположен на двата бряга на река Виналопо и е едно от най-старите населени места на Иберийския полуостров. Елче е обявен за най-добър европейски град за отглеждане на палми. Тук има ботаническа градина с всички видове палми, които растат на Земята, както и цитрусови дървета, кактуси и бамбук. Друга голяма забележителност на града е \"Мистерията на Елче\" - традиционен средновековен празник, включен в Списъка на ЮНЕСКО като културен шедьовър. Вечеря. Нощувка", 13 },
                    { 78, 39, 5, "Закуска. Свободно време или по желание полудневна екскурзия до Гуадалест - планинско селце, основано от маврите, разположено на 600 м. надморска височина, сгушено на самотно, но много красиво място. Красиви замъци се издигат между гранитни скали, сливащи се в едно със заобикалящата ги природа. Преди да пристигнете в долината на Гуадалест, пътувайки по планински криволичещи пътища, ще минете през няколко други очарователни малки селца. Едно от тях е Ла Нуция, с великолепна гледка към Средиземно море, така и към заобикалящите го планини. Фотопауза в красивото малко селце Полоп и посещение на магазин за типични местни продукти като мед, плодове, вина. Вечеря. Нощувка", 13 },
                    { 79, 40, 6, "Закуска. Свободно време. Обяд. Свободно време или по желание вечерно фламенко шоу. Вечеря. Нощувка", 13 },
                    { 80, null, 7, "Закуска. Свободно време. Обяд. Вечеря. Нощувка", 13 },
                    { 81, null, 8, "Закуска. Освобождаване на стаите. Трансфер до летището в Аликанте и полет за България на авиокомпания „Wizz Air“. Пристигане на летище София", 13 },
                    { 82, null, 1, "Среща на Летище София - Терминал 2 за директен чартърен полет до Анталия. Кацане на летището в Анталия и посрещане от представител на фирма партньор", 14 },
                    { 83, null, 2, "Свободно време за плаж и почивка. Възможност за посещение на допълнителните екскурзии на място, предложени от фирмата партньор", 14 },
                    { 84, null, 3, "Свободно време за плаж и почивка. Възможност за посещение на допълнителните екскурзии на място, предложени от фирмата партньор", 14 }
                });

            migrationBuilder.InsertData(
                table: "OrganizedOfferDays",
                columns: new[] { "Id", "ActivityId", "DayNumber", "Description", "OrganizedOfferId" },
                values: new object[,]
                {
                    { 85, null, 4, "Свободно време за плаж и почивка. Възможност за посещение на допълнителните екскурзии на място, предложени от фирмата партньор", 14 },
                    { 86, null, 5, "Свободно време за плаж и почивка. Възможност за посещение на допълнителните екскурзии на място, предложени от фирмата партньор", 14 },
                    { 87, null, 6, "Свободно време за плаж и почивка. Възможност за посещение на допълнителните екскурзии на място, предложени от фирмата партньор", 14 },
                    { 88, null, 7, "Свободно време за плаж и почивка. Възможност за посещение на допълнителните екскурзии на място, предложени от фирмата партньор", 14 },
                    { 89, null, 8, "След закуска освобождаване на стаите и трансфер до Летище Анталия. директен чартърен полет до София. Кацане на летище София - Терминал 2", 14 },
                    { 90, null, 1, "Отпътуване от София по маршрут ГКПП \"Капитан Андреево\" - Кушадасъ. Нощен преход", 15 },
                    { 91, null, 2, "Пристигане на сутринта в съответния хотел. Настаняване след 14:00 ч. Свободно време. Нощувка", 15 },
                    { 92, null, 3, "Свободен ден и/или по желание включване в допълнителни екскурзии, които се заявяват. заплащат и организират на място от местния контрагент", 15 },
                    { 93, null, 4, "Свободен ден и/или по желание включване в допълнителни екскурзии, които се заявяват. заплащат и организират на място от местния контрагент", 15 },
                    { 94, null, 5, "Свободен ден и/или по желание включване в допълнителни екскурзии, които се заявяват. заплащат и организират на място от местния контрагент", 15 },
                    { 95, null, 6, "Свободен ден и/или по желание включване в допълнителни екскурзии, които се заявяват. заплащат и организират на място от местния контрагент", 15 },
                    { 96, null, 7, "Свободен ден и/или по желание включване в допълнителни екскурзии, които се заявяват. заплащат и организират на място от местния контрагент", 15 },
                    { 97, null, 8, "Свободен ден и/или по желание включване в допълнителни екскурзии, които се заявяват. заплащат и организират на място от местния контрагент", 15 },
                    { 98, null, 9, "Освобождаване на хотела. Отпътуване за България. Нощен преход. Пристигане в България на следващия ден", 15 },
                    { 99, null, 1, "Отпътуване от София, Пазарджик, Пловдив или Димитровград по маршрут ГКПП \"Капитан Андреево\" - Бодрум. Нощен преход", 16 },
                    { 100, null, 2, "Пристигане на сутринта в съответния хотел. Настаняване след 14:00 ч. Свободно време", 16 },
                    { 101, null, 3, "Свободен ден и/или по желание включване в допълнителни екскурзии, които се заявяват. заплащат и организират на място от местния контрагент", 16 },
                    { 102, null, 4, "Свободен ден и/или по желание включване в допълнителни екскурзии, които се заявяват. заплащат и организират на място от местния контрагент", 16 },
                    { 103, null, 5, "Свободен ден и/или по желание включване в допълнителни екскурзии, които се заявяват. заплащат и организират на място от местния контрагент", 16 },
                    { 104, null, 6, "Свободен ден и/или по желание включване в допълнителни екскурзии, които се заявяват. заплащат и организират на място от местния контрагент", 16 },
                    { 105, null, 7, "Свободен ден и/или по желание включване в допълнителни екскурзии, които се заявяват. заплащат и организират на място от местния контрагент", 16 },
                    { 106, null, 8, "Свободен ден и/или по желание включване в допълнителни екскурзии, които се заявяват. заплащат и организират на място от местния контрагент", 16 },
                    { 107, null, 9, "Освобождаване на хотела. Отпътуване за България. Нощен преход. Пристигане в България на следващия ден", 16 },
                    { 108, null, 1, "Отпътуване от София в 05:30 ч. Преминаване на Дарданелите по новият мост „Чанаккале 1915“ с основен отвор от 2023 м. Мостът надминава моста Акаши Кайкьо в Япония с 32 м. и става най-дългият висящ мост в света. Пристигане в Чешме вечерта. Настаняване в хотел Babylon 4*. Вечеря. Нощувка", 17 },
                    { 109, null, 2, "Свободно време за плаж, почивка и разходки. Нощувка", 17 },
                    { 110, 41, 3, "Закуска. Свободно време или по желание и срещу допълнително заплащане - Целодневна екскурзия до остров Хиос. След закуска ще преминем с ферибот (40 мин) до остров Хиос (Гърция) - пети по големина от гръцките острови. Добре дошли в Хиос - скрито съкровище в Егейско море, чакащо своите откриватели. Ароматен и гостоприемен през цялата година, Хиос е своеобразна палитра от картини и преживявания. Ще започнем с Пирги - най-голямото и красиво селище след столицата Хиос (Хора). Това изумително кътче може да послужи за вдъхновение на художник или като декор за нетрадиционен филм. Къщите са украсени от горе до долу с рисувани елементи на животни, цветя и геометрични фигури. Ефекта е едновременно деликатен и зашеметяващ. Ще се отправим към манастира „Неа Мони“ – най-важният паметник на острова, включен в списъка на ЮНЕСКО за световното културно наследство. Построен през 11-ти век от византийския император Константин IX Мономах, той е един от най-красивите и стари манастири в Гърция. Разположен на хълм, сгушен сред кипарисови и маслинови дървета, той е пример за прекрасната византийската архитектура и тук се намират световноизвестните зашеметяващи мозайки. Ще продължим към столицата на острова. Ще разгледаме византийската крепост, стария квартал, площад Фруриу, църквата „Агиос Георгиос“ и търговския квартал. Връщане в Чешме. Вечеря. Нощувка", 17 },
                    { 111, null, 4, "Свободно време за плаж, почивка и релакс в СПА центъра на хотела", 17 },
                    { 112, 42, 5, "Закуска. Свободно време или по желание и срещу допълнително заплащане – Екскурзия до Измир. Днес ще посетим забележителния съвременен град Измир или древна Смирна. Измир е третият по големина град в Турция и един от най-големите търговски центрове в страната, благодарение на ключовото географско разположение на брега на Егейско море. Градът е едно от най-старите селища в Средиземноморския басейн и съществува повече от 3500 години. Древна Смирна е била една от най-развитите култури, сравнима дори с Троя. Апогея в своето развитие градът бележи между 650 г. до 545 г. пр. Хр. По време на нашата обиколка с местен екскурзовод ще разгледате Агората на хълма Кадифекале, Етнографския музей, Асансьорът на Измир – построен от местен жител през 1907 г. и някога задвижван със силата на водата. Днес той е електрифициран и предоставя на посетителите прекрасна панорамна гледка и възможност за романтичен обяд или вечеря в ресторанта на върха. Ще посетите и площад „Конак“, на който величествено се извисява Часовниковата кула \"Сахат Кулеси\". Тя е красива мраморна кула, висока 25 метра и пищно украсена и декорирана. Построена е от френски архитект Пере и е и в завършена за 25-годишнината от качването на престола на Абдулхамид II през 1901 г. Свободно време на колоритният пазар Кемералтъ. Връщане в хотела. Вечеря. Нощувка", 17 },
                    { 113, null, 6, "Свободно време за плаж и почивка", 17 },
                    { 114, 43, 7, "Закуска. Свободно време или по желание и срещу допълнително заплащане -  Полудневна екскурзия до Алачатъ. Райското градче Алачатъ е разположено само на 9.5 км от Чешме. Това място кара сетивата на всеки посетител да ликуват, а сърцето му да бие учестено. Алачатъ е турски град с гръцка история, който днес размива границите между двете. Това любимо както на чуждестранните туристи, така и на местните жители, място, предлага на своите посетители слънчеви дни на зашеметяващите плажове, оживени нощи в баровете и ресторантите и мързеливи разходки по очарователни, сенчести калдъръмени улици. Докато се разхождате из града, наистина се чувствате като в Гърция. Старите каменни къщи са красиво реставрирани, а боядисаните в блестящи, ярки цветове врати и прозоречни капаци са увенчани елегантно от разцъфнали бугенвилии. Не пропускайте да се разходите и до вятърните мелници от XIX век, които бдят над града. Връщане в хотела за обяд. Свободно време. Вечеря. Нощувка", 17 },
                    { 115, null, 8, "Закуска. След закуска освобождаване на стаите. Отпътуване за България. Пристигане в Хасково, Пловдив, Пазарджик и София около полунощ", 17 },
                    { 116, null, 1, "Отпътуване от летище София с полет на авиокомпания \"Wizz Air\" по маршрут София – Лисабон. Пристигане на летището в Лисабон. Трансфер до хотела. Настаняване. Нощувка", 18 },
                    { 117, 44, 2, "Закуска. Панорамна обиколка на Лисабон с местен екскурзовод: площад \"Маракеш де Помбал\"; квартал Байша, реставриран след земетресението през 1755 г.: площадите \"Росио\", \"Фигейра\" и \"Комерсио\"; Статуята на мореплавателите, кулата \"Белем\" и манастирът \"Жеронимош\", считан за шедьовър на португалското мануелско изкуство, чийто основоположник е крал Мануел. Следобед свободно време за посещение на стария квартал Алфама, известен с тесните си улички, традиционните фадо ресторанти и многото барове, където изкачването става с ретро трамвай (необходимо е ползване на местен и градски транспорт). По желание фадо шоу с включени 2 напитки (около 22.00 ч. взимане от хотела, 22.30 ч. пристигане в ресторанта, около 00.30 - 01.00 ч. връщане в хотела). Нощувка", 18 },
                    { 118, 45, 3, "Закуска. Свободно време или по желание целодневна екскурзия до Обидуш, Назаре и Фатима – ден, през който ще посетите едни от най-известните исторически места в Португалия. Забравете настоящето и се върнете назад във времето в село Обидуш, заобиколено от крепостните стени, зад които се намират традиционни бели къщи и малки търговски улички, които водят към замъка. Отпътуване за Назаре, който в миналото е бил малко рибарско селце, а в наши дни е известен не само с риболова, но и с хубавите си плажове, прекрасната кухня и уникалните местни народни носии. Посещение на Фатима – център на католическата вяра и дестинация за поклонници от цял свят. Връщане в хотела. Нощувка", 18 },
                    { 119, 46, 4, "Закуска. Свободно време в Лисабон – необходимо е ползване на местен и градски транспорт или туристическа програма по желание: екскурзия до Синтра - приказен град на феи и добри вълшебници, лятна резиденция на португалското кралско семейство от 12 в., включена в списъка на ЮНЕСКО за световно културно наследство и нос Кабо да Рока - най-западната точка на Европейския континент, където \"свършва Земята и започва Морето\". Трансфер до летището. Отпътуване за България с полет на авиокомпания \"Wizz Air\". Пристигане на летище София", 18 },
                    { 120, null, 1, "Среща на летище Варна два часа преди полета, около 10:00ч. Oтпътуване в 12:00 ч. от летище Варна за Прага с полет на авиокомпания Bulgaria Air. Кацане в Прага около 14:00 ч. Обзорна обиколка на Прага – включена в цената на пакета. Трансфер до хотелите за настаняване. Свободно време. Нощувка", 19 },
                    { 121, 47, 2, "Закуска. Свободно време и възможност за допълнителна екскурзия: Екскурзия до Дрезден – столицата на Саксония, известна като \"Флоренция на Елба”. Пешеходна разходка - комплекса Цвингер, Оперния площад, Кралската катедрала, катедралата Фрауенкирхе. Свободно време и възможност за посещение на музеи - бароковия дворец \"Цвингер”, прочут с Музея на порцелана, Оръжейния музей и една от най-богатите картинни галерии в света, известна с шедьовъра на Рафаело – \"Сикстинската Мадона”. * Входните такси на музеите не са включени в цената на тура. Свободно време. Връщане в Прага. Нощувка", 19 },
                    { 122, 48, 3, "Закуска. Свободно време и възможност за допълнителна екскурзия: Екскурзия до Карлови Вари - един от най-старите европейски балнео-курорти, известен с лечебния ефект на горещите си минерални извори, Бехеровката и стъкларските изделия. Връщане в Прага. Нощувка", 19 },
                    { 123, null, 4, "Закуска. Освобождаване на хотела. Свободно време. Трансфер до летището за полет на авиокомпания Bulgaria Air за Варна в 14:00ч. Кацане на летище Варна около 16:10ч.", 19 },
                    { 124, null, 1, "Среща в 10.55 ч. на летище София, Терминал 2. за полет София – Рим с Bulgaria Air. Пристигане в Рим , следва полет Рим - Буенос Айрес с ITA Airways", 20 },
                    { 125, null, 2, "Пристигане в Буенос Айрес сутринта.  Трансфер до хотел. Свободно време за първи впечатления от най-европейския град на Латинска Америка. Нощувка в Буенос Айрес", 20 },
                    { 126, null, 3, "Закуска и ще имате малко свободно време, тъй като от 14.00 ч.  ще започне нашата  панорамна  туристическа обиколка  на  Буенос  Айрес. Като начало започваме с  чаровния квартал „Ла Бока”, най-големият типично италиански район, където много артисти и художници предлагат своите великолепни творби, а всяка събота и неделя тук има пазар на художествени произведения и рисунки. Ще се разходим по колоритната пешеходна улица “Caminito”, родното място на тангото.  Ще се потопим в историята на страната сред забележително красивите сгради на историческия комплекс  Пласа де Майо, където е  Парламента, известен още като Розовата къща, Катедралата, Националната банка и архитектурното творение от 18 век – сградата  Кабилдо. Няма да пропуснем и останалите забележителности в града - театър Колон, който е един от най-големите театри в света, известен със своята величествена сграда и безупречна акустика. (само отвън), следва гробницата на Евита Перон в елегантния квартал Реколета, Палермо с фото-стоп на площада на Обединените нации...Вечерта ще имате свободно време и нощувка", 20 }
                });

            migrationBuilder.InsertData(
                table: "OrganizedOfferDays",
                columns: new[] { "Id", "ActivityId", "DayNumber", "Description", "OrganizedOfferId" },
                values: new object[,]
                {
                    { 127, 49, 4, "Закуска. Този ден може да бъде свободен за вас,или да изберете екскурзия до ранчо и среща с гаучоси в пампата *. Ще тръгнем в 09.00 ч. сутринта, за да прекараме един ден сред типичната среда на аржентинските гаучоси. Тук  ще имате възможност да участвате или наблюдавате обяздване на коне, да наблюдавате шоу на гаучосите с танци и да опитате от  чая мате. Очаква ви вкусен обяд с местни специалитети  и напитки. Връщане в хотела около 17.00-18.00 ч. Нощувка", 20 },
                    { 128, 50, 5, "Еднодневна екскурзия с ферибот до Монтевидео* с включена туристическа обиколка. Ранна закуска. Тръгване от хотела в 06.15 ч. В 08.00 ч. – отплаване с кораб от пристанището на Буенос Айрес. В 11.00 ч. - пристигане в Монтевидео. Следва туристическа обиколка: Площада на Независимостта, Сградата на Парламента, театър Солис, закрития пазар на Монтевидео. Обиколката продължава с посещение на аристократичния квартал Карраско, Крайбрежния булевард с хубавите плажове, откъдето имате възможност да се наслаждавате на панорамата на града. В 16.00 ч.- посещение на шопинг центъра “Пунта Каретас”. В 17.00 ч.- трансфер до пристанището. В 19.00 ч. – отпътуване за Буенос Айрес. Пристигане в Буенос Айрес около 23.00 ч. ", 20 },
                    { 129, null, 6, "Закуска. Този ден ще ви предложим още едно интересно преживяване - екскурзия с корабче по делтата на р.Парана*. Пътува се с автобус до гр.Тигре, откъдето се прави разходка с корабче. Очаква ви едно изключително приятно плаване между острови с хубави вили и къщи по ръкавите на делтата, за да добиете представа как живеят хората извън континенталната част. В 12,30ч.  ще се върнем обратно в Буенос Айрес. Имате възможност за разходка в централанта част на града с пешеходната улица „Флорида’’, където ще се насладите на танцуващи по площадите майстори на аржентинското танго, на редица красиви сгради и множество магазини. Не пропускайте да изпиете чаша кафе в Café Tortoni, открито през 1858 г., средище на културния и политически елит, днес обявено за Национален исторически паметник на Аржентина.  Не пропускайте и другото уникално място  - една от най-големите книжарници в Южна Америка, обявена през 2019 г. от Нешънъл Географик за най-красивата книжарница в света. В сградата с името Еl Ateneo Grand Splendid през 1919 година е открит театър Teatro Gran Splendid. През 2000 година, невероятната със своята архитектура сграда, е преустроена в книжарница, като е запазен изключителният интериор с ложите,  сцената,  и балконите  с оригиналната орнаментика. Представете си -  местата за публиката са превърнати в ....рафтове за книги. Уникално е ! А вечерта, хайде на една незабравима вечер с много танци – посещение на танго шоу*. Нощувка", 20 },
                    { 130, null, 7, "Закуска. Напускане на Буенос Айрес и връщане към София", 20 },
                    { 131, null, 1, "Отпътуване от Терминал 2 на летище София в 21:25 ч. за Истанбул с полет на авиокомпания „Turkish Airlines“. Кацане на летището в Истанбул в 23:45 ч.", 21 },
                    { 132, null, 2, "Отпътуване за Хавана в 02:05 ч. с полет на авиокомпания „Turkish Airlines“. Кацане на летището в Хавана в 08:55 ч. Посрещане от представител на местната агенция. Отпътуване за Варадеро (около 160 км.). Настаняване в хотела на база All Inclusive (след 14.00 ч.). Свободно време във Варадеро – най-известният курорт на Куба, превърнал се във визитна картичка на острова. Живописните му плажове с белоснежен фин пясък и лазурните води на Атлантическото крайбрежие са на челно място в класацията за най-чисти плажове в света. Плажната ивица на Варадеро се простира на цели 20 км и е защитена от най-големия коралов риф в Карибско море, а приказните морски дълбини и техните обитатели няма да оставят равнодушен нито един от любителите на подводните спортове – на разположение на посетителите са множество дайвинг центрове и огромна територия за гмуркане.  Живата музика, горещите ритми и екзотичните коктейли правят кубинските вечери незабравими. Нощувка", 21 },
                    { 133, null, 3, "Закуска. Свободно време и престой в хотела на база All Inclusive. Нощувка", 21 },
                    { 134, null, 4, "Закуска. Свободно време и престой в хотела на база All Inclusive. Нощувка", 21 },
                    { 135, null, 5, "Закуска. Свободно време и престой в хотела на база All Inclusive. Нощувка", 21 },
                    { 136, null, 6, "Закуска. Напускане на хотела. Екскурзия „По стъпките на Хемингуей и кубинските пури“ с включен обяд в традиционен кубински ресторант: посещение на работилница за пури и запознаване с изкуството на производството на известните кубински пури. По време на презентацията ще научите всичко, свързано с процеса на производството, както и тайната как се разпознава качествената пура. Ще има и демонстрация на живо как се прави истинската кубинска пура. Отпътуване по стъпките на Хемингуей: посещение на вила „Ла Финка Вихия“ – бившият дом на американския писател, превърнат в музей; посещение на Кохимар – малко рибарско селище, вдъхновило Хемингуей да напише известната си творба „Старецът и морето“ и където се намира статуята на писателя, направена от стари котви, подпори и инструменти, събрани от местните рибари; хотел „Амбос Мундос”, където той често отсядал през 1930 г.; автентичните бар-ресторанти „La Bodeguita del Medio” и „Cojimar”, където са създадени популярните днес в цял свят коктейли мохито и дайкири. Отпътуване за Хавана. Настаняване. Нощувка", 21 },
                    { 137, null, 7, "Закуска. Туристическа програма с включен обяд в традиционен кубински ресторант в Хавана: Катедралният площад, Площадът на оръжията с Двореца на генерал-капитаните, където днес се помещава Градският музей на Хавана; морската алея „Малекон“; площад „Свети Франциск от Асизи“ с едноименния манастир, построен през XVII век и седалище на францисканците до XIX в.; посещение на популярния музей „Клуб Хавана Ром“ с възможност за дегустация на известния ром; Площадът на Революцията. Свободно време във Хавана. Вечеря с двучасов концерт в клуб \"Habana Cafe\", по време на който се изпълняват едни от най-известните кубински песни (включени са две напитки по време на вечерята и трансфер). Нощувка", 21 },
                    { 138, null, 8, "Закуска. Целодневна екскурзия с включен обяд до долината Винялес в Пинар дел Рио – уникален пейзаж, осеян с гъсти гори и хълмове от гигантски карстови образувания, наречени „моготи“. Фотопауза при Лос Хасминес, откъдето се открива удивителна гледка към долината и моготите. Прекрасната долина е обградена от величествени коркови палми. Това е един от най-плодородните райони на Куба, където се отглежда, събира, суши и преработва най-висококачественият тютюн в света. Тютюневото растение достига пълната си височина между ноември и февруари. След като реколтата приключи, до октомври се засаждат други култури като маланга, юка, царевица. През 1999 г. долината Винялес е обявена за обект на световното наследство на ЮНЕСКО. Разходка с лодка през Пещерата на индианците – част от най-старата пещерна система в Куба. Разглеждане на гигантската праисторическа фреска на художника Леовихилдо Гонсалес върху 120-метрова скала – реплика на праисторически рисунки, разкриващи еволюцията на живота в планината Сиера де лос Органос. Връщане обратно в Хавана. Нощувка", 21 },
                    { 139, null, 9, "Закуска (сух пакет). Трансфер до летището. Отпътуване в 10:25 ч. за Истанбул с полет на авиокомпания „Turkish Airlines“. Междинно спиране в Каракас (около 2 часа, без слизане от самолета)", 21 },
                    { 140, null, 10, "Кацане на летището в Истанбул в 10:05 ч. Отпътуване за София в 14:45 ч. с полет на авиокомпания „Turkish Airlines“. Кацане на летище София (Терминал 2) в 15:05 ч. ", 21 },
                    { 141, null, 1, "Среща на летище София за редовен полет до Мадрид. Кратък престой и полет до Лима, столицата на Перу.\r\nКацане на летище Хорхе Чавес в 18:15 местно време.\r\nПосрещане и трансфер до избрания хотел в Лима. Настаняване и нощувка", 22 },
                    { 142, null, 2, "Закуска. Целодневна панорамна обиколка на Лима. Връщане в хотел. Вечеря. Нощувка", 22 },
                    { 143, null, 3, "Закука. Свободно време и възможност за наслаждаванена удобствата на хотела", 22 },
                    { 144, null, 4, "Закука. Свободно време и възможност за наслаждаванена удобствата на хотела", 22 },
                    { 145, null, 5, "Закука. Свободно време и възможност за наслаждаванена удобствата на хотела", 22 },
                    { 146, null, 6, "Закуска. Напускане на хотела. Връщане в София с полет до Мадрид и прикачване", 22 },
                    { 147, null, 1, "Излитане от летище София в 06:00 ч. за Мюнхен. Кацане в Мюнхен в 07:00 ч. Продължение за Рио де Жанейро в 12:15 ч. Кацане в Рио де Жанейро в 19:05 ч. Посрещане, трансфер и нощувка", 23 },
                    { 148, null, 2, "Закуска в хотела. Целодневна екскурзия, разкриваща историята и съвремието на „Града на чудесата“. Този ден ще се докоснем до красотата и съкровищата на Рио: от цветните стенописи, въплатили духа и веселието на кариоките, през помпозния рококо интериор на старата кралска църква и тишината на португалските книгите до неофутуристичния шедьовър на Калатрава – една мечта за живот, посветен на опазването на нашата планета... Денят ни започва с изкачване до 705 м на най-известната планина в Рио де Жанейро – Корковадо с емблематичната статуя на Иисус Христос Изкупителя, която от октомври 1931 г., с разперени ръце посреща и благославя хората в многомилионния град. Изкачването с влакчето ще ни покаже смайващи гледки към красивото Атлантическо крайбрежие, гъстата тропична гора, гранитното сърце на планината и многобройните квартали наоколо. Ще имате време да си направите незабравими снимки, да влезете в параклисчето, изградено в основата на статуята, както и да си купите нещо за спомен от многобройните сувенири, изкушаващи посетителите. Включен обяд в местен ресторант. Продължаваме обиколката с разглеждане на историческата част на града с модерната Катедрала, известното Кафене Коломбо, Кралската библиотека за Португалска литература, Площад XV, Двореца Тирадентес (отвън), сградата на бившия Кралски дворец, Арката Телес, Старата Катедрала, Музеят на Бъдещето (отвън), Стенописите на Кобра и др. Връщане в хотела. Нощувка", 23 },
                    { 149, 51, 3, "Закуска. Изкачване с лифт до върха на природния феномен Захарната глава – поредното насищане на сетивата с незабравими гледки. Следобеда ще посетим цветния квартал Санта Тереза с емблематичния трамвай, който ще ни качи на Акведукта на Лапа. По улиците на Санта Тереза и малкото площадче Ларго до Гимараеш времето бавно тече… Санта Тереза е артистичното сърце на Рио и очарова посетителите със своите стръмни калдъръмени улички, весели графити, оживени ресторанти, улични барове, занаятчийски магазинчета, студия, галерии на художници и огромни колониални имения, строени през 18 и 19 в. за заможните бразилски фамилии. Кварталът е разположен върху хълм с централно местоположение, с благоприятен климат и приятен бриз, който разхлажда горещите летни дни. На върха на този хълм са две от забележителностите в Санта Тереза: Паркът на Руините с фантастична гледка на 360о и Чакара до Сеу – Музеят на Кастро Мая, потънал в зеленината на поддържаната тропична градина. За последно този ден си оставяме за разглеждане емблематичните Стълби на Селарон с многобройните цветни мозайки. Връщане в хотела. Вечерта по желание организирано посещение на един от най-ярките нощни клубове Rio Scenarium, където ще се насладите на еклектичната атмосфера, ще пиете кайпириня и ще може да потанцувате под горещите латино ритми. Нощувка", 23 },
                    { 150, 52, 4, "Закуска. Свободно време за почивка, плаж и разходки из прекрасния град. По желание – посещение на съседния град Нитерой, откъдето ще се насладите на фантастичните гледки към планинските върхове на Рио. Ще разгледаме Музея на съвременното изкуство. Футуристичната сграда е завършена през 1996 г. и често я наричат „космическо творение“ и „летяща чиния“. Едни от най-ценните и незабравими „експонати“ вътре са отраженията на Захарната глава и на Корковадо в стъклената фасада. Крепостта Санта Круз ще ни разкрие своите тайни и допълнително ще ни омагьоса с невероятните гледки към Рио. Тази крепост е от 1555 г. и е основното фортификационно съоръжение в залива, привличаща и до днес хиляди търсачи на история и допълваща знанията им за живота и отбраната в колониалната и имперската епохи. Днес Санта Круз е действащо съоръжение и се охранява от щаба на Артилерийската дивизия. Включен обяд в местен ресторант. Връщане в хотела. Свободно време за вечерна разходка по Копакабана за последен коктейл „кайпириня“ на брега на океана. Нощувка", 23 },
                    { 151, 53, 5, "Закуска. Свободно време за почивка, плаж и разходки из прекрасния град", 23 },
                    { 152, null, 6, "Закуска. Свободно време за почивка, плаж и разходки из прекрасния град", 23 },
                    { 153, null, 7, "Закуска. Напускане ха хотела. Връщане в София чрез прикачвна в Мюнхен", 23 },
                    { 154, null, 1, "Излитане от София в 21:10 ч. с Turkish airlines. Кацане в Истанбул в 22:35 ч. Кратък престой на летището", 24 },
                    { 155, null, 2, "Излитане за Токио в 02:20 ч. Кацане на летище Ханеда, Токио в 19:25 ч. Посрещане от представител на фирмата партньор на място. Трансфер до хотела. Настаняване в хотел. Нощувка", 24 },
                    { 156, null, 3, "Закуска. В 09:00 ч. вашият гид ще ви вземе от хотела. Първата ни спирка е парка Chidorigafuchi. Разходката до императорския дворец предлага невероятно красива гледка. Следва Yasukuni Shrine — шинтоистки храм, разположен в Чиода, Токио. Основан е от император Мейджи през юни 1869 г. и отбелязва в памет на загиналите в служба на Япония войни. Тук са изброени имената, произхода, рождените дати и местата на смъртта на 2 466 532 души. Ще посетим храмът Asakusa Kannon, един от най-колоритните и популярни будистки храмове в Токио, разположен в Асакуса. Легендата разказва, че през 628 г. двама братя извадили статуя на Кannon, богинята на милосърдието, от река Сумида и въпреки че върнали статуята обратно в реката, тя винаги се връщала при тях. Храмът е завършен през 645 г., което го прави най-старият в Токио. След това  ще се приберем в хотела. Свободно време. Нощувка", 24 },
                    { 157, null, 4, "Закуска. В 09:00 ч. ще се отправим на еднодневен тур в Токио. Meiji Jingu е шинтоистко светилище в Япония, разположено на 70 хектара, в средата на мегаполиса Токио. Тук ще забравите за суматоха на оживения град и ще се потопите в традиционния японски пейзаж, заобиколени от зеленина. Ще продължим към сградата на столичната община (Tokyo City Hall), разположена в район Shinjuku. Това е най-високото кметство в света. Сградата е проектирана от Kenzo Tange и е завършена през декември 1990 г. Дизайнът на сградата е трябвало да наподобява интегрална схема, като същевременно да напомня вид на готическа катедрала. Има двете панорамни площадки за наблюдение на 202 метра височина, гледката от които е прекрасна. Пред нас се открива целият мегаполис, а при ясно време и планината Фуджи. В 17:00 ч. обратно към хотела. Ще имаме свободно време в Ginza, eдин от най-добрите търговски райони в града с множество луксозни бутици. Нощувка", 24 },
                    { 158, null, 5, "Закуска. Свободно време и възможност за самостоятелно разглеждане", 24 },
                    { 159, null, 6, "Закуска. Свободно време и възможност за самостоятелно разглеждане", 24 },
                    { 160, null, 7, "Закуска. Напускане на хотела. Връщане в София чрез прикачване в Инстанбул", 24 },
                    { 161, null, 1, "Излитане от София в 21:10 ч. с Turkish airlines. Кацане в Истанбул в 22:35 ч. Кратък престой на летището", 25 },
                    { 162, null, 2, "Излитане за Киото в 02:20 ч. Кацане на летище в Киото в 19:25 ч. Посрещане от представител на фирмата партньор на място. Трансфер до хотела. Нощувка", 25 },
                    { 163, null, 3, "Закуска. Програмата ни днес ще започне с храма Кинкакуджи (Kinkakuji Temple) — дзен-будистки храм с изключително красив градински комплекс, признат за част от 17-те Исторически паметници на древно Киото и част от Световното наследство на ЮНЕСКО. Ще разгледаме и друг известен дзен будистки храм Рьоан-джи (Ryoanji Temple), след което ще продължим за традиционния обяд \"Shojin\" в храмов ресторант. Почти хилядолетие японските дзен-будисти са приготвяли шоджин или „кухня на предаността“, приготвени без месо или риба. След обяда продължаваме с един от най-известните храмове в Япония — Kiyomizu Temple, което буквално преведено означава „Храм на чистата вода“. Следва свободно време и разходка в квартала Гион — старата част на Киото, осеяна с множество ресторанти, магазини и тесни улички. В 20:00 ч. с автобус ще отидем до замъка Nijo-jo, който е бил резиденция на управляващия шогун по време на първия шогунат от периода Едо (1603-1867). 21:00 ч. е последния възможен час за влизане в замъка. Връщане в хотела пеша или с директен влак. Нощувка", 25 },
                    { 164, null, 4, "Закука. Свободно време и възможност за самостоятелна разглеждане на града", 25 },
                    { 165, null, 5, "Закука. Свободно време и възможност за самостоятелна разглеждане на града", 25 },
                    { 166, null, 6, "Закука. Свободно време и възможност за самостоятелна разглеждане на града", 25 },
                    { 167, null, 7, "Закуска. Напускане на хотела. Връщане в София чрез прикачване в Инстанбул", 25 },
                    { 168, null, 1, "Излитане от Летище София с трансферен полет на Търкиш Еърлайнс през Истанбул", 26 }
                });

            migrationBuilder.InsertData(
                table: "OrganizedOfferDays",
                columns: new[] { "Id", "ActivityId", "DayNumber", "Description", "OrganizedOfferId" },
                values: new object[,]
                {
                    { 169, null, 2, "Кацане в Шри Ланка на летището в Коломбо рано сутринта. Трансфер до хотел. Трансферът се извършва с лицензиран автобус/минибус. При пристигане - посрещане в хотела, настаняване. Свободно време. Вечеря. Нощувка", 26 },
                    { 170, null, 3, "Закуска. Панорамна обиколка около Канди. Вечеря. Нощувка", 26 },
                    { 171, null, 4, "Закуска. Свободно време за плаж и разпускане", 26 },
                    { 172, null, 5, "Закуска. Свободно време за плаж и разпускане", 26 },
                    { 173, null, 6, "Закуска. Свободно време за плаж и разпускане", 26 },
                    { 174, null, 7, "След закуска освобождаване на стаите и трансфер до летището за сутрешен трансферен полет за София през Истанбул", 26 },
                    { 175, null, 1, "Кацане в Пекин. Веднага след като Вашият екскурзовод Ви посрещне на летището ще се отправите към красивият „Jingshan Park” (включено в цената). Паркът се намира на върха на хълма „Jing Shan“, чието създаване е започнало още през 1416 г., когато на същото място са започнали да трупат пръст и почва, изкопана при оформянето и изграждането на Императорския дворец, рововете и каналите около него. От  върха на хълма се открива невероятна панорама към Забраненият град и Пекин. Трансфер до хотела и нощувка", 27 },
                    { 176, 54, 2, "Закуска. Свободно време или целодневна екскурзия до площад Тиенанмън, Забранения град и „Храма на небето“. Площад Тиенанмън е един от най-впечатляващите и големи площади в света, намиращ се в центъра на Пекин и способен да побере над един милион души. Площадът носи името на вратата „Тиенанмън“ (в буквален превод „Вратата на небесното спокойствие“), построена в северната част на площада, която го отделя от Забранения град. Тук се намира мавзолеят на видния китайски политик Мао Дзъдун. Следва посещение на Забранения град, където ще се впечатлите от залите и градините на най-голямата древна дворцова структура в света. Това е най-добре запазеният императорски дворец в Китай и място с голямо историческо значение (затворен всеки понеделник). Градът получава името си, защото дворцовият комплекс е бил недостъпен за обикновените китайци. Всеки, който е бил хванат да нахлува в Забранения град без разрешение, бива подлоган на строго наказание, включително екзекуция. Изключителността на Забранения град имала за цел да подчертае божествения и върховен статут на императора като син на небето.\r\nХрамът на Небето представлява даоистки комплекс, състоящ се от храмови сгради. Разположен е на мраморна тераса в южната част на Пекин в парка \"Тиантан\". Построен е на три етажа, над които се издигат конусовидни покриви, направени от над 50 000 тъмносини глазирани керемиди и е най-добре запазилият се архитектурен паметник от династията Мин. Тук императорите са идвали, за да се молят на боговете за милост и за добра реколта. Церемонията за почитането на небето била най-специалната дейност на императорите от династият Мин и Цин- нещо, което обикновените хора нямат право да извършат. Трансфер до хотела и нощувка", 27 },
                    { 177, 55, 3, "Закуска. Свободно време или посещение на Великата китайска стена. Juyongguan е един от трите най-известни маршрути по Великата китайска стена, заедно с Jiayuguan и Shanhaiguan. Намира се на 75 км северозападно от Пекин и минава през уникална планинска природа. Juyongguan е строен през 770-475 г. пр.н.е. и има дължина 2484 мили. Изкачването до върха е невероятно. Тази част от стената се състои от 14 високи и стръмни наблюдателни кули, които осигуряват прекрасна гледка към хълмовете. На връщане ще се отправите към парка Олимпия и Националния стадион в Пекин, наричан „Птиче гнездо“, заради футуристичния си дизайн – едно от най-внушителните съоръжения в Китай, където ще имате фото пауза. Трансфер до хотела и нощувка", 27 },
                    { 178, 56, 4, "Закуска. Свободно време или посещение на Летния дворец и Храма на Лама „Yonghe Temple“. Сградите и дворовете на Летния дворец са красиво декорирани и заредени с много история. На негова територия се намира най-добре запазената и най-голямата императорска градина, съществуваща в Китай. Ще направите разходка с лодка до Хълма на дълголетието (предлага се на място). Следва посещение на храма „Yonghe Temple“ или Храм Лама. Храмът Лама е един от най-колоритните и оживени храмове в Пекин. Известен със своите извити покриви, страхотни стенописи, великолепни декоративни арки, гоблени, огледала и тантрически статуи, смесващи се в плътни облаци тамян. Това е най-големият будистки манастир извън Тибет, който е бил построен като имение за император Йончжън от династията Цин, когато той е бил принц. Връщане в хотела, а за тези, които имат включен пакет „Вечери“ им предстои да опитат превъзходната печена патица по пекински - тръгване от хотела 19:00-19:30, вечеря около 20:00. Нощувка", 27 },
                    { 179, null, 5, "Закуска. Свободно време и възможност за самостоятелно разглеждане на града", 27 },
                    { 180, null, 6, "Закуска. Свободно време и възможност за самостоятелно разглеждане на града", 27 },
                    { 181, null, 7, "Закуска. Напускане на хотела. Връщане в София чрез прикачване.", 27 },
                    { 182, null, 1, "Полет от София за Сингапур през транзитно летище", 28 },
                    { 183, null, 2, "Пристигане в Сингапур . Трансфер до хотела и настаняване. Свободно време. Привечер – разходка в Сингапур и възможност за първи впечатления от града. По желание - вечеря за двама в кабината на местното „виенско колело”, докато се наслаждавате на гледката на нощен Сингапур(уговаря се на място). Нощувка в Сингапур", 28 },
                    { 184, null, 3, "Закуска. Туристическа обиколка на Сингапур, която започва със статуята на Мерлиона – символ на Сингапур, продължаваме с разглеждане на: Chinatown – кварталът е културен център на Сингапур и все още може да Ви даде възможност да надникнете в миналото и някогашният облик на града, защото е запазил тесните си улички, многобройни храмове, тераси и многобройните живописни пазари. Тук се посещава най-интересния китайски храм в Сингапур Thiang Hong Keng Temple. След това продължаваме с разходка в колоритния квартал “Малка Индия“ с многобройните улички, изпъстрени с богата палитра от магазини, “Колониален Сингапур”– Empress Place Building, импозантна викторианска сграда, сега музей, катедрала “Сейнт Андрю” и др. По желание - посещение на панорамната площадка на хотел “Marina Bay Sands”. След обяд – свободно време с възможност за разглеждане на една от новите забележителности на Сингапур - „The Gardens by the Bay”. По желание - посещение на „Градината на орхидеите”. Нощувка в Сингапур", 28 },
                    { 185, 57, 4, "Закуска. Свободно време. След обяд, по желание – полудневна екскурзия до остров Сентоса – „Островът на удоволствията“. Островът е най-посещаваната градска атракция, считан за прародител на Сингапурските паркове – с музеи, аквариуми, паркове, алеи за разходка и езда, невероятни плажове, ресторанти и барове. С автобус имате възможност да разгледате острова и да спирате при всяка атракция: статуята на Мерлиона, който е полу-риба/полу-лъв и е символът на Сингапур, Аквариума, Делфинариума, където имате възможност да видите шоуто на делфините и др. Свободно време с възможност за плаж. Вечерта – посещение на шоуто ”Светлина и звук“, където танцът на цветните фонтани, създаден с най-модерната техника ще Ви достави невероятно удоволствие. Връщане в хотела в Сингапур. Нощувка в Сингапур", 28 },
                    { 186, null, 5, "Закуска. Свободно време и възможност за разглеждане на града самостоятелно", 28 },
                    { 187, null, 6, "Закуска. Свободно време и възможност за разглеждане на града самостоятелно", 28 },
                    { 188, null, 7, "Закуска. Напускане ха хотела. Връщане в София през транзитно летище", 28 },
                    { 189, null, 1, "Полет от летище София за Мале през Истанбул с Турски авиолинии. Кацане на летището в Истанбул", 29 },
                    { 190, null, 2, "Полет за Мале. Пристигане в Мале в 08,00ч. Посрещане от фирмата ни партньор и трансфер до резорта. Пристигане в хотела и настаняване. Нощувка", 29 },
                    { 191, null, 3, "Закуска Свободно време или допълнителна екскурзия(уговаря се на място). Нощувка", 29 },
                    { 192, null, 4, "Закуска Свободно време или допълнителна екскурзия(уговаря се на място). Нощувка", 29 },
                    { 193, null, 5, "Закуска Свободно време или допълнителна екскурзия(уговаря се на място). Нощувка", 29 },
                    { 194, null, 6, "Закуска Свободно време или допълнителна екскурзия(уговаря се на място). Нощувка", 29 },
                    { 195, null, 7, "Закуска Свободно време или допълнителна екскурзия(уговаря се на място). Нощувка", 29 },
                    { 196, null, 8, "Закуска Свободно време или допълнителна екскурзия(уговаря се на място). Нощувка", 29 },
                    { 197, null, 9, "Ранна закуска. Трансфер до летището в Мале за полет на Турски авиолинии в 09:40 ч. Кацане на летището в Истанбул и полет за София. Кацане на летище София в 20:45 часа", 29 },
                    { 198, null, 1, "Среща на летище София и изпращане от представител на туроператора. Отпътуване в 10:00 ч. с чартърен полет. Кацане в 12:20 ч. на летище Хургада. Посрещане от фирмата партньор и трансфер до избрания хотел. Настаняване в хотела след 14.00 ч. Свободно време. Вечеря. Нощувка", 30 },
                    { 199, 58, 2, "Закуска. Свободно време или възможност за допълнителна полудневна екскурзия подводница Submarine. Ако не обичате да плувате, но желаете да разгледате вълшебния свят под повърхността на водата, то задължително се възползвайте от екскурзията с туристическата подводница Submarine. Подводницата се спуска на 25 метра дълбочина под водата, сред цветовете на Червено море, където за един час ще може да се насладите на изобилие от красиви корали и множество морски рибни видове. Ще се запознаете отблизо с естествената водна среда на едни от най-атрактивните морски обитатели. Продължителност около 3 часа", 30 },
                    { 200, 59, 3, "Закуска. Свободно време или възможност за допълнителна целодневна екскурзия Луксор - Хиляди туристи от целия свят всяка година избират Луксор за своя ваканционна дестинация, за да се насладят на тези паметници на историята и архитектурата. Луксор е идеалното място и за онези, които са решили да посетят Горен Египет. В Луксор е и крайната спирка на корабните пътешествия по река Нил. Отпътуване от хотела около 04:30 ч. за Луксор – древната столица на египетските фараони. Посещение на Карнак - най-големият религиозен комплекс в света, който заема площ от 840 декара. Той е бил известен на древните египтяни като Ипет-Исут (най-святото място) и представлява град от храмове, обособен в 3 зони, посветени на върховният бог Амон, бог Монту и богинята Мут. Най-значителното здание в комплекса е храмът на Амон Ра – истински архитектурен шедьовър, включващ огромна колонна зала, различни храмови помещения и 10 пилона, най-големият от които е 113 м. Разглеждане на Алеята на сфинксовете, която свързва Луксорския и Карнакския храм, с общата дължина около 5 км. По алеята се извършвало шествието на фараоните до карнакския храм. Отпътуване към Долината на царете - пустинна равнина, заобиколена от стръмни хълмове. Разположена е на западния бряг на Нил, близо до град Тива. Тук се намира прочутата гробница на фараона Тутанкамон – една от 62-те открити гробници досега. Посещение на изумителният храм на Хатшепсут – първата жена фараон, управлявала Египет две мирни десетилетия Разглеждане Колосите на Мемнон – две масивни каменни статуи, които представят фараона Аменхотеп III в седнало положение, с ръце на коленете и поглед, насочен на изток към реката и изгряващото слънце. Посещение на местна фабрика за алабастър и музея на папируса. Връщане в хотела около 22 ч. Нощувка", 30 },
                    { 201, 60, 4, "Закуска. Свободно време или възможност за допълнителна целодневна екскурзия Super safary. Отпътуване от хотела към 13 ч. от хотела. Ще можете да видите същността на ландшафта в пустинята – долините и красивите пясъчни планини с червеникавият им оттенък. Запознанството Ви с Египет ще е непълно, ако пропуснете пътуване в пустинята на сафари. Ще имате възможност да се сдобиете с неповторими впечатления от препускането с джипове по дюните, екстремното шофиране на квадроцикли и двуместни бъгита. Ще яздите камила и ще се запознаете отблизо с живота в пустинята, ще посетите малък зоопарк и терариум, ще се насладите на фолклорно шоу (танура, ориенталски танци, огнено шоу). Продължителност на екскурзията около 8 часа. Връщане в хотела. Нощувка", 30 },
                    { 202, 61, 5, "Закуска. Свободно време или възможност за допълнителна целодневна екскурзия Кайро и Пирамидите в Гиза. Екскурзия до Пирамидите – едно от Седемте чудеса на Древния свят и Сфинкса в Гиза – най-големият, най-старият и най-известният от безбройните запазени сфинксове в Египет. Отпътуване от хотела около 02:00 ч. Пирамидите в Гиза от дълго време са най-посещаваната атракция около Кайро. От времето на тяхното изграждане пирамидите в Гиза въплъщават древността, мистерията – и дават повод за невероятни хипотези. Пирамидата на Хеопс е най-старата в Гиза и най-голямата в света, изградена ок. 2500 г. пр.н.е. от близо 2,3 милиона варовикови блокове, тежащи средно по 2,75 тона и придвижвани от 100 000 роби. Трите по-малки пирамиди в съседство принадлежат на Хеопсовите царици или сестри. Посещение на Египетския музей, който пази най-голямата колекция с антики от времето на фараоните в света. В музея има 160 000 артефакти, покриващи 5000 годишна история. Връщане в хотела около 00:30  ч. Нощувка", 30 },
                    { 203, 62, 6, "Закуска. Свободно време или възможност за допълнителна полудневна екскурзия – Дайвинг в красивите рифове на Червено Море. Едно от най-предпочитаните места за гмуркане в света се намира в Египет. В подводния резерват, между разноцветни коралови рифове (тук виреят над 150 вида корали), можете да наблюдавате живота на хиляди морски обитатели. Червено море е описвано като „коридор на чудесата“за гмуркане. Отпътуване от хотела към 8 ч. сутринта. Подводният свят е очарователен, пълен с живот и цветове, непроучен и загадъчен и затова е още по-привлекателен. Гмуркането е начин да се опознае този свят, удивително съчетаващ в себе си нови впечатления, наслада от богатството на подводния свят. Морето е известно със своята разнообразна фауна и впечатляващата чистота на водата, с видимост, която често превишава 45 метра. Голяма част от уникалността на гмуркането в Червено море се дължи на впечатляващото припокриване на ярката красота на пустинята и истинската райска градина във водите на Червено море. Около 10 процента от животинските видове в Червено море не се срещат никъде другаде на Земята. Ще имате възможност да се насладите на гмуркане, прекрасна разходка с лодка и риболов и да наблюдавате невороятният и богатит животински свят на Червено море. Връщане в хотела. Вечеря. Нощувка", 30 },
                    { 204, 63, 7, "Закуска. Свободно време или възможност за допълнителна целодневна екскурзия Orange Island и шнорхелинг. Едно от най-популярните места за екскурзия с лодка и шнорхелинг в Хургада. Екскурзията започва около 8:00 ч. и включва морска разходка с яхта с възможност да се насладите на красотата на един от прекрасните острови и съкровища на кораловия риф, белият пясък и слънчевите лъчи на Червено море. Слизане на плажа на острова за плуване и релакс. Обяд на яхтата. Едно от най-прекрасните места за гмуркане в целия свят е в околностите на острова. Две спирания за гмуркане в близост до коралови рифове. Като за тези, които не са любители на гмуркането няма да им е трудно също да видят и да се полюбуват на красивите морски видове, тъй като водата в Червено море е кристално бистра и чиста. Връщане в хотела около 16:00 часа. Вечеря. Нощувка", 30 },
                    { 205, null, 8, "Закуска. Освобождаване на хотела. Трансфер до летище Хургада в обявения час от фирмата партньор. Полет за София", 30 },
                    { 206, null, 1, "Излитане от летище София с директен чартърен полет за Хургада. Посрещане на летище Хургада и трансфер до избрания хотел. Настаняване след 14:00 часа. Свободно време. Нощувка", 31 },
                    { 207, null, 2, "Закуска. Свободно време или възможност да се впуснете в опознаване на местните забележителности с разнообразие от допълнителни екскурзиии (резерварат се и се заплащат на място в Египет)", 31 },
                    { 208, null, 3, "Закуска. Свободно време или възможност да се впуснете в опознаване на местните забележителности с разнообразие от допълнителни екскурзиии (резерварат се и се заплащат на място в Египет)", 31 },
                    { 209, null, 4, "Закуска. Свободно време или възможност да се впуснете в опознаване на местните забележителности с разнообразие от допълнителни екскурзиии (резерварат се и се заплащат на място в Египет)", 31 },
                    { 210, null, 5, "Закуска. Свободно време или възможност да се впуснете в опознаване на местните забележителности с разнообразие от допълнителни екскурзиии (резерварат се и се заплащат на място в Египет)", 31 }
                });

            migrationBuilder.InsertData(
                table: "OrganizedOfferDays",
                columns: new[] { "Id", "ActivityId", "DayNumber", "Description", "OrganizedOfferId" },
                values: new object[,]
                {
                    { 211, null, 6, "Закуска. Свободно време или възможност да се впуснете в опознаване на местните забележителности с разнообразие от допълнителни екскурзиии (резерварат се и се заплащат на място в Египет)", 31 },
                    { 212, null, 7, "Закуска. Свободно време или възможност да се впуснете в опознаване на местните забележителности с разнообразие от допълнителни екскурзиии (резерварат се и се заплащат на място в Египет)", 31 },
                    { 213, null, 8, "Закуска в хотела. Освобождаване на стаите. Трансфер до летището и полет от Хургада за София", 31 },
                    { 214, null, 1, "Среща в София. Транзитивен полет към Макада Бей. Среща с представител на фирмата партньор. Настаняване в хотела. Нощувка", 32 },
                    { 215, null, 2, "Закуска. Свободно време за плаж и разпускане или ексурзия по желание(уговорена на място)", 32 },
                    { 216, null, 3, "Закуска. Свободно време за плаж и разпускане или ексурзия по желание(уговорена на място)", 32 },
                    { 217, null, 4, "Закуска. Свободно време за плаж и разпускане или ексурзия по желание(уговорена на място)", 32 },
                    { 218, null, 5, "Закуска. Свободно време за плаж и разпускане или ексурзия по желание(уговорена на място)", 32 },
                    { 219, null, 6, "Закуска. Напускане на хотела. Връщане в София чрез транзитивен полет", 32 },
                    { 220, null, 1, "Среща в София. Транзитивен полет до дестинацията. Среща с представител на фирма партньор. Настаняване в хотела. Нощувка", 33 },
                    { 221, null, 2, "Закуска. Панорамна обиколка около града(включено в цената). Връщане в хотела. Вечеря. Нощувка", 33 },
                    { 222, null, 3, "Закуска. Свободно време и възможност за разхождане самостоятелно или екскурзия по желание(уговорена на място)", 33 },
                    { 223, null, 4, "Закуска. Свободно време и възможност за разхождане самостоятелно или екскурзия по желание(уговорена на място)", 33 },
                    { 224, null, 5, "Закуска. Свободно време и възможност за разхождане самостоятелно или екскурзия по желание(уговорена на място)", 33 },
                    { 225, null, 6, "Закуска. Напускане на хотела. Връщане в София чрез транзитивен полет", 33 },
                    { 226, null, 1, "Среща в София. Транзитивен полет до остров Джерба. Среща с представител на фирма партньор. Настаняване в хотела. Нощувка", 34 },
                    { 227, null, 2, "Закуска. Панорамна обиколка около острова(включено в цената). Връщане в хотела. Вечеря. Нощувка", 34 },
                    { 228, null, 3, "Закуска. Свободно време и възможност за плаж или екскурзия по желание(уговорена на място)", 34 },
                    { 229, null, 4, "Закуска. Свободно време и възможност за разхождане самостоятелно или екскурзия по желание(уговорена на място)", 34 },
                    { 230, null, 5, "Закуска. Свободно време и възможност за разхождане самостоятелно или екскурзия по желание(уговорена на място)", 34 },
                    { 231, null, 6, "Закуска. Напускане на хотела. Връщане в София чрез транзитивен полет", 34 },
                    { 232, null, 1, "Сборен час на Летище Варна - с полет Варна – Енфида с European Air Charter. Пристигане на летище Енфида. Трансфер до избрания хотел. Настаняване. В периода от пристигане в хотела до настаняване, туристите могат да се възползват от всички услуги, включени в концепцията на хотела. Свободно време. Нощувка", 35 },
                    { 233, null, 2, "Свободно време за плаж и забавления", 35 },
                    { 234, 64, 3, "Свободно време за плаж и забавления или възможност за допълнителна екскурзия: Разходка с пиратски кораб - Едно вълнуващо плаване, спектакъл със пиратски танци и костюми на борда на кораб, на който всеки е мечтал да бъде като дете, вълнуващо се и готово да посрещтне това морско приключение. Върнете се назад във времето, когато сте мечтали да се качите на подобен кораб, да бъдете част от пиратско приключение, да покорявате нови брегове, да търсите скрити съкровища…", 35 },
                    { 235, 65, 4, "Свободно време за плаж и забавления или възможност за допълнителни екскурзия: Кайруан и Ел Джем (целодневна екскурзия) - Екскурзията започва с посещение на Кайруан - най-святото за мюсюлманите място в Магреб и 4-ят по святост град за исляма. Ще разгледаме Окба джамия / Голямата джамия, издигната заедно с града през 670 г., и ще се отдадем на шопинг, а след това продължаваме обиколката на Кайруан с посещение на водните резервоари на града – построени преди повече от 1000 години. Продължаваме нашият маршрут до Ел Джем , където се намира най-добре запазения и трети в света амфитеатър. Това е един от най-впечатляващите паметници на световната история и именно той е послужил като декор за заснемането на незабравимия “Гладиатор”. Вечерта се връщаме в хотела", 35 },
                    { 236, 66, 5, "Свободно време за плаж и забавления или възможност за допълнителни екскурзия: Полудневна екскурзия - Фригиа зоопарк. Friguia Park е частна зоологическа градина в Тунис, открита на 11 ноември 2000 г. близо до град Буфича. Зоологическата градина на Фригия се намира между градовете Енфида и Буфиша. Заема площ от 360 000 кв. м, за сравнение Московският зоопарк (вторият по големина зоопарк в Русия) заема 220 000 кв. м. В зоопарка са представени 61 вида от фауната на африканския континент. Общо зоологическата градина съдържа 420 животни. Паркът Фригия е първият парк за диви животни в Тунис, където всички животни се държат в относителна свобода, което позволява да се запазят естествените инстинкти и социалното поведение на представения вид. В допълнение към загражденията за животни в парка Фригия можете да видите шоу на морски лъвове, етническо шоу на зулусите, а през 2010 г. в парка беше открит първият делфинариум в Тунис", 35 },
                    { 237, null, 6, "Свободно време за плаж и забавления", 35 },
                    { 238, null, 7, "Свободно време за плаж и забавления", 35 },
                    { 239, null, 8, "Закуска. Tрансфер за полет Енфида – Варна с European Air Charter", 35 }
                });

            migrationBuilder.InsertData(
                table: "OrganizedOfferStartAndEndDates",
                columns: new[] { "Id", "EndDate", "OrganizedHolidayId", "StartDate" },
                values: new object[,]
                {
                    { 1, new DateTime(2024, 5, 9, 0, 0, 0, 0, DateTimeKind.Unspecified), 1, new DateTime(2024, 5, 5, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 2, new DateTime(2024, 5, 30, 0, 0, 0, 0, DateTimeKind.Unspecified), 1, new DateTime(2024, 5, 26, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 3, new DateTime(2024, 5, 8, 0, 0, 0, 0, DateTimeKind.Unspecified), 2, new DateTime(2024, 5, 1, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 4, new DateTime(2024, 6, 13, 0, 0, 0, 0, DateTimeKind.Unspecified), 2, new DateTime(2024, 6, 6, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 5, new DateTime(2024, 5, 17, 0, 0, 0, 0, DateTimeKind.Unspecified), 3, new DateTime(2024, 5, 13, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 6, new DateTime(2024, 7, 5, 0, 0, 0, 0, DateTimeKind.Unspecified), 3, new DateTime(2024, 7, 1, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 7, new DateTime(2024, 4, 30, 0, 0, 0, 0, DateTimeKind.Unspecified), 4, new DateTime(2024, 4, 25, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 8, new DateTime(2024, 6, 15, 0, 0, 0, 0, DateTimeKind.Unspecified), 4, new DateTime(2024, 6, 10, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 9, new DateTime(2024, 4, 22, 0, 0, 0, 0, DateTimeKind.Unspecified), 5, new DateTime(2024, 4, 18, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 10, new DateTime(2024, 4, 14, 0, 0, 0, 0, DateTimeKind.Unspecified), 5, new DateTime(2024, 5, 10, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 11, new DateTime(2024, 6, 12, 0, 0, 0, 0, DateTimeKind.Unspecified), 6, new DateTime(2024, 6, 5, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 12, new DateTime(2024, 7, 12, 0, 0, 0, 0, DateTimeKind.Unspecified), 6, new DateTime(2024, 7, 5, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 13, new DateTime(2024, 5, 17, 0, 0, 0, 0, DateTimeKind.Unspecified), 7, new DateTime(2024, 5, 10, 0, 0, 0, 0, DateTimeKind.Unspecified) }
                });

            migrationBuilder.InsertData(
                table: "OrganizedOfferStartAndEndDates",
                columns: new[] { "Id", "EndDate", "OrganizedHolidayId", "StartDate" },
                values: new object[,]
                {
                    { 14, new DateTime(2024, 6, 27, 0, 0, 0, 0, DateTimeKind.Unspecified), 7, new DateTime(2024, 6, 20, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 15, new DateTime(2024, 4, 23, 0, 0, 0, 0, DateTimeKind.Unspecified), 8, new DateTime(2024, 4, 20, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 16, new DateTime(2024, 5, 11, 0, 0, 0, 0, DateTimeKind.Unspecified), 8, new DateTime(2024, 5, 8, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 17, new DateTime(2024, 5, 15, 0, 0, 0, 0, DateTimeKind.Unspecified), 9, new DateTime(2024, 5, 12, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 18, new DateTime(2024, 6, 18, 0, 0, 0, 0, DateTimeKind.Unspecified), 9, new DateTime(2024, 6, 15, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 19, new DateTime(2024, 4, 21, 0, 0, 0, 0, DateTimeKind.Unspecified), 10, new DateTime(2024, 4, 18, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 20, new DateTime(2024, 6, 4, 0, 0, 0, 0, DateTimeKind.Unspecified), 10, new DateTime(2024, 6, 1, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 21, new DateTime(2024, 6, 14, 0, 0, 0, 0, DateTimeKind.Unspecified), 11, new DateTime(2024, 6, 7, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 22, new DateTime(2024, 7, 22, 0, 0, 0, 0, DateTimeKind.Unspecified), 11, new DateTime(2024, 7, 15, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 23, new DateTime(2024, 6, 8, 0, 0, 0, 0, DateTimeKind.Unspecified), 12, new DateTime(2024, 6, 1, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 24, new DateTime(2024, 7, 19, 0, 0, 0, 0, DateTimeKind.Unspecified), 12, new DateTime(2024, 7, 12, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 25, new DateTime(2024, 6, 11, 0, 0, 0, 0, DateTimeKind.Unspecified), 13, new DateTime(2024, 6, 4, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 26, new DateTime(2024, 8, 8, 0, 0, 0, 0, DateTimeKind.Unspecified), 13, new DateTime(2024, 8, 1, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 27, new DateTime(2024, 5, 19, 0, 0, 0, 0, DateTimeKind.Unspecified), 14, new DateTime(2024, 5, 12, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 28, new DateTime(2024, 6, 18, 0, 0, 0, 0, DateTimeKind.Unspecified), 14, new DateTime(2024, 6, 11, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 29, new DateTime(2024, 6, 5, 0, 0, 0, 0, DateTimeKind.Unspecified), 15, new DateTime(2024, 5, 28, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 30, new DateTime(2024, 7, 12, 0, 0, 0, 0, DateTimeKind.Unspecified), 15, new DateTime(2024, 7, 4, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 31, new DateTime(2024, 6, 19, 0, 0, 0, 0, DateTimeKind.Unspecified), 16, new DateTime(2024, 6, 11, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 32, new DateTime(2024, 8, 9, 0, 0, 0, 0, DateTimeKind.Unspecified), 16, new DateTime(2024, 8, 1, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 33, new DateTime(2024, 6, 27, 0, 0, 0, 0, DateTimeKind.Unspecified), 17, new DateTime(2024, 6, 20, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 34, new DateTime(2024, 8, 10, 0, 0, 0, 0, DateTimeKind.Unspecified), 17, new DateTime(2024, 8, 3, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 35, new DateTime(2024, 5, 14, 0, 0, 0, 0, DateTimeKind.Unspecified), 18, new DateTime(2024, 5, 11, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 36, new DateTime(2024, 6, 21, 0, 0, 0, 0, DateTimeKind.Unspecified), 18, new DateTime(2024, 6, 18, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 37, new DateTime(2024, 4, 25, 0, 0, 0, 0, DateTimeKind.Unspecified), 19, new DateTime(2024, 4, 22, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 38, new DateTime(2024, 5, 29, 0, 0, 0, 0, DateTimeKind.Unspecified), 19, new DateTime(2024, 5, 26, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 39, new DateTime(2024, 6, 21, 0, 0, 0, 0, DateTimeKind.Unspecified), 20, new DateTime(2024, 6, 15, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 40, new DateTime(2024, 8, 18, 0, 0, 0, 0, DateTimeKind.Unspecified), 20, new DateTime(2024, 8, 12, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 41, new DateTime(2024, 6, 29, 0, 0, 0, 0, DateTimeKind.Unspecified), 21, new DateTime(2024, 6, 20, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 42, new DateTime(2024, 8, 28, 0, 0, 0, 0, DateTimeKind.Unspecified), 21, new DateTime(2024, 8, 19, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 43, new DateTime(2024, 6, 21, 0, 0, 0, 0, DateTimeKind.Unspecified), 22, new DateTime(2024, 6, 16, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 44, new DateTime(2024, 7, 25, 0, 0, 0, 0, DateTimeKind.Unspecified), 22, new DateTime(2024, 7, 20, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 45, new DateTime(2024, 5, 18, 0, 0, 0, 0, DateTimeKind.Unspecified), 23, new DateTime(2024, 5, 12, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 46, new DateTime(2024, 6, 17, 0, 0, 0, 0, DateTimeKind.Unspecified), 23, new DateTime(2024, 6, 11, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 47, new DateTime(2024, 7, 10, 0, 0, 0, 0, DateTimeKind.Unspecified), 24, new DateTime(2024, 7, 4, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 48, new DateTime(2024, 9, 7, 0, 0, 0, 0, DateTimeKind.Unspecified), 24, new DateTime(2024, 9, 1, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 49, new DateTime(2024, 7, 21, 0, 0, 0, 0, DateTimeKind.Unspecified), 25, new DateTime(2024, 7, 15, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 50, new DateTime(2024, 8, 25, 0, 0, 0, 0, DateTimeKind.Unspecified), 25, new DateTime(2024, 8, 19, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 51, new DateTime(2024, 5, 22, 0, 0, 0, 0, DateTimeKind.Unspecified), 26, new DateTime(2024, 5, 16, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 52, new DateTime(2024, 7, 7, 0, 0, 0, 0, DateTimeKind.Unspecified), 26, new DateTime(2024, 7, 1, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 53, new DateTime(2024, 6, 18, 0, 0, 0, 0, DateTimeKind.Unspecified), 27, new DateTime(2024, 6, 12, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 54, new DateTime(2024, 7, 21, 0, 0, 0, 0, DateTimeKind.Unspecified), 27, new DateTime(2024, 7, 15, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 55, new DateTime(2024, 7, 8, 0, 0, 0, 0, DateTimeKind.Unspecified), 28, new DateTime(2024, 7, 2, 0, 0, 0, 0, DateTimeKind.Unspecified) }
                });

            migrationBuilder.InsertData(
                table: "OrganizedOfferStartAndEndDates",
                columns: new[] { "Id", "EndDate", "OrganizedHolidayId", "StartDate" },
                values: new object[,]
                {
                    { 56, new DateTime(2024, 8, 22, 0, 0, 0, 0, DateTimeKind.Unspecified), 28, new DateTime(2024, 8, 16, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 57, new DateTime(2024, 7, 26, 0, 0, 0, 0, DateTimeKind.Unspecified), 29, new DateTime(2024, 7, 18, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 58, new DateTime(2024, 9, 10, 0, 0, 0, 0, DateTimeKind.Unspecified), 29, new DateTime(2024, 9, 2, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 59, new DateTime(2024, 5, 21, 0, 0, 0, 0, DateTimeKind.Unspecified), 30, new DateTime(2024, 5, 14, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 60, new DateTime(2024, 7, 9, 0, 0, 0, 0, DateTimeKind.Unspecified), 30, new DateTime(2024, 7, 2, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 61, new DateTime(2024, 5, 15, 0, 0, 0, 0, DateTimeKind.Unspecified), 31, new DateTime(2024, 5, 8, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 62, new DateTime(2024, 7, 21, 0, 0, 0, 0, DateTimeKind.Unspecified), 31, new DateTime(2024, 7, 14, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 63, new DateTime(2024, 6, 18, 0, 0, 0, 0, DateTimeKind.Unspecified), 32, new DateTime(2024, 6, 13, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 64, new DateTime(2024, 7, 31, 0, 0, 0, 0, DateTimeKind.Unspecified), 32, new DateTime(2024, 7, 26, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 65, new DateTime(2024, 6, 5, 0, 0, 0, 0, DateTimeKind.Unspecified), 33, new DateTime(2024, 5, 31, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 66, new DateTime(2024, 7, 6, 0, 0, 0, 0, DateTimeKind.Unspecified), 33, new DateTime(2024, 7, 1, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 67, new DateTime(2024, 4, 25, 0, 0, 0, 0, DateTimeKind.Unspecified), 34, new DateTime(2024, 4, 20, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 68, new DateTime(2024, 6, 23, 0, 0, 0, 0, DateTimeKind.Unspecified), 34, new DateTime(2024, 6, 18, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 69, new DateTime(2024, 6, 18, 0, 0, 0, 0, DateTimeKind.Unspecified), 35, new DateTime(2024, 6, 11, 0, 0, 0, 0, DateTimeKind.Unspecified) },
                    { 70, new DateTime(2024, 8, 5, 0, 0, 0, 0, DateTimeKind.Unspecified), 35, new DateTime(2024, 7, 29, 0, 0, 0, 0, DateTimeKind.Unspecified) }
                });

            migrationBuilder.InsertData(
                table: "Activities",
                columns: new[] { "Id", "Description", "MinPeopleNeeded", "Name", "OrganizedOfferDayId", "Price" },
                values: new object[,]
                {
                    { 1, "Около: пристанището; акведуктът, построен по заповед на Сюлейман Великолепни през 1550 г.; църквата „Св. Богородица“, родната къща на Али Паша, който провежда значими реформи в Османската империя през 19 в.; турската крепост от 16 в., станала символ на града", 3, "Пешеходна разходка в  Кавала", 2, 40m },
                    { 2, "Съдържа посещение на традиционна фабрика за производство на зехтин, манастира \"Св. Архангели\" и на златарското ателие \"Iris Gold\". Пешеходна разходка и свободно време в столицата Лименас", 15, "Панорамна обиколка на остров Тасос", 3, 110m },
                    { 3, "Минойският дворец е основната забележителност в Кносос, град от значителна важност в античността, който основно е бил населяван през Неолитния период до 5 век пр. Хр. Дворецът е построен на хълма Кефала, с лесен достъп до морето. Според митологията е бил седалище на мъдрия цар Минос. Двореца Кносос се свързва с вълнуващи легенди като мита за Лабиринта, с Минотавъра и историята за Дедал и Икар. \r\nРазкопките на двореца са започнали още по времето на Сър Артър Еванс през 1900 г и тогава са разкрити двореца и прилежащите му сгради, които са били център на кулутрата по време на Брозновата ера", 20, "Дворецът Кносос", 7, 60m },
                    { 4, "Археологическия музей в Ираклион е един от най-старите и важни музеи в Гърция, и един от най-известните в Европа. Той помещава експонати от всички периоди на Критската цивилизация, обхващащи хронологичен период от над 5500 години от неолита до римско време. Археологическият музей Ираклион се гордее със своята уникална колекция, която включва шедьоврите на минойското изкуство. С право се счита за музей на минойската култура", 20, "Музеят Ираклион", 8, 55m },
                    { 5, "Централният пазар в Ираклион може да бъде намерен на улица „1866 г.“, улица с историческо значение за Крит, тъй като именно в тази област се състоя едно от въстанията  на критската нация в борбата за свобода от Османската империя. Туристите могат да закупят храна, напитки, дрехи, обувки  и сувенири", 20, "Пазарът на Ираклион", 9, 50m },
                    { 6, "Остров Спиналонга е една от емблематичните забележителности в района на остров Крит. Малко островче, намиращо се във водите на залива Мирабело. Това място е известно още като остров Лепер, тъй като там прокажените от остров Крит и останалата част на Гърция са били под карантина до 1957 г. През 16-ти век венецианците са превърнали острова в непристъпна крепост, за да контролират достъпа до залива на Елунда. Старото име на острова е Калидон. След като турците превземат Крит през 1669 год., остров Спиналонга остава под венецианско владение още 46 години до 1715 г. Превземайки го, турците се настаняват на него, използвайки вече построеното от венецианците. Това продължава дори и след като Гърция извоюва своята независимост. Така през 1903 година гръцкото правителство взело решение да изолира болните от проказа от цяла Гърция на остров Спиналонга. Проказата е коварна и силно заразна болест. Така без да имат избор турците избягали пред страха от силната зараза и Спиналонга станал и фактически гръцки. Колонията на прокажените просъществувала от 1903 до 1957 година, когато е открито лекарството за проказата.\r\nСлед като пристигнетето в град Елунда с малко корабче се пътува до остров Спиналонга, след разглеждането нa крепостта с местен екскурзовод, туристите се връщат в град Елунда, където обядват. Следва отпътуване за град Агиос Николос, където туристите ще имат възможност за пазаруване и разглеждане на градчето", 40, "Остров Спиналонга", 10, 110m },
                    { 7, "Плато  Ласити - едно от най-красивите места на острова, разположено в планината Диктис на 850 метра над морското равнище. Платото е с размери - дължина 10 км и ширина 5 км. Платото, което в миналото е впечатлявало със своите 10 000 вятърни мелници и невероятна природа. Това е най-голямото и най-високото плато на Гърция! Платото Ласити е разположено в източната част на остров Крит в планината Диктис.Първата спирака е в манастира Панагия Гюверьотиса, красив манастир със стара история.\r\nСлед това се посещава селото Краси където в центъра на селото ще имаме възможност да видим вековният дъб - най-голямото дърво на остров Крит. Екскурзията продължава с посещение на манастира Кера Кардиотиса с чудотворната икона на Света Богородица, както и стенописи от 13 и 14 век. След посещението на манастира по време на обиколката на платото Ласити се преминава през село Психро, където се намира пещерата, в която според митологията е роден Зевс - бащата на всички богове и хора.\r\nСледващата спирка е селцето Мохос, където можете да се разходите по живописни улици на градчето или просто да изпиете чаша традиционно гръцко кафе. Разходката продължава с посещение на Еко Парк Ласинтос - традиционно критско село, което ще ни запознае с живота и традициите на местното население. Тук можете да видите действащ тъкачен стан, процеса на производството на свещи, грънчарски колела и на планински мед и билки. Тук се произвежда и могат да се дегустират безплатно зехтин, ликьори, вина, сирена, маслинова паста.\r\nСвободно време и възможност за обяд", 40, "Сърцето на Крит", 11, 100m },
                    { 8, "Ако не сте били на остров Санторини, а сте стигнали до остров Крит означава, че тази екскурзия е като задължителна за Вас – оставете се да бъдете очаровани от перлата на Цикладите!\r\nВече е възможно да пътувате с кораб и да бъдете на острова за около 2 часа. \r\nСанторини по същество е това, което остава след огромно вулканично изригване, което унищожава най-ранните селища и създаде сегашната геоложка калдера. Тази Калдера е с размери около 84 кв. км. и е заобиколена от 300 м високи стръмни скали от трите страни", 50, "Остров Санторини", 12, 180m },
                    { 9, "Порто Кацики или Егремни - най-красивите плажове на острова с възможност за скачане и плуване в кристалната вода на Йонийско море; остров Кефалония със свободно време в градчето Фискардо; остров Итака с възможност за разходка или плаж на острова на Одисей; пещерите на остров Меганиси; трите острова на семейство Онасис - Скорпиос, Спарти и Скорпиди; остров Мадури, известен със своята вечнозелена растителност", 25, "Oтпътуване за град Нидри за целодневен круиз с кораб (продължителност 9 часа)", 15, 210m },
                    { 10, "Остров Антипаксос с възможност за плуване в топлите и чисти води на Йонийско море; Сините пещери, известни с причудливите си форми, образувани през годините от морските води; остров Паксос с посещение на столицата Гайос и свободно време за разходка и обяд в някоя от местните рибни таверни", 25, "Oтпътуване за Парга за целодневен круиз с корабче", 16, 170m },
                    { 11, "Посещение на: град Лефкада - Централният площад, църквата „Св. Спиридон“, построена през 1685 г. от венецианците, кметството, църквата „Св. Мина“ и катедралата; манастира \"Панагия Фанеромени\" - най-важният религиозен център на острова, построен през 1634 г. върху руините на древен храм, посветен на богинята Артемида; плажа „Катизма“ - един от най-добрите на острова", 15, "Oбиколка на острова", 17, 60m },
                    { 12, "Посещение на златарско ателие \"Iris Gold\", традиционна фабрика за производство на зехтин и манастира \"Св. Архангели\". Пешеходна разходка в столицата Лименас", 10, "Панорамна обиколка на остров Тасос", 21, 60m },
                    { 13, "Екскурзия до: град-държава Ватикана; Площадите на Рим", 25, "Екскурзия до: град-държава Ватикана; Площадите на Рим", 26, 80m },
                    { 14, "Екскурзия Колизеум и Римски форуми", 25, "Екскурзия Колизеум и Римски форуми", 27, 70m },
                    { 15, "екскурзия до Тиволи", 25, "Екскурзия до Тиволи", 28, 75m },
                    { 16, "Посещение на столицата Каляри – един от най-зелените градове на остров Сардиния. Разглеждане на стария град, откъдето се откриват прекрасни гледки към залива и пристанището. Тук са запазени и старите защитни стени, както и две кули от 13 век. Впечатляваш образец за съвременно развитие на град в централното Средиземноморие\r\nОтпътуване за археологическия обект Су Нураги в район Барумини. Су Нураги е древен град на народа нураги, населявал Сардиния през бронзовата епоха. Градът е построен в периода 17 - 13 век пр. Хр. и се състои от крепост с наблюдателни кули и жилищна зона, която заобикаля укреплението. Добре запазените останки от града са включени в Списъка за световно културно и природно наследство на ЮНЕСКО през 1997 г. Това е единствения начин да усетите в пълна степен цивилизацията на нурагите", 30, "Каляри и Баруминим", 39, 150m },
                    { 17, "Отпътуване от хотела за посещение на третия в Европа най-посещаван град от най-богатите хора в света – Коста Смералда. Изумрудения бряг или скъпоценният камък на остров Сардиния е изключително оживен и елегантен, градчето е символ за разточителството и лукса, които изпълват атмосферата. Това е едно екологично чисто кътче, при което и най-малката подробност е в пълна хармония със заобикалящия го приказно-красив пейзаж.\r\nВАЖНО: Предвидено е време за плаж", 30, "Коста Смералда", 40, 100m },
                    { 18, "Посещение на втория по големина град на остров Сардиния и една от най-предпочитаните дестинации за посещение от туристите, а именно градчето Сасари със своят неповторим и автентичен чар. Сасари е модерен град, който пази история още от неолита\r\nПрез ІХ-Х век в града се заселват римляни, благодарение на които и до днес са запазени изключителни забележителности. Възможност за разглеждане на забележителностите: Централния площад с паметника на Виктор Емануил, Катедралата, посветена на Св. Николас в готически стил от ХІІІвек, Крепостните стени от ХІІІ век\r\nОтпътуване за приказното пристанищно градче Кастелсардо кацнало върху скала на брега на морето", 30, "Сасари и Кастелсардо", 41, 80m },
                    { 19, "Архипелага Магдалена (Ла Мадалена) е островна група, която се състои от над 60 острова, разположена североизточно от остров Сардиния. Изумява туристите със спиращите дъха гледки към прозрачните води в тази част на Средиземно море\r\nОтпътува се рано сутринта с автобус към град Палау. От пристанището в Палау се отпътува към архипелага Магдалена с туристически кораб. Посещение на 2 от големите острова на архипелага. Свободно време за плаж и снимки. Акостиране на пристанището в Палау и отпътуване с автобус към хотела\r\nВАЖНО: Свободно време за плаж – препоръчваме да носите бански и плажни принадлежности", 30, "Архипелага Магдалена (Ла Мадалена)", 42, 190m },
                    { 20, "Посещение на остров Корсика или още познат като „Островът на красотата“. Изключителната природна красота на острова, привлича ежегодно много туристи. Една трета от острова е и Регионален природен парк „Корсика“. Тук могат да се срещнат много и различни плодове, като лимони, портокали, маслини, грозде и добре познатите плодове на кактуси. Тук можете да се насладите на прекрасни природни феномени, закътани морски заливи и бели плажове. Едно от нещата, които най-много впечатляват посетителите са: красивите римски храмове, църквите в романски стил, както и готическите и барокови катедрали\r\nВАЖНО: Възможно е ползването на туристическо влакче (по желание) – около 8 евро на човек в две посоки", 30, "Корсика", 43, 190m },
                    { 21, "Панорамна обиколка на едно от най-красивите градчета на остров Сардиния. Градчето е известно със своята изключително добре запазена типичната архитектура от Каталуния. Едни от най-известните забележителности са запазените Крепостни стени, порти и кули, най–високата от които е Торе де Сулис със своите 22 метра, а кулата Торе ди Порта е събрала най-интересните разкази за историята на прекрасното градче Алгеро. Алгеро е известно също така и със своите приказни плажове, където многобройните посетители ежедневно събират тен или се отдават на спортове, като – сърф, водни, каяк и други", 30, "Алгеро", 44, 120m },
                    { 22, "Посещение на китното селце Сен Пол дьо Ванс (12 км) и пешеходен тур в средновековния град, чийто старинен чар не се е изгубил въпреки стичащите се тук тълпи през пиковия сезон. Типично френско селце, вдъхновило с красивата си природа множество артисти, поети и художници, сред които Джакомети, Миро, Калдер, Матис и Кандински, чиито произведения живеят тук за постоянно\r\nОтпътуваме за Кан (25 км), където с пешеходната обиколка ще посетим двукилометровия булевард Кроазет, който със своите палми и тропическа растителност е като изваден от Холивуд. На този булевард се намира и хотел Карлтън, където отсядат и световно известните личности по време на Филмовият фестивал.\r\nПродължаваме към Сен Тропе (88 км), който е един от най-известните курорти за почивка и е любимата дестинация на хиляди туристи за заслужен отдих. Прекрасните плажове на Сен Тропе придават на града неповторим чар. Всяка година в началото на Октомври се провежда и традиционната международна регата", 25, "Сен Пол дьо Ванс + Кан и Сен Тропе", 47, 130m },
                    { 23, "Отпътуване от хотела около 08:00 часа към Княжество Монако - перлата на Лазурния бряг, която предлага исторически и културни забележителности, тропическа растителност и безброй мероприятия - всичко създадено с цел да доставя удоволствие на многобройните туристи. Дворецът на фамилия Грималди - основатели на Княжеството, които превръщат миниатюрната държава в едно от най-проспериращите места в света и го управляват и до днес; Катедралата, където са погребани членове на фамилия Грималди. Възможност за посещение на Океанографския музей на Жак-Ив Кусто, представящ огромна колекция от морска флора и фауна, модели на изследователски кораби, аквариум с повече от 4000 представители на средиземноморската и тропическата екосистема\r\nПродължаваме към Монте Карло, квартал на Монако, един от най - богатите. Някога хората са го смятали за столица на Монако. В Монте Карло се намира най-известната писта на Формула 1. Състезанието преминава по улиците на града. Най-известните участъци от пистата са завоя „Фибата“ и „Тунела“. Днес Монте Карло освен като символ на Формула едно се слави и като туристическа дестинация. В града има много интересни забележителности, сред които са Катедралата на Монако, Музеят на Наполеон и Дворецът на принца на Монако. Известна атракция е и Големият Театър на Монте Карло – опера и балетна къща, комплексът от казина.\r\nПоследна наша спирка ще е Ментон, смятан за едно от най-очарователните и живописни места по Ривиерата, поради което е наречен \"Перлата на Франция\". Старият средновековен град на Мантон мигновено става любим на туристите със своите извити тесни улички, по които светят фенери. Звучи романтично, нали? Освен тях, силно впечатление правят великолепните градини в града, като една от най-посещаваните е Вал Рахме, създадена от сър Пърси Радклиф в чест на любимата му съпруга. Друга впечатляваща градина е Сере де ла Мадоне, дело на известния градинар Лорънс Джонстън", 25, "Монако и Монте Карло", 48, 140m },
                    { 24, "Пешеходна обиколка с  екскурзовод на български език: посещение на   Латинския квартал - остров  Ла Сите, Нотр Дам, Съдебната палата, Сорбоната, Пантеона, Люксембургската градина с Двореца, крепостта Консиержери, разходка с панорамно корабче по Сена, посещение на Айфеловата кула, Марсово поле", 15, "Bonjour Paris", 51, 110m },
                    { 25, "Посещение на операта „Гарние”, площад „Вандом” с  колона на Наполеон, ул. „Риволи”, Лувъра, градините на двореца „Тюйлери”, площад „Конкорд”, Парламента, Домa на инвалидите с гроба на Наполеон, мостa „Александър III”,  Триумфалната арка, Шан-з-Елизепосещение на операта „Гарние”, площад „Вандом” с  колона на Наполеон, ул. „Риволи”, Лувъра, градините на двореца „Тюйлери”, площад „Конкорд”, Парламента, Домa на инвалидите с гроба на Наполеон, мостa „Александър III”,  Триумфалната арка, Шан-з-Елизе", 20, "Пешеходна обиколка", 52, 130m },
                    { 26, "Целодневна екскурзия Шедьоврите на Гауди – световно наследство под закрилата на ЮНЕСКО", 15, "Шедьоврите на Гауди", 56, 130m },
                    { 27, "Екскурзия до Абатство Монсерат с Черната Мадона ", 15, "Абатство Монсерат с Черната Мадона", 57, 90m },
                    { 28, "Потопете се в историята на древния град Картахена, вървейки по неговите улици, по които в миналото са преминали цивилизациите на Картахенците, Римляните и Византийците и са оставили своя отпечатък  в историята на това място. Отпътуване сутринта за Картахена. Разглеждане на пристанището, паметника на героите от Кавие, площада на общината и реновирания наскоро дворец. Спускане надолу по главната улица за разглеждане на \"Гранд Хотел\" и други впечатляващи сгради като \"Ла каса Сервантес\" и сградата на казиното. По пътя за Римския театър се минава покрай църквата \"Санта Мария ла Виеха\". Римският театър датира от първи век пр. Хр. До него могат да се видят останките от стара катедрала, бомбардирана по време на Гражданската война. Накрая разглеждане на Църквата на благотворителността с патронния светец на града. По желание има възможност за изкачване с панорамен лифт над града (цена около 1 евро), за да се видят прекрасните пейзажи, които се откриват", 25, "Полудневна екскурзия до Картахена", 60, 100m },
                    { 29, "Посещение на най-голямата забележителност – катедралата в Мурсия, построена върху основите на древна джамия, където могат да се видят различни художествени стилове – от готика до неокласицизъм. Разглеждане на църквата \"Сан Хуан де Диос\", разположена на площад в стария град. Екскурзията завършва с посещение на Музея на Салсийо, където могат да се видят най-големите и впечатляващи колекции от работата на великия бароков скулптор от Мурсия", 20, "Полудневна екскурзия до Мурсия", 61, 80m },
                    { 30, "Както и да го наречем, той определено се откроява с множеството архитектурни паметници – комбинация от средновековен, ренесансов и бароков стил. От палеолита до днес град Лорка е бил дом на различни култури, всяка от които е оставила своя отпечатък в историята на града. Разходката ще ни отведе през емблематичния площад \"Испания\" с катедралата \"Свети Патрик\" от 18-ти век, съдебната палата и кметството. Продължаваме към Археологическия музей, житницата от 16-ти век, църква \"Свети Франциск\" и бароковия дворец \"Гевара\" (разглеждане отвън). Най-впечатляващ обаче е средновековният замък на Лорка (Крепостта на слънцето), който се издига на хълма над града. Екскурзията до Лорка е като машина на времето, която ни връща назад в историческото минало чрез средновековните улички, архитектурните шедьоври и градската атмосфера", 25, "Полудневна екскурзия до Лорка", 62, 110m },
                    { 31, "Кратко пътуване с автобус и плаване с малко корабче (около 30 мин.) ще ви отведат до остров Табарка - най- малкият населен остров на испанското средиземноморие. До края на XVIII век берберски пирати го използват като отправна точка при набезите си към брега на материка, но през 1770 крал Карлос III заселва тук няколко генуезки фамилии, с което променя съдбата на острова. Днес Табарка е исторически и морски резерват, но и защитена зона за птиците и място с множество ендемични видове. Предпочитана за туристите е атмосферата на укрепения град Сан Педро и Сан Пабло, със запазените крепостни стени и порти, главната улица \"Mayor\", чаровни малки ресторанти и магазинчета. За край на разходката можете да опитате местната кухня под сянката на някоя палма или да направите плаж на брега", 20, "Полудневна екскурзия до остров Табарка", 63, 100m },
                    { 32, "Туристическа програма във Валенсия – третият по големина испански град, съхранил хармонията на средиземноморските и испано-арабските традиции. Панорамна обиколка: архитектурно-културният комплекс \"Град на изкуствата и науките\", дело на архитекта Сантяго Калатрава и включващ впечатляващите Л’Емисферик, Музей на науките, Опера, Л’Осеанографик (най-големият аквариум в Европа); пешеходна разходка в историческият център: Арената - една от най-големите в Испания, централният площад с Кметството и Историческият музей на града, Копринената борса - шедьовър на валенсианския готически стил, включен в списъка на ЮНЕСКО за Световно културно наследство, Катедралата, строена между 1252 г. и 1482 г. върху основите на по-стара джамия; Торес де Серанoс - една от запазените средновековни порти и сградата на валенсианското правителство. Свободно време", 30, "Целодневна екскурзия до Валенсия", 64, 150m },
                    { 33, "Градът очарова посетителите си с малки, тесни улички, внушителни сгради и паркове с портокалови и лимонови дръвчета. Пешеходна  разходка: парламентът, църквата \"Санта Каталина\", катедралата на Валенсия, Музеят на фаите. Свободно време в историческия квартал Кармен с типични тесни улички с много магазини, ресторанти и кафенета", 25, "Целодневна екскурзия до Валенсия", 68, 140m },
                    { 34, "Програмата включва - транспорт с автобус, екскурзоводско обслужване на български език, панорамен тур на Стария град, базиликата Санта Мария, Кулата Калхора, двореца Алтимира, Арабските бани. Елче е разположен на двата бряга на река Виналопо и е едно от най-старите населени места на Иберийския полуостров. Елче е обявен за най-добър европейски град за отглеждане на палми. Тук има ботаническа градина с всички видове палми, които растат на Земята, както и цитрусови дървета, кактуси и бамбук. Друга голяма забележителност на града е \"Мистерията на Елче\" - традиционен средновековен празник, включен в Списъка на ЮНЕСКО като културен шедьовър", 25, "Полудневна екскурзия до Елче", 69, 110m },
                    { 35, "Планинско селце, основано от маврите, разположено на 600 м. надморска височина, сгушено на самотно, но много красиво място. Красиви замъци се издигат между гранитни скали, сливащи се в едно със заобикалящата ги природа. Преди да пристигнете в долината на Гуадалест, пътувайки по планински криволичещи пътища, ще минете през няколко други очарователни малки селца. Едно от тях е Ла Нуция, с великолепна гледка към Средиземно море, така и към заобикалящите го планини. Фотопауза в красивото малко селце Полоп и посещение на магазин за типични местни продукти като мед, плодове, вина", 20, "Полудневна екскурзия до Гуадалест", 70, 100m },
                    { 36, "Вечерно фламенко шоу", 10, "Вечерно фламенко шоу", 71, 70m },
                    { 37, "Градът очарова посетителите си с малки, тесни улички, внушителни сгради и паркове с портокалови и лимонови дръвчета. Пешеходна  разходка: парламентът, църквата \"Санта Каталина\", катедралата на Валенсия, Музеят на фаите. Свободно време в историческия квартал Кармен с типични тесни улички с много магазини, ресторанти и кафенета", 25, "Целодневна екскурзия до Валенсия", 76, 140m },
                    { 38, "Програмата включва - транспорт с автобус, екскурзоводско обслужване на български език, панорамен тур на Стария град, базиликата Санта Мария, Кулата Калхора, двореца Алтимира, Арабските бани. Елче е разположен на двата бряга на река Виналопо и е едно от най-старите населени места на Иберийския полуостров. Елче е обявен за най-добър европейски град за отглеждане на палми. Тук има ботаническа градина с всички видове палми, които растат на Земята, както и цитрусови дървета, кактуси и бамбук. Друга голяма забележителност на града е \"Мистерията на Елче\" - традиционен средновековен празник, включен в Списъка на ЮНЕСКО като културен шедьовър", 25, "Полудневна екскурзия до Елче", 77, 110m },
                    { 39, "Планинско селце, основано от маврите, разположено на 600 м. надморска височина, сгушено на самотно, но много красиво място. Красиви замъци се издигат между гранитни скали, сливащи се в едно със заобикалящата ги природа. Преди да пристигнете в долината на Гуадалест, пътувайки по планински криволичещи пътища, ще минете през няколко други очарователни малки селца. Едно от тях е Ла Нуция, с великолепна гледка към Средиземно море, така и към заобикалящите го планини. Фотопауза в красивото малко селце Полоп и посещение на магазин за типични местни продукти като мед, плодове, вина", 20, "Полудневна екскурзия до Гуадалест", 78, 100m },
                    { 40, "Вечерно фламенко шоу", 10, "Вечерно фламенко шоу", 79, 70m },
                    { 41, "Целодневна екскурзия до остров Хиос. След закуска ще преминем с ферибот (40 мин) до остров Хиос (Гърция) - пети по големина от гръцките острови. Добре дошли в Хиос - скрито съкровище в Егейско море, чакащо своите откриватели. Ароматен и гостоприемен през цялата година, Хиос е своеобразна палитра от картини и преживявания. Ще започнем с Пирги - най-голямото и красиво селище след столицата Хиос (Хора). Това изумително кътче може да послужи за вдъхновение на художник или като декор за нетрадиционен филм. Къщите са украсени от горе до долу с рисувани елементи на животни, цветя и геометрични фигури. Ефекта е едновременно деликатен и зашеметяващ. Ще се отправим към манастира „Неа Мони“ – най-важният паметник на острова, включен в списъка на ЮНЕСКО за световното културно наследство. Построен през 11-ти век от византийския император Константин IX Мономах, той е един от най-красивите и стари манастири в Гърция. Разположен на хълм, сгушен сред кипарисови и маслинови дървета, той е пример за прекрасната византийската архитектура и тук се намират световноизвестните зашеметяващи мозайки. Ще продължим към столицата на острова. Ще разгледаме византийската крепост, стария квартал, площад Фруриу, църквата „Агиос Георгиос“ и търговския квартал", 25, "Целодневна екскурзия до Остров Хиос", 110, 170m },
                    { 42, "Екскурзия до Измир. Днес ще посетим забележителния съвременен град Измир или древна Смирна. Измир е третият по големина град в Турция и един от най-големите търговски центрове в страната, благодарение на ключовото географско разположение на брега на Егейско море. Градът е едно от най-старите селища в Средиземноморския басейн и съществува повече от 3500 години. Древна Смирна е била една от най-развитите култури, сравнима дори с Троя. Апогея в своето развитие градът бележи между 650 г. до 545 г. пр. Хр. По време на нашата обиколка с местен екскурзовод ще разгледате Агората на хълма Кадифекале, Етнографския музей, Асансьорът на Измир – построен от местен жител през 1907 г. и някога задвижван със силата на водата. Днес той е електрифициран и предоставя на посетителите прекрасна панорамна гледка и възможност за романтичен обяд или вечеря в ресторанта на върха. Ще посетите и площад „Конак“, на който величествено се извисява Часовниковата кула \"Сахат Кулеси\". Тя е красива мраморна кула, висока 25 метра и пищно украсена и декорирана. Построена е от френски архитект Пере и е и в завършена за 25-годишнината от качването на престола на Абдулхамид II през 1901 г. Свободно време на колоритният пазар Кемералтъ", 20, "Целодневна екскурзия до Измир", 112, 130m }
                });

            migrationBuilder.InsertData(
                table: "Activities",
                columns: new[] { "Id", "Description", "MinPeopleNeeded", "Name", "OrganizedOfferDayId", "Price" },
                values: new object[,]
                {
                    { 43, "Райското градче Алачатъ е разположено само на 9.5 км от Чешме. Това място кара сетивата на всеки посетител да ликуват, а сърцето му да бие учестено. Алачатъ е турски град с гръцка история, който днес размива границите между двете. Това любимо както на чуждестранните туристи, така и на местните жители, място, предлага на своите посетители слънчеви дни на зашеметяващите плажове, оживени нощи в баровете и ресторантите и мързеливи разходки по очарователни, сенчести калдъръмени улици. Докато се разхождате из града, наистина се чувствате като в Гърция. Старите каменни къщи са красиво реставрирани, а боядисаните в блестящи, ярки цветове врати и прозоречни капаци са увенчани елегантно от разцъфнали бугенвилии. Не пропускайте да се разходите и до вятърните мелници от XIX век, които бдят над града", 20, "Полудневна екскурзия до Алачатъ", 114, 100m },
                    { 44, "Около 22.00 ч. взимане от хотела, 22.30 ч. пристигане в ресторанта, около 00.30 - 01.00 ч. връщане в хотела", 10, "Фадо шоу с включени 2 напитки", 117, 60m },
                    { 45, "Ден, през който ще посетите едни от най-известните исторически места в Португалия. Забравете настоящето и се върнете назад във времето в село Обидуш, заобиколено от крепостните стени, зад които се намират традиционни бели къщи и малки търговски улички, които водят към замъка. Отпътуване за Назаре, който в миналото е бил малко рибарско селце, а в наши дни е известен не само с риболова, но и с хубавите си плажове, прекрасната кухня и уникалните местни народни носии. Посещение на Фатима – център на католическата вяра и дестинация за поклонници от цял свят", 25, "Целодневна екскурзия до Обидуш, Назаре и Фатима", 118, 120m },
                    { 46, "Екскурзия до Синтра - приказен град на феи и добри вълшебници, лятна резиденция на португалското кралско семейство от 12 в., включена в списъка на ЮНЕСКО за световно културно наследство и нос Кабо да Рока - най-западната точка на Европейския континент, където \"свършва Земята и започва Морето\"", 20, "Екскурзия до Синтра и нос Кабо да Рока", 119, 130m },
                    { 47, "Пешеходна разходка - комплекса Цвингер, Оперния площад, Кралската катедрала, катедралата Фрауенкирхе. Свободно време и възможност за посещение на музеи - бароковия дворец \"Цвингер”, прочут с Музея на порцелана, Оръжейния музей и една от най-богатите картинни галерии в света, известна с шедьовъра на Рафаело – \"Сикстинската Мадона”. * Входните такси на музеите не са включени в цената на тура", 20, "Екскурзия до Дрезден", 121, 120m },
                    { 48, "Един от най-старите европейски балнео-курорти, известен с лечебния ефект на горещите си минерални извори, Бехеровката и стъкларските изделия", 20, "Екскурзия до Карлови Вари", 122, 110m },
                    { 49, "Ще тръгнем в 09.00 ч. сутринта, за да прекараме един ден сред типичната среда на аржентинските гаучоси. Тук  ще имате възможност да участвате или наблюдавате обяздване на коне, да наблюдавате шоу на гаучосите с танци и да опитате от  чая мате. Очаква ви вкусен обяд с местни специалитети  и напитки", 20, "Екскурзия до ранчо и среща с гаучоси в пампата", 127, 180m },
                    { 50, "Тръгване от хотела в 06.15 ч. В 08.00 ч. – отплаване с кораб от пристанището на Буенос Айрес. В 11.00 ч. - пристигане в Монтевидео. Следва туристическа обиколка: Площада на Независимостта, Сградата на Парламента, театър Солис, закрития пазар на Монтевидео. Обиколката продължава с посещение на аристократичния квартал Карраско, Крайбрежния булевард с хубавите плажове, откъдето имате възможност да се наслаждавате на панорамата на града. В 16.00 ч.- посещение на шопинг центъра “Пунта Каретас”. В 17.00 ч.- трансфер до пристанището. В 19.00 ч. – отпътуване за Буенос Айрес", 35, "Еднодневна екскурзия с ферибот до Монтевидео", 128, 210m },
                    { 51, "Организирано посещение на един от най-ярките нощни клубове Rio Scenarium, където ще се насладите на еклектичната атмосфера, ще пиете кайпириня и ще може да потанцувате под горещите латино ритми", 15, "Посещение на нощен клуб Rio Scenarium", 149, 120m },
                    { 52, "Ще разгледаме Музея на съвременното изкуство. Футуристичната сграда е завършена през 1996 г. и често я наричат „космическо творение“ и „летяща чиния“. Едни от най-ценните и незабравими „експонати“ вътре са отраженията на Захарната глава и на Корковадо в стъклената фасада. Крепостта Санта Круз ще ни разкрие своите тайни и допълнително ще ни омагьоса с невероятните гледки към Рио. Тази крепост е от 1555 г. и е основното фортификационно съоръжение в залива, привличаща и до днес хиляди търсачи на история и допълваща знанията им за живота и отбраната в колониалната и имперската епохи. Днес Санта Круз е действащо съоръжение и се охранява от щаба на Артилерийската дивизия. Включен обяд в местен ресторант", 25, "Посещение на съседния град Нитерой", 150, 140m },
                    { 53, "Тук ще наблегнете на първокласната бразилска скара и ще имате възможност да опитате традиционни деликатеси и многобройните местни салати, основни ястия и десерти", 20, "Фолклорно шоу в ресторант Рафаин Катаратас", 151, 170m },
                    { 54, "Площад Тиенанмън е един от най-впечатляващите и големи площади в света, намиращ се в центъра на Пекин и способен да побере над един милион души. Площадът носи името на вратата „Тиенанмън“ (в буквален превод „Вратата на небесното спокойствие“), построена в северната част на площада, която го отделя от Забранения град. Тук се намира мавзолеят на видния китайски политик Мао Дзъдун. Следва посещение на Забранения град, където ще се впечатлите от залите и градините на най-голямата древна дворцова структура в света. Това е най-добре запазеният императорски дворец в Китай и място с голямо историческо значение (затворен всеки понеделник). Градът получава името си, защото дворцовият комплекс е бил недостъпен за обикновените китайци. Всеки, който е бил хванат да нахлува в Забранения град без разрешение, бива подлоган на строго наказание, включително екзекуция. Изключителността на Забранения град имала за цел да подчертае божествения и върховен статут на императора като син на небето. Храмът на Небето представлява даоистки комплекс, състоящ се от храмови сгради. Разположен е на мраморна тераса в южната част на Пекин в парка \"Тиантан\". Построен е на три етажа, над които се издигат конусовидни покриви, направени от над 50 000 тъмносини глазирани керемиди и е най-добре запазилият се архитектурен паметник от династията Мин. Тук императорите са идвали, за да се молят на боговете за милост и за добра реколта. Церемонията за почитането на небето била най-специалната дейност на императорите от династият Мин и Цин- нещо, което обикновените хора нямат право да извършат", 25, "Целодневна екскурзия до площад Тиенанмън, Забранения град и „Храма на небето“", 176, 140m },
                    { 55, "Juyongguan е един от трите най-известни маршрути по Великата китайска стена, заедно с Jiayuguan и Shanhaiguan. Намира се на 75 км северозападно от Пекин и минава през уникална планинска природа. Juyongguan е строен през 770-475 г. пр.н.е. и има дължина 2484 мили. Изкачването до върха е невероятно. Тази част от стената се състои от 14 високи и стръмни наблюдателни кули, които осигуряват прекрасна гледка към хълмовете. На връщане ще се отправите към парка Олимпия и Националния стадион в Пекин, наричан „Птиче гнездо“, заради футуристичния си дизайн – едно от най-внушителните съоръжения в Китай, където ще имате фото пауза", 20, "Посещение на Великата китайска стена", 177, 130m },
                    { 56, "Сградите и дворовете на Летния дворец са красиво декорирани и заредени с много история. На негова територия се намира най-добре запазената и най-голямата императорска градина, съществуваща в Китай. Ще направите разходка с лодка до Хълма на дълголетието (предлага се на място) \r\nСледва посещение на храма „Yonghe Temple“ или Храм Лама. Храмът Лама е един от най-колоритните и оживени храмове в Пекин. Известен със своите извити покриви, страхотни стенописи, великолепни декоративни арки, гоблени, огледала и тантрически статуи, смесващи се в плътни облаци тамян. Това е най-големият будистки манастир извън Тибет, който е бил построен като имение за император Йончжън от династията Цин, когато той е бил принц", 25, "Посещение на Летния дворец и Храма на Лама „Yonghe Temple“ ", 178, 135m },
                    { 57, "Островът е най-посещаваната градска атракция, считан за прародител на Сингапурските паркове – с музеи, аквариуми, паркове, алеи за разходка и езда, невероятни плажове, ресторанти и барове. С автобус имате възможност да разгледате острова и да спирате при всяка атракция: статуята на Мерлиона, който е полу-риба/полу-лъв и е символът на Сингапур, Аквариума, Делфинариума, където имате възможност да видите шоуто на делфините и др. Свободно време с възможност за плаж. Вечерта – посещение на шоуто ”Светлина и звук“, където танцът на цветните фонтани, създаден с най-модерната техника ще Ви достави невероятно удоволствие", 25, "Полудневна екскурзия до остров Сентоса", 184, 120m },
                    { 58, "Ако не обичате да плувате, но желаете да разгледате вълшебния свят под повърхността на водата, то задължително се възползвайте от екскурзията с туристическата подводница Submarine. Подводницата се спуска на 25 метра дълбочина под водата, сред цветовете на Червено море, където за един час ще може да се насладите на изобилие от красиви корали и множество морски рибни видове. Ще се запознаете отблизо с естествената водна среда на едни от най-атрактивните морски обитатели. Продължителност около 3 часа", 15, "Полудневна екскурзия подводница Submarine", 198, 140m },
                    { 59, "Хиляди туристи от целия свят всяка година избират Луксор за своя ваканционна дестинация, за да се насладят на тези паметници на историята и архитектурата. Луксор е идеалното място и за онези, които са решили да посетят Горен Египет. В Луксор е и крайната спирка на корабните пътешествия по река Нил. Отпътуване от хотела около 04:30 ч. за Луксор – древната столица на египетските фараони. Посещение на Карнак - най-големият религиозен комплекс в света, който заема площ от 840 декара. Той е бил известен на древните египтяни като Ипет-Исут (най-святото място) и представлява град от храмове, обособен в 3 зони, посветени на върховният бог Амон, бог Монту и богинята Мут. Най-значителното здание в комплекса е храмът на Амон Ра – истински архитектурен шедьовър, включващ огромна колонна зала, различни храмови помещения и 10 пилона, най-големият от които е 113 м. Разглеждане на Алеята на сфинксовете, която свързва Луксорския и Карнакския храм, с общата дължина около 5 км. По алеята се извършвало шествието на фараоните до карнакския храм. Отпътуване към Долината на царете - пустинна равнина, заобиколена от стръмни хълмове. Разположена е на западния бряг на Нил, близо до град Тива. Тук се намира прочутата гробница на фараона Тутанкамон – една от 62-те открити гробници досега. Посещение на изумителният храм на Хатшепсут – първата жена фараон, управлявала Египет две мирни десетилетия Разглеждане Колосите на Мемнон – две масивни каменни статуи, които представят фараона Аменхотеп III в седнало положение, с ръце на коленете и поглед, насочен на изток към реката и изгряващото слънце. Посещение на местна фабрика за алабастър и музея на папируса", 20, "Целодневна екскурзия Луксор", 199, 160m },
                    { 60, "Отпътуване от хотела към 13 ч. от хотела. Ще можете да видите същността на ландшафта в пустинята – долините и красивите пясъчни планини с червеникавият им оттенък. Запознанството Ви с Египет ще е непълно, ако пропуснете пътуване в пустинята на сафари. Ще имате възможност да се сдобиете с неповторими впечатления от препускането с джипове по дюните, екстремното шофиране на квадроцикли и двуместни бъгита. Ще яздите камила и ще се запознаете отблизо с живота в пустинята, ще посетите малък зоопарк и терариум, ще се насладите на фолклорно шоу (танура, ориенталски танци, огнено шоу). Продължителност на екскурзията около 8 часа", 20, "Целодневна екскурзия Super safary", 200, 110m },
                    { 61, "Екскурзия до Пирамидите – едно от Седемте чудеса на Древния свят и Сфинкса в Гиза – най-големият, най-старият и най-известният от безбройните запазени сфинксове в Египет. Отпътуване от хотела около 02:00 ч. Пирамидите в Гиза от дълго време са най-посещаваната атракция около Кайро. От времето на тяхното изграждане пирамидите в Гиза въплъщават древността, мистерията – и дават повод за невероятни хипотези. Пирамидата на Хеопс е най-старата в Гиза и най-голямата в света, изградена ок. 2500 г. пр.н.е. от близо 2,3 милиона варовикови блокове, тежащи средно по 2,75 тона и придвижвани от 100 000 роби. Трите по-малки пирамиди в съседство принадлежат на Хеопсовите царици или сестри. Посещение на Египетския музей, който пази най-голямата колекция с антики от времето на фараоните в света. В музея има 160 000 артефакти, покриващи 5000 годишна история", 20, "Целодневна екскурзия Кайро и Пирамидите в Гиза", 201, 130m },
                    { 62, "Едно от най-предпочитаните места за гмуркане в света се намира в Египет. В подводния резерват, между разноцветни коралови рифове (тук виреят над 150 вида корали), можете да наблюдавате живота на хиляди морски обитатели. Червено море е описвано като „коридор на чудесата“за гмуркане. Отпътуване от хотела към 8 ч. сутринта. Подводният свят е очарователен, пълен с живот и цветове, непроучен и загадъчен и затова е още по-привлекателен. Гмуркането е начин да се опознае този свят, удивително съчетаващ в себе си нови впечатления, наслада от богатството на подводния свят. Морето е известно със своята разнообразна фауна и впечатляващата чистота на водата, с видимост, която често превишава 45 метра. Голяма част от уникалността на гмуркането в Червено море се дължи на впечатляващото припокриване на ярката красота на пустинята и истинската райска градина във водите на Червено море. Около 10 процента от животинските видове в Червено море не се срещат никъде другаде на Земята. Ще имате възможност да се насладите на гмуркане, прекрасна разходка с лодка и риболов и да наблюдавате невороятният и богатит животински свят на Червено море", 15, "Полудневна екскурзия – Дайвинг в красивите рифове на Червено Море", 202, 135m },
                    { 63, "Едно от най-популярните места за екскурзия с лодка и шнорхелинг в Хургада. Екскурзията започва около 8:00 ч. и включва морска разходка с яхта с възможност да се насладите на красотата на един от прекрасните острови и съкровища на кораловия риф, белият пясък и слънчевите лъчи на Червено море. Слизане на плажа на острова за плуване и релакс. Обяд на яхтата. Едно от най-прекрасните места за гмуркане в целия свят е в околностите на острова. Две спирания за гмуркане в близост до коралови рифове. Като за тези, които не са любители на гмуркането няма да им е трудно също да видят и да се полюбуват на красивите морски видове, тъй като водата в Червено море е кристално бистра и чиста", 20, "Целодневна екскурзия Orange Island и шнорхелинг", 203, 140m },
                    { 64, "Едно вълнуващо плаване, спектакъл със пиратски танци и костюми на борда на кораб, на който всеки е мечтал да бъде като дете, вълнуващо се и готово да посрещтне това морско приключение. Върнете се назад във времето, когато сте мечтали да се качите на подобен кораб, да бъдете част от пиратско приключение, да покорявате нови брегове, да търсите скрити съкровища…", 15, "Разходка с пиратски кораб (полудневна)", 233, 80m },
                    { 65, "Екскурзията започва с посещение на Кайруан - най-святото за мюсюлманите място в Магреб и 4-ят по святост град за исляма. Ще разгледаме Окба джамия / Голямата джамия, издигната заедно с града през 670 г., и ще се отдадем на шопинг, а след това продължаваме обиколката на Кайруан с посещение на водните резервоари на града – построени преди повече от 1000 години. Продължаваме нашият маршрут до Ел Джем , където се намира най-добре запазения и трети в света амфитеатър. Това е един от най-впечатляващите паметници на световната история и именно той е послужил като декор за заснемането на незабравимия “Гладиатор”. Вечерта се връщаме в хотела", 20, "Кайруан и Ел Джем (целодневна екскурзия)", 234, 110m },
                    { 66, "Friguia Park е частна зоологическа градина в Тунис, открита на 11 ноември 2000 г. близо до град Буфича. Зоологическата градина на Фригия се намира между градовете Енфида и Буфиша. Заема площ от 360 000 кв. м, за сравнение Московският зоопарк (вторият по големина зоопарк в Русия) заема 220 000 кв. м. В зоопарка са представени 61 вида от фауната на африканския континент. Общо зоологическата градина съдържа 420 животни. Паркът Фригия е първият парк за диви животни в Тунис, където всички животни се държат в относителна свобода, което позволява да се запазят естествените инстинкти и социалното поведение на представения вид. В допълнение към загражденията за животни в парка Фригия можете да видите шоу на морски лъвове, етническо шоу на зулусите, а през 2010 г. в парка беше открит първият делфинариум в Тунис", 15, "Полудневна екскурзия - Фригиа зоопарк", 235, 75m }
                });
        }

        protected override void Down(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.DeleteData(
                table: "Activities",
                keyColumn: "Id",
                keyValue: 1);

            migrationBuilder.DeleteData(
                table: "Activities",
                keyColumn: "Id",
                keyValue: 2);

            migrationBuilder.DeleteData(
                table: "Activities",
                keyColumn: "Id",
                keyValue: 3);

            migrationBuilder.DeleteData(
                table: "Activities",
                keyColumn: "Id",
                keyValue: 4);

            migrationBuilder.DeleteData(
                table: "Activities",
                keyColumn: "Id",
                keyValue: 5);

            migrationBuilder.DeleteData(
                table: "Activities",
                keyColumn: "Id",
                keyValue: 6);

            migrationBuilder.DeleteData(
                table: "Activities",
                keyColumn: "Id",
                keyValue: 7);

            migrationBuilder.DeleteData(
                table: "Activities",
                keyColumn: "Id",
                keyValue: 8);

            migrationBuilder.DeleteData(
                table: "Activities",
                keyColumn: "Id",
                keyValue: 9);

            migrationBuilder.DeleteData(
                table: "Activities",
                keyColumn: "Id",
                keyValue: 10);

            migrationBuilder.DeleteData(
                table: "Activities",
                keyColumn: "Id",
                keyValue: 11);

            migrationBuilder.DeleteData(
                table: "Activities",
                keyColumn: "Id",
                keyValue: 12);

            migrationBuilder.DeleteData(
                table: "Activities",
                keyColumn: "Id",
                keyValue: 13);

            migrationBuilder.DeleteData(
                table: "Activities",
                keyColumn: "Id",
                keyValue: 14);

            migrationBuilder.DeleteData(
                table: "Activities",
                keyColumn: "Id",
                keyValue: 15);

            migrationBuilder.DeleteData(
                table: "Activities",
                keyColumn: "Id",
                keyValue: 16);

            migrationBuilder.DeleteData(
                table: "Activities",
                keyColumn: "Id",
                keyValue: 17);

            migrationBuilder.DeleteData(
                table: "Activities",
                keyColumn: "Id",
                keyValue: 18);

            migrationBuilder.DeleteData(
                table: "Activities",
                keyColumn: "Id",
                keyValue: 19);

            migrationBuilder.DeleteData(
                table: "Activities",
                keyColumn: "Id",
                keyValue: 20);

            migrationBuilder.DeleteData(
                table: "Activities",
                keyColumn: "Id",
                keyValue: 21);

            migrationBuilder.DeleteData(
                table: "Activities",
                keyColumn: "Id",
                keyValue: 22);

            migrationBuilder.DeleteData(
                table: "Activities",
                keyColumn: "Id",
                keyValue: 23);

            migrationBuilder.DeleteData(
                table: "Activities",
                keyColumn: "Id",
                keyValue: 24);

            migrationBuilder.DeleteData(
                table: "Activities",
                keyColumn: "Id",
                keyValue: 25);

            migrationBuilder.DeleteData(
                table: "Activities",
                keyColumn: "Id",
                keyValue: 26);

            migrationBuilder.DeleteData(
                table: "Activities",
                keyColumn: "Id",
                keyValue: 27);

            migrationBuilder.DeleteData(
                table: "Activities",
                keyColumn: "Id",
                keyValue: 28);

            migrationBuilder.DeleteData(
                table: "Activities",
                keyColumn: "Id",
                keyValue: 29);

            migrationBuilder.DeleteData(
                table: "Activities",
                keyColumn: "Id",
                keyValue: 30);

            migrationBuilder.DeleteData(
                table: "Activities",
                keyColumn: "Id",
                keyValue: 31);

            migrationBuilder.DeleteData(
                table: "Activities",
                keyColumn: "Id",
                keyValue: 32);

            migrationBuilder.DeleteData(
                table: "Activities",
                keyColumn: "Id",
                keyValue: 33);

            migrationBuilder.DeleteData(
                table: "Activities",
                keyColumn: "Id",
                keyValue: 34);

            migrationBuilder.DeleteData(
                table: "Activities",
                keyColumn: "Id",
                keyValue: 35);

            migrationBuilder.DeleteData(
                table: "Activities",
                keyColumn: "Id",
                keyValue: 36);

            migrationBuilder.DeleteData(
                table: "Activities",
                keyColumn: "Id",
                keyValue: 37);

            migrationBuilder.DeleteData(
                table: "Activities",
                keyColumn: "Id",
                keyValue: 38);

            migrationBuilder.DeleteData(
                table: "Activities",
                keyColumn: "Id",
                keyValue: 39);

            migrationBuilder.DeleteData(
                table: "Activities",
                keyColumn: "Id",
                keyValue: 40);

            migrationBuilder.DeleteData(
                table: "Activities",
                keyColumn: "Id",
                keyValue: 41);

            migrationBuilder.DeleteData(
                table: "Activities",
                keyColumn: "Id",
                keyValue: 42);

            migrationBuilder.DeleteData(
                table: "Activities",
                keyColumn: "Id",
                keyValue: 43);

            migrationBuilder.DeleteData(
                table: "Activities",
                keyColumn: "Id",
                keyValue: 44);

            migrationBuilder.DeleteData(
                table: "Activities",
                keyColumn: "Id",
                keyValue: 45);

            migrationBuilder.DeleteData(
                table: "Activities",
                keyColumn: "Id",
                keyValue: 46);

            migrationBuilder.DeleteData(
                table: "Activities",
                keyColumn: "Id",
                keyValue: 47);

            migrationBuilder.DeleteData(
                table: "Activities",
                keyColumn: "Id",
                keyValue: 48);

            migrationBuilder.DeleteData(
                table: "Activities",
                keyColumn: "Id",
                keyValue: 49);

            migrationBuilder.DeleteData(
                table: "Activities",
                keyColumn: "Id",
                keyValue: 50);

            migrationBuilder.DeleteData(
                table: "Activities",
                keyColumn: "Id",
                keyValue: 51);

            migrationBuilder.DeleteData(
                table: "Activities",
                keyColumn: "Id",
                keyValue: 52);

            migrationBuilder.DeleteData(
                table: "Activities",
                keyColumn: "Id",
                keyValue: 53);

            migrationBuilder.DeleteData(
                table: "Activities",
                keyColumn: "Id",
                keyValue: 54);

            migrationBuilder.DeleteData(
                table: "Activities",
                keyColumn: "Id",
                keyValue: 55);

            migrationBuilder.DeleteData(
                table: "Activities",
                keyColumn: "Id",
                keyValue: 56);

            migrationBuilder.DeleteData(
                table: "Activities",
                keyColumn: "Id",
                keyValue: 57);

            migrationBuilder.DeleteData(
                table: "Activities",
                keyColumn: "Id",
                keyValue: 58);

            migrationBuilder.DeleteData(
                table: "Activities",
                keyColumn: "Id",
                keyValue: 59);

            migrationBuilder.DeleteData(
                table: "Activities",
                keyColumn: "Id",
                keyValue: 60);

            migrationBuilder.DeleteData(
                table: "Activities",
                keyColumn: "Id",
                keyValue: 61);

            migrationBuilder.DeleteData(
                table: "Activities",
                keyColumn: "Id",
                keyValue: 62);

            migrationBuilder.DeleteData(
                table: "Activities",
                keyColumn: "Id",
                keyValue: 63);

            migrationBuilder.DeleteData(
                table: "Activities",
                keyColumn: "Id",
                keyValue: 64);

            migrationBuilder.DeleteData(
                table: "Activities",
                keyColumn: "Id",
                keyValue: 65);

            migrationBuilder.DeleteData(
                table: "Activities",
                keyColumn: "Id",
                keyValue: 66);

            migrationBuilder.DeleteData(
                table: "Countries",
                keyColumn: "Id",
                keyValue: 1);

            migrationBuilder.DeleteData(
                table: "CruiseDays",
                keyColumn: "Id",
                keyValue: 1);

            migrationBuilder.DeleteData(
                table: "CruiseDays",
                keyColumn: "Id",
                keyValue: 2);

            migrationBuilder.DeleteData(
                table: "CruiseDays",
                keyColumn: "Id",
                keyValue: 3);

            migrationBuilder.DeleteData(
                table: "CruiseDays",
                keyColumn: "Id",
                keyValue: 4);

            migrationBuilder.DeleteData(
                table: "CruiseDays",
                keyColumn: "Id",
                keyValue: 5);

            migrationBuilder.DeleteData(
                table: "CruiseDays",
                keyColumn: "Id",
                keyValue: 6);

            migrationBuilder.DeleteData(
                table: "CruiseDays",
                keyColumn: "Id",
                keyValue: 7);

            migrationBuilder.DeleteData(
                table: "CruiseDays",
                keyColumn: "Id",
                keyValue: 8);

            migrationBuilder.DeleteData(
                table: "CruiseDays",
                keyColumn: "Id",
                keyValue: 9);

            migrationBuilder.DeleteData(
                table: "CruiseDays",
                keyColumn: "Id",
                keyValue: 10);

            migrationBuilder.DeleteData(
                table: "CruiseDays",
                keyColumn: "Id",
                keyValue: 11);

            migrationBuilder.DeleteData(
                table: "CruiseDays",
                keyColumn: "Id",
                keyValue: 12);

            migrationBuilder.DeleteData(
                table: "CruiseDays",
                keyColumn: "Id",
                keyValue: 13);

            migrationBuilder.DeleteData(
                table: "CruiseDays",
                keyColumn: "Id",
                keyValue: 14);

            migrationBuilder.DeleteData(
                table: "CruiseDays",
                keyColumn: "Id",
                keyValue: 15);

            migrationBuilder.DeleteData(
                table: "CruiseDays",
                keyColumn: "Id",
                keyValue: 16);

            migrationBuilder.DeleteData(
                table: "CruiseDays",
                keyColumn: "Id",
                keyValue: 17);

            migrationBuilder.DeleteData(
                table: "CruiseDays",
                keyColumn: "Id",
                keyValue: 18);

            migrationBuilder.DeleteData(
                table: "CruiseDays",
                keyColumn: "Id",
                keyValue: 19);

            migrationBuilder.DeleteData(
                table: "CruiseDays",
                keyColumn: "Id",
                keyValue: 20);

            migrationBuilder.DeleteData(
                table: "CruiseDays",
                keyColumn: "Id",
                keyValue: 21);

            migrationBuilder.DeleteData(
                table: "CruiseDays",
                keyColumn: "Id",
                keyValue: 22);

            migrationBuilder.DeleteData(
                table: "CruiseDays",
                keyColumn: "Id",
                keyValue: 23);

            migrationBuilder.DeleteData(
                table: "CruiseRoomTypesCruisesPrices",
                keyColumns: new[] { "CruiseId", "CruiseRoomTypeId" },
                keyValues: new object[] { 1, 1 });

            migrationBuilder.DeleteData(
                table: "CruiseRoomTypesCruisesPrices",
                keyColumns: new[] { "CruiseId", "CruiseRoomTypeId" },
                keyValues: new object[] { 2, 1 });

            migrationBuilder.DeleteData(
                table: "CruiseRoomTypesCruisesPrices",
                keyColumns: new[] { "CruiseId", "CruiseRoomTypeId" },
                keyValues: new object[] { 3, 1 });

            migrationBuilder.DeleteData(
                table: "CruiseRoomTypesCruisesPrices",
                keyColumns: new[] { "CruiseId", "CruiseRoomTypeId" },
                keyValues: new object[] { 1, 2 });

            migrationBuilder.DeleteData(
                table: "CruiseRoomTypesCruisesPrices",
                keyColumns: new[] { "CruiseId", "CruiseRoomTypeId" },
                keyValues: new object[] { 2, 2 });

            migrationBuilder.DeleteData(
                table: "CruiseRoomTypesCruisesPrices",
                keyColumns: new[] { "CruiseId", "CruiseRoomTypeId" },
                keyValues: new object[] { 3, 2 });

            migrationBuilder.DeleteData(
                table: "CruiseRoomTypesCruisesPrices",
                keyColumns: new[] { "CruiseId", "CruiseRoomTypeId" },
                keyValues: new object[] { 1, 3 });

            migrationBuilder.DeleteData(
                table: "CruiseRoomTypesCruisesPrices",
                keyColumns: new[] { "CruiseId", "CruiseRoomTypeId" },
                keyValues: new object[] { 2, 3 });

            migrationBuilder.DeleteData(
                table: "CruiseRoomTypesCruisesPrices",
                keyColumns: new[] { "CruiseId", "CruiseRoomTypeId" },
                keyValues: new object[] { 3, 3 });

            migrationBuilder.DeleteData(
                table: "CruiseRoomTypesCruisesPrices",
                keyColumns: new[] { "CruiseId", "CruiseRoomTypeId" },
                keyValues: new object[] { 1, 4 });

            migrationBuilder.DeleteData(
                table: "CruiseRoomTypesCruisesPrices",
                keyColumns: new[] { "CruiseId", "CruiseRoomTypeId" },
                keyValues: new object[] { 2, 4 });

            migrationBuilder.DeleteData(
                table: "CruiseRoomTypesCruisesPrices",
                keyColumns: new[] { "CruiseId", "CruiseRoomTypeId" },
                keyValues: new object[] { 3, 4 });

            migrationBuilder.DeleteData(
                table: "CruisesPassByDestinations",
                keyColumns: new[] { "CruiseId", "PassByDestinationId" },
                keyValues: new object[] { 1, 1 });

            migrationBuilder.DeleteData(
                table: "CruisesPassByDestinations",
                keyColumns: new[] { "CruiseId", "PassByDestinationId" },
                keyValues: new object[] { 1, 2 });

            migrationBuilder.DeleteData(
                table: "CruisesPassByDestinations",
                keyColumns: new[] { "CruiseId", "PassByDestinationId" },
                keyValues: new object[] { 1, 3 });

            migrationBuilder.DeleteData(
                table: "CruisesPassByDestinations",
                keyColumns: new[] { "CruiseId", "PassByDestinationId" },
                keyValues: new object[] { 1, 4 });

            migrationBuilder.DeleteData(
                table: "CruisesPassByDestinations",
                keyColumns: new[] { "CruiseId", "PassByDestinationId" },
                keyValues: new object[] { 1, 5 });

            migrationBuilder.DeleteData(
                table: "CruisesPassByDestinations",
                keyColumns: new[] { "CruiseId", "PassByDestinationId" },
                keyValues: new object[] { 1, 6 });

            migrationBuilder.DeleteData(
                table: "CruisesPassByDestinations",
                keyColumns: new[] { "CruiseId", "PassByDestinationId" },
                keyValues: new object[] { 1, 7 });

            migrationBuilder.DeleteData(
                table: "CruisesPassByDestinations",
                keyColumns: new[] { "CruiseId", "PassByDestinationId" },
                keyValues: new object[] { 2, 8 });

            migrationBuilder.DeleteData(
                table: "CruisesPassByDestinations",
                keyColumns: new[] { "CruiseId", "PassByDestinationId" },
                keyValues: new object[] { 2, 9 });

            migrationBuilder.DeleteData(
                table: "CruisesPassByDestinations",
                keyColumns: new[] { "CruiseId", "PassByDestinationId" },
                keyValues: new object[] { 2, 10 });

            migrationBuilder.DeleteData(
                table: "CruisesPassByDestinations",
                keyColumns: new[] { "CruiseId", "PassByDestinationId" },
                keyValues: new object[] { 2, 11 });

            migrationBuilder.DeleteData(
                table: "CruisesPassByDestinations",
                keyColumns: new[] { "CruiseId", "PassByDestinationId" },
                keyValues: new object[] { 2, 12 });

            migrationBuilder.DeleteData(
                table: "CruisesPassByDestinations",
                keyColumns: new[] { "CruiseId", "PassByDestinationId" },
                keyValues: new object[] { 3, 13 });

            migrationBuilder.DeleteData(
                table: "CruisesPassByDestinations",
                keyColumns: new[] { "CruiseId", "PassByDestinationId" },
                keyValues: new object[] { 3, 14 });

            migrationBuilder.DeleteData(
                table: "CruisesPassByDestinations",
                keyColumns: new[] { "CruiseId", "PassByDestinationId" },
                keyValues: new object[] { 3, 15 });

            migrationBuilder.DeleteData(
                table: "CruisesPassByDestinations",
                keyColumns: new[] { "CruiseId", "PassByDestinationId" },
                keyValues: new object[] { 3, 16 });

            migrationBuilder.DeleteData(
                table: "CruisesPassByDestinations",
                keyColumns: new[] { "CruiseId", "PassByDestinationId" },
                keyValues: new object[] { 3, 17 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 1, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 1, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 1, 5 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 1, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 2, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 2, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 2, 5 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 2, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 3, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 3, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 3, 5 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 3, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 4, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 4, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 4, 3 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 4, 4 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 4, 5 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 4, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 5, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 5, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 5, 5 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 5, 9 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 5, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 6, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 6, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 6, 5 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 6, 9 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 6, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 7, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 7, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 7, 3 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 7, 4 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 7, 8 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 7, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 8, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 8, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 8, 5 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 8, 9 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 8, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 9, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 9, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 9, 5 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 9, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 10, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 10, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 10, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 11, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 11, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 11, 5 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 11, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 12, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 12, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 12, 5 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 12, 8 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 12, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 13, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 13, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 13, 5 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 13, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 14, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 14, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 14, 8 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 14, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 15, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 15, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 15, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 16, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 16, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 16, 8 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 16, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 17, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 17, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 17, 8 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 17, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 18, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 18, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 18, 5 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 18, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 19, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 19, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 19, 5 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 19, 9 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 19, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 20, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 20, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 20, 8 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 20, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 21, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 21, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 21, 8 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 21, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 22, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 22, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 22, 5 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 22, 6 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 22, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 23, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 23, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 23, 3 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 23, 4 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 23, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 24, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 24, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 24, 5 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 24, 8 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 24, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 25, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 25, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 25, 5 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 25, 6 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 25, 7 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 25, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 26, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 26, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 26, 5 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 26, 6 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 26, 7 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 26, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 27, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 27, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 27, 5 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 27, 6 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 27, 7 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 27, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 28, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 28, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 28, 5 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 28, 6 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 28, 7 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 28, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 29, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 29, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 29, 5 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 29, 6 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 29, 7 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 29, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 30, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 30, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 30, 5 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 30, 6 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 30, 7 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 30, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 31, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 31, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 31, 5 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 31, 6 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 31, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 32, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 32, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 32, 5 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 32, 6 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 32, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 33, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 33, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 33, 5 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 33, 6 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 33, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 34, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 34, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 34, 5 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 34, 8 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 34, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 35, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 35, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 35, 8 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 35, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 36, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 36, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 36, 8 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 36, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 37, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 37, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 37, 8 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 37, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 38, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 38, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 38, 8 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 38, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 39, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 39, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 39, 8 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 39, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 40, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 40, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 40, 8 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 40, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 41, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 41, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 41, 8 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 41, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 42, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 42, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 42, 8 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 42, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 43, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 43, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 43, 3 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 43, 4 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 43, 9 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 43, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 44, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 44, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 44, 3 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 44, 4 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 44, 9 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 44, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 45, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 45, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 45, 3 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 45, 4 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 45, 9 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 45, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 46, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 46, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 46, 5 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 46, 9 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 46, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 47, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 47, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 47, 5 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 47, 9 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 47, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 48, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 48, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 48, 5 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 48, 9 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 48, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 49, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 49, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 49, 5 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 49, 7 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 49, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 50, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 50, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 50, 5 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 50, 7 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 50, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 51, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 51, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 51, 5 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 51, 7 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 51, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 52, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 52, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 52, 5 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 52, 6 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 52, 8 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 52, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 53, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 53, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 53, 5 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 53, 6 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 53, 8 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 53, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 54, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 54, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 54, 5 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 54, 6 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 54, 8 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 54, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 55, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 55, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 55, 6 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 55, 7 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 55, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 56, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 56, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 56, 6 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 56, 7 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 56, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 57, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 57, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 57, 6 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 57, 7 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 57, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 58, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 58, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 58, 5 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 58, 7 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 58, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 59, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 59, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 59, 5 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 59, 7 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 59, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 60, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 60, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 60, 5 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 60, 7 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 60, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 61, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 61, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 61, 3 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 61, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 62, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 62, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 62, 3 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 62, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 63, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 63, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 63, 3 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 63, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 64, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 64, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 64, 4 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 64, 8 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 64, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 65, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 65, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 65, 4 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 65, 8 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 65, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 66, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 66, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 66, 4 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 66, 8 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 66, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 67, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 67, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 67, 5 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 67, 6 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 67, 7 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 67, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 68, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 68, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 68, 5 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 68, 6 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 68, 7 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 68, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 69, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 69, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 69, 5 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 69, 6 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 69, 7 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 69, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 70, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 70, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 70, 3 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 70, 4 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 70, 6 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 70, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 71, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 71, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 71, 3 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 71, 4 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 71, 6 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 71, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 72, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 72, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 72, 3 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 72, 4 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 72, 6 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 72, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 73, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 73, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 73, 3 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 73, 4 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 73, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 74, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 74, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 74, 3 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 74, 4 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 74, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 75, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 75, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 75, 3 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 75, 4 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 75, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 76, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 76, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 76, 3 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 76, 4 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 76, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 77, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 77, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 77, 3 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 77, 4 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 77, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 78, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 78, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 78, 3 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 78, 4 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 78, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 79, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 79, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 79, 3 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 79, 4 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 79, 6 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 79, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 80, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 80, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 80, 3 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 80, 4 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 80, 6 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 80, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 81, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 81, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 81, 3 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 81, 4 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 81, 6 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 81, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 82, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 82, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 82, 3 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 82, 4 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 82, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 83, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 83, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 83, 3 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 83, 4 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 83, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 84, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 84, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 84, 3 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 84, 4 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 84, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 85, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 85, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 85, 5 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 85, 8 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 85, 9 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 85, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 86, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 86, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 86, 5 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 86, 8 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 86, 9 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 86, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 87, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 87, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 87, 5 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 87, 8 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 87, 9 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 87, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 88, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 88, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 88, 3 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 88, 4 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 88, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 89, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 89, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 89, 3 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 89, 4 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 89, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 90, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 90, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 90, 3 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 90, 4 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 90, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 91, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 91, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 91, 3 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 91, 4 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 91, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 92, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 92, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 92, 3 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 92, 4 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 92, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 93, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 93, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 93, 3 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 93, 4 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 93, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 94, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 94, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 94, 3 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 94, 4 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 94, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 95, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 95, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 95, 3 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 95, 4 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 95, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 96, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 96, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 96, 3 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 96, 4 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 96, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 97, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 97, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 97, 3 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 97, 4 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 97, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 98, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 98, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 98, 3 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 98, 4 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 98, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 99, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 99, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 99, 3 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 99, 4 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 99, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 100, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 100, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 100, 3 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 100, 4 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 100, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 101, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 101, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 101, 3 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 101, 4 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 101, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 102, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 102, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 102, 3 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 102, 4 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 102, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 103, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 103, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 103, 3 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 103, 4 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 103, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 104, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 104, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 104, 3 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 104, 4 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 104, 10 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 105, 1 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 105, 2 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 105, 3 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 105, 4 });

            migrationBuilder.DeleteData(
                table: "HotelsRoomTypesPrices",
                keyColumns: new[] { "HotelId", "RoomTypeId" },
                keyValues: new object[] { 105, 10 });

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 1);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 4);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 5);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 6);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 13);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 14);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 18);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 19);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 20);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 22);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 23);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 24);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 25);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 29);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 30);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 31);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 32);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 33);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 34);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 35);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 36);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 37);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 38);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 45);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 46);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 49);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 50);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 53);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 54);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 55);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 58);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 59);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 65);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 66);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 67);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 72);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 73);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 74);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 75);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 80);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 81);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 82);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 83);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 84);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 85);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 86);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 87);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 88);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 89);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 90);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 91);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 92);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 93);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 94);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 95);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 96);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 97);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 98);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 99);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 100);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 101);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 102);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 103);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 104);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 105);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 106);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 107);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 108);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 109);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 111);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 113);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 115);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 116);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 120);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 123);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 124);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 125);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 126);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 129);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 130);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 131);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 132);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 133);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 134);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 135);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 136);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 137);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 138);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 139);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 140);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 141);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 142);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 143);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 144);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 145);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 146);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 147);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 148);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 152);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 153);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 154);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 155);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 156);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 157);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 158);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 159);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 160);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 161);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 162);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 163);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 164);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 165);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 166);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 167);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 168);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 169);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 170);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 171);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 172);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 173);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 174);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 175);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 179);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 180);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 181);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 182);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 183);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 185);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 186);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 187);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 188);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 189);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 190);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 191);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 192);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 193);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 194);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 195);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 196);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 197);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 204);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 205);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 206);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 207);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 208);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 209);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 210);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 211);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 212);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 213);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 214);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 215);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 216);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 217);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 218);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 219);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 220);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 221);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 222);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 223);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 224);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 225);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 226);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 227);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 228);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 229);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 230);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 231);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 232);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 236);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 237);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 238);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 239);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferStartAndEndDates",
                keyColumn: "Id",
                keyValue: 1);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferStartAndEndDates",
                keyColumn: "Id",
                keyValue: 2);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferStartAndEndDates",
                keyColumn: "Id",
                keyValue: 3);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferStartAndEndDates",
                keyColumn: "Id",
                keyValue: 4);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferStartAndEndDates",
                keyColumn: "Id",
                keyValue: 5);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferStartAndEndDates",
                keyColumn: "Id",
                keyValue: 6);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferStartAndEndDates",
                keyColumn: "Id",
                keyValue: 7);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferStartAndEndDates",
                keyColumn: "Id",
                keyValue: 8);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferStartAndEndDates",
                keyColumn: "Id",
                keyValue: 9);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferStartAndEndDates",
                keyColumn: "Id",
                keyValue: 10);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferStartAndEndDates",
                keyColumn: "Id",
                keyValue: 11);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferStartAndEndDates",
                keyColumn: "Id",
                keyValue: 12);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferStartAndEndDates",
                keyColumn: "Id",
                keyValue: 13);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferStartAndEndDates",
                keyColumn: "Id",
                keyValue: 14);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferStartAndEndDates",
                keyColumn: "Id",
                keyValue: 15);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferStartAndEndDates",
                keyColumn: "Id",
                keyValue: 16);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferStartAndEndDates",
                keyColumn: "Id",
                keyValue: 17);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferStartAndEndDates",
                keyColumn: "Id",
                keyValue: 18);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferStartAndEndDates",
                keyColumn: "Id",
                keyValue: 19);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferStartAndEndDates",
                keyColumn: "Id",
                keyValue: 20);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferStartAndEndDates",
                keyColumn: "Id",
                keyValue: 21);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferStartAndEndDates",
                keyColumn: "Id",
                keyValue: 22);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferStartAndEndDates",
                keyColumn: "Id",
                keyValue: 23);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferStartAndEndDates",
                keyColumn: "Id",
                keyValue: 24);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferStartAndEndDates",
                keyColumn: "Id",
                keyValue: 25);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferStartAndEndDates",
                keyColumn: "Id",
                keyValue: 26);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferStartAndEndDates",
                keyColumn: "Id",
                keyValue: 27);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferStartAndEndDates",
                keyColumn: "Id",
                keyValue: 28);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferStartAndEndDates",
                keyColumn: "Id",
                keyValue: 29);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferStartAndEndDates",
                keyColumn: "Id",
                keyValue: 30);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferStartAndEndDates",
                keyColumn: "Id",
                keyValue: 31);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferStartAndEndDates",
                keyColumn: "Id",
                keyValue: 32);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferStartAndEndDates",
                keyColumn: "Id",
                keyValue: 33);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferStartAndEndDates",
                keyColumn: "Id",
                keyValue: 34);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferStartAndEndDates",
                keyColumn: "Id",
                keyValue: 35);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferStartAndEndDates",
                keyColumn: "Id",
                keyValue: 36);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferStartAndEndDates",
                keyColumn: "Id",
                keyValue: 37);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferStartAndEndDates",
                keyColumn: "Id",
                keyValue: 38);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferStartAndEndDates",
                keyColumn: "Id",
                keyValue: 39);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferStartAndEndDates",
                keyColumn: "Id",
                keyValue: 40);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferStartAndEndDates",
                keyColumn: "Id",
                keyValue: 41);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferStartAndEndDates",
                keyColumn: "Id",
                keyValue: 42);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferStartAndEndDates",
                keyColumn: "Id",
                keyValue: 43);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferStartAndEndDates",
                keyColumn: "Id",
                keyValue: 44);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferStartAndEndDates",
                keyColumn: "Id",
                keyValue: 45);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferStartAndEndDates",
                keyColumn: "Id",
                keyValue: 46);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferStartAndEndDates",
                keyColumn: "Id",
                keyValue: 47);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferStartAndEndDates",
                keyColumn: "Id",
                keyValue: 48);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferStartAndEndDates",
                keyColumn: "Id",
                keyValue: 49);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferStartAndEndDates",
                keyColumn: "Id",
                keyValue: 50);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferStartAndEndDates",
                keyColumn: "Id",
                keyValue: 51);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferStartAndEndDates",
                keyColumn: "Id",
                keyValue: 52);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferStartAndEndDates",
                keyColumn: "Id",
                keyValue: 53);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferStartAndEndDates",
                keyColumn: "Id",
                keyValue: 54);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferStartAndEndDates",
                keyColumn: "Id",
                keyValue: 55);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferStartAndEndDates",
                keyColumn: "Id",
                keyValue: 56);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferStartAndEndDates",
                keyColumn: "Id",
                keyValue: 57);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferStartAndEndDates",
                keyColumn: "Id",
                keyValue: 58);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferStartAndEndDates",
                keyColumn: "Id",
                keyValue: 59);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferStartAndEndDates",
                keyColumn: "Id",
                keyValue: 60);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferStartAndEndDates",
                keyColumn: "Id",
                keyValue: 61);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferStartAndEndDates",
                keyColumn: "Id",
                keyValue: 62);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferStartAndEndDates",
                keyColumn: "Id",
                keyValue: 63);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferStartAndEndDates",
                keyColumn: "Id",
                keyValue: 64);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferStartAndEndDates",
                keyColumn: "Id",
                keyValue: 65);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferStartAndEndDates",
                keyColumn: "Id",
                keyValue: 66);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferStartAndEndDates",
                keyColumn: "Id",
                keyValue: 67);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferStartAndEndDates",
                keyColumn: "Id",
                keyValue: 68);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferStartAndEndDates",
                keyColumn: "Id",
                keyValue: 69);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferStartAndEndDates",
                keyColumn: "Id",
                keyValue: 70);

            migrationBuilder.DeleteData(
                table: "UnorganizedOffersTransportTypesPrices",
                keyColumns: new[] { "TransportTypeId", "UnorganizedOfferId" },
                keyValues: new object[] { 2, 1 });

            migrationBuilder.DeleteData(
                table: "UnorganizedOffersTransportTypesPrices",
                keyColumns: new[] { "TransportTypeId", "UnorganizedOfferId" },
                keyValues: new object[] { 3, 1 });

            migrationBuilder.DeleteData(
                table: "UnorganizedOffersTransportTypesPrices",
                keyColumns: new[] { "TransportTypeId", "UnorganizedOfferId" },
                keyValues: new object[] { 1, 2 });

            migrationBuilder.DeleteData(
                table: "UnorganizedOffersTransportTypesPrices",
                keyColumns: new[] { "TransportTypeId", "UnorganizedOfferId" },
                keyValues: new object[] { 1, 3 });

            migrationBuilder.DeleteData(
                table: "UnorganizedOffersTransportTypesPrices",
                keyColumns: new[] { "TransportTypeId", "UnorganizedOfferId" },
                keyValues: new object[] { 2, 3 });

            migrationBuilder.DeleteData(
                table: "UnorganizedOffersTransportTypesPrices",
                keyColumns: new[] { "TransportTypeId", "UnorganizedOfferId" },
                keyValues: new object[] { 3, 3 });

            migrationBuilder.DeleteData(
                table: "UnorganizedOffersTransportTypesPrices",
                keyColumns: new[] { "TransportTypeId", "UnorganizedOfferId" },
                keyValues: new object[] { 1, 4 });

            migrationBuilder.DeleteData(
                table: "UnorganizedOffersTransportTypesPrices",
                keyColumns: new[] { "TransportTypeId", "UnorganizedOfferId" },
                keyValues: new object[] { 2, 4 });

            migrationBuilder.DeleteData(
                table: "UnorganizedOffersTransportTypesPrices",
                keyColumns: new[] { "TransportTypeId", "UnorganizedOfferId" },
                keyValues: new object[] { 3, 4 });

            migrationBuilder.DeleteData(
                table: "UnorganizedOffersTransportTypesPrices",
                keyColumns: new[] { "TransportTypeId", "UnorganizedOfferId" },
                keyValues: new object[] { 1, 5 });

            migrationBuilder.DeleteData(
                table: "UnorganizedOffersTransportTypesPrices",
                keyColumns: new[] { "TransportTypeId", "UnorganizedOfferId" },
                keyValues: new object[] { 2, 5 });

            migrationBuilder.DeleteData(
                table: "UnorganizedOffersTransportTypesPrices",
                keyColumns: new[] { "TransportTypeId", "UnorganizedOfferId" },
                keyValues: new object[] { 3, 5 });

            migrationBuilder.DeleteData(
                table: "UnorganizedOffersTransportTypesPrices",
                keyColumns: new[] { "TransportTypeId", "UnorganizedOfferId" },
                keyValues: new object[] { 1, 6 });

            migrationBuilder.DeleteData(
                table: "UnorganizedOffersTransportTypesPrices",
                keyColumns: new[] { "TransportTypeId", "UnorganizedOfferId" },
                keyValues: new object[] { 1, 7 });

            migrationBuilder.DeleteData(
                table: "UnorganizedOffersTransportTypesPrices",
                keyColumns: new[] { "TransportTypeId", "UnorganizedOfferId" },
                keyValues: new object[] { 1, 8 });

            migrationBuilder.DeleteData(
                table: "UnorganizedOffersTransportTypesPrices",
                keyColumns: new[] { "TransportTypeId", "UnorganizedOfferId" },
                keyValues: new object[] { 2, 8 });

            migrationBuilder.DeleteData(
                table: "UnorganizedOffersTransportTypesPrices",
                keyColumns: new[] { "TransportTypeId", "UnorganizedOfferId" },
                keyValues: new object[] { 3, 8 });

            migrationBuilder.DeleteData(
                table: "UnorganizedOffersTransportTypesPrices",
                keyColumns: new[] { "TransportTypeId", "UnorganizedOfferId" },
                keyValues: new object[] { 1, 9 });

            migrationBuilder.DeleteData(
                table: "UnorganizedOffersTransportTypesPrices",
                keyColumns: new[] { "TransportTypeId", "UnorganizedOfferId" },
                keyValues: new object[] { 2, 9 });

            migrationBuilder.DeleteData(
                table: "UnorganizedOffersTransportTypesPrices",
                keyColumns: new[] { "TransportTypeId", "UnorganizedOfferId" },
                keyValues: new object[] { 3, 9 });

            migrationBuilder.DeleteData(
                table: "UnorganizedOffersTransportTypesPrices",
                keyColumns: new[] { "TransportTypeId", "UnorganizedOfferId" },
                keyValues: new object[] { 1, 10 });

            migrationBuilder.DeleteData(
                table: "UnorganizedOffersTransportTypesPrices",
                keyColumns: new[] { "TransportTypeId", "UnorganizedOfferId" },
                keyValues: new object[] { 2, 10 });

            migrationBuilder.DeleteData(
                table: "UnorganizedOffersTransportTypesPrices",
                keyColumns: new[] { "TransportTypeId", "UnorganizedOfferId" },
                keyValues: new object[] { 3, 10 });

            migrationBuilder.DeleteData(
                table: "UnorganizedOffersTransportTypesPrices",
                keyColumns: new[] { "TransportTypeId", "UnorganizedOfferId" },
                keyValues: new object[] { 1, 11 });

            migrationBuilder.DeleteData(
                table: "UnorganizedOffersTransportTypesPrices",
                keyColumns: new[] { "TransportTypeId", "UnorganizedOfferId" },
                keyValues: new object[] { 2, 11 });

            migrationBuilder.DeleteData(
                table: "UnorganizedOffersTransportTypesPrices",
                keyColumns: new[] { "TransportTypeId", "UnorganizedOfferId" },
                keyValues: new object[] { 3, 11 });

            migrationBuilder.DeleteData(
                table: "UnorganizedOffersTransportTypesPrices",
                keyColumns: new[] { "TransportTypeId", "UnorganizedOfferId" },
                keyValues: new object[] { 1, 12 });

            migrationBuilder.DeleteData(
                table: "UnorganizedOffersTransportTypesPrices",
                keyColumns: new[] { "TransportTypeId", "UnorganizedOfferId" },
                keyValues: new object[] { 2, 12 });

            migrationBuilder.DeleteData(
                table: "UnorganizedOffersTransportTypesPrices",
                keyColumns: new[] { "TransportTypeId", "UnorganizedOfferId" },
                keyValues: new object[] { 3, 12 });

            migrationBuilder.DeleteData(
                table: "UnorganizedOffersTransportTypesPrices",
                keyColumns: new[] { "TransportTypeId", "UnorganizedOfferId" },
                keyValues: new object[] { 1, 13 });

            migrationBuilder.DeleteData(
                table: "UnorganizedOffersTransportTypesPrices",
                keyColumns: new[] { "TransportTypeId", "UnorganizedOfferId" },
                keyValues: new object[] { 2, 13 });

            migrationBuilder.DeleteData(
                table: "UnorganizedOffersTransportTypesPrices",
                keyColumns: new[] { "TransportTypeId", "UnorganizedOfferId" },
                keyValues: new object[] { 3, 13 });

            migrationBuilder.DeleteData(
                table: "UnorganizedOffersTransportTypesPrices",
                keyColumns: new[] { "TransportTypeId", "UnorganizedOfferId" },
                keyValues: new object[] { 1, 14 });

            migrationBuilder.DeleteData(
                table: "UnorganizedOffersTransportTypesPrices",
                keyColumns: new[] { "TransportTypeId", "UnorganizedOfferId" },
                keyValues: new object[] { 2, 14 });

            migrationBuilder.DeleteData(
                table: "UnorganizedOffersTransportTypesPrices",
                keyColumns: new[] { "TransportTypeId", "UnorganizedOfferId" },
                keyValues: new object[] { 3, 14 });

            migrationBuilder.DeleteData(
                table: "UnorganizedOffersTransportTypesPrices",
                keyColumns: new[] { "TransportTypeId", "UnorganizedOfferId" },
                keyValues: new object[] { 1, 15 });

            migrationBuilder.DeleteData(
                table: "UnorganizedOffersTransportTypesPrices",
                keyColumns: new[] { "TransportTypeId", "UnorganizedOfferId" },
                keyValues: new object[] { 2, 15 });

            migrationBuilder.DeleteData(
                table: "UnorganizedOffersTransportTypesPrices",
                keyColumns: new[] { "TransportTypeId", "UnorganizedOfferId" },
                keyValues: new object[] { 3, 15 });

            migrationBuilder.DeleteData(
                table: "UnorganizedOffersTransportTypesPrices",
                keyColumns: new[] { "TransportTypeId", "UnorganizedOfferId" },
                keyValues: new object[] { 1, 16 });

            migrationBuilder.DeleteData(
                table: "UnorganizedOffersTransportTypesPrices",
                keyColumns: new[] { "TransportTypeId", "UnorganizedOfferId" },
                keyValues: new object[] { 2, 16 });

            migrationBuilder.DeleteData(
                table: "UnorganizedOffersTransportTypesPrices",
                keyColumns: new[] { "TransportTypeId", "UnorganizedOfferId" },
                keyValues: new object[] { 3, 16 });

            migrationBuilder.DeleteData(
                table: "UnorganizedOffersTransportTypesPrices",
                keyColumns: new[] { "TransportTypeId", "UnorganizedOfferId" },
                keyValues: new object[] { 1, 17 });

            migrationBuilder.DeleteData(
                table: "UnorganizedOffersTransportTypesPrices",
                keyColumns: new[] { "TransportTypeId", "UnorganizedOfferId" },
                keyValues: new object[] { 2, 17 });

            migrationBuilder.DeleteData(
                table: "UnorganizedOffersTransportTypesPrices",
                keyColumns: new[] { "TransportTypeId", "UnorganizedOfferId" },
                keyValues: new object[] { 3, 17 });

            migrationBuilder.DeleteData(
                table: "UnorganizedOffersTransportTypesPrices",
                keyColumns: new[] { "TransportTypeId", "UnorganizedOfferId" },
                keyValues: new object[] { 1, 18 });

            migrationBuilder.DeleteData(
                table: "UnorganizedOffersTransportTypesPrices",
                keyColumns: new[] { "TransportTypeId", "UnorganizedOfferId" },
                keyValues: new object[] { 2, 18 });

            migrationBuilder.DeleteData(
                table: "UnorganizedOffersTransportTypesPrices",
                keyColumns: new[] { "TransportTypeId", "UnorganizedOfferId" },
                keyValues: new object[] { 3, 18 });

            migrationBuilder.DeleteData(
                table: "UnorganizedOffersTransportTypesPrices",
                keyColumns: new[] { "TransportTypeId", "UnorganizedOfferId" },
                keyValues: new object[] { 1, 19 });

            migrationBuilder.DeleteData(
                table: "UnorganizedOffersTransportTypesPrices",
                keyColumns: new[] { "TransportTypeId", "UnorganizedOfferId" },
                keyValues: new object[] { 2, 19 });

            migrationBuilder.DeleteData(
                table: "UnorganizedOffersTransportTypesPrices",
                keyColumns: new[] { "TransportTypeId", "UnorganizedOfferId" },
                keyValues: new object[] { 3, 19 });

            migrationBuilder.DeleteData(
                table: "UnorganizedOffersTransportTypesPrices",
                keyColumns: new[] { "TransportTypeId", "UnorganizedOfferId" },
                keyValues: new object[] { 1, 20 });

            migrationBuilder.DeleteData(
                table: "UnorganizedOffersTransportTypesPrices",
                keyColumns: new[] { "TransportTypeId", "UnorganizedOfferId" },
                keyValues: new object[] { 1, 21 });

            migrationBuilder.DeleteData(
                table: "UnorganizedOffersTransportTypesPrices",
                keyColumns: new[] { "TransportTypeId", "UnorganizedOfferId" },
                keyValues: new object[] { 1, 22 });

            migrationBuilder.DeleteData(
                table: "UnorganizedOffersTransportTypesPrices",
                keyColumns: new[] { "TransportTypeId", "UnorganizedOfferId" },
                keyValues: new object[] { 1, 23 });

            migrationBuilder.DeleteData(
                table: "UnorganizedOffersTransportTypesPrices",
                keyColumns: new[] { "TransportTypeId", "UnorganizedOfferId" },
                keyValues: new object[] { 1, 24 });

            migrationBuilder.DeleteData(
                table: "UnorganizedOffersTransportTypesPrices",
                keyColumns: new[] { "TransportTypeId", "UnorganizedOfferId" },
                keyValues: new object[] { 1, 25 });

            migrationBuilder.DeleteData(
                table: "UnorganizedOffersTransportTypesPrices",
                keyColumns: new[] { "TransportTypeId", "UnorganizedOfferId" },
                keyValues: new object[] { 1, 26 });

            migrationBuilder.DeleteData(
                table: "UnorganizedOffersTransportTypesPrices",
                keyColumns: new[] { "TransportTypeId", "UnorganizedOfferId" },
                keyValues: new object[] { 1, 27 });

            migrationBuilder.DeleteData(
                table: "UnorganizedOffersTransportTypesPrices",
                keyColumns: new[] { "TransportTypeId", "UnorganizedOfferId" },
                keyValues: new object[] { 1, 28 });

            migrationBuilder.DeleteData(
                table: "UnorganizedOffersTransportTypesPrices",
                keyColumns: new[] { "TransportTypeId", "UnorganizedOfferId" },
                keyValues: new object[] { 1, 29 });

            migrationBuilder.DeleteData(
                table: "UnorganizedOffersTransportTypesPrices",
                keyColumns: new[] { "TransportTypeId", "UnorganizedOfferId" },
                keyValues: new object[] { 1, 30 });

            migrationBuilder.DeleteData(
                table: "UnorganizedOffersTransportTypesPrices",
                keyColumns: new[] { "TransportTypeId", "UnorganizedOfferId" },
                keyValues: new object[] { 1, 31 });

            migrationBuilder.DeleteData(
                table: "UnorganizedOffersTransportTypesPrices",
                keyColumns: new[] { "TransportTypeId", "UnorganizedOfferId" },
                keyValues: new object[] { 1, 32 });

            migrationBuilder.DeleteData(
                table: "UnorganizedOffersTransportTypesPrices",
                keyColumns: new[] { "TransportTypeId", "UnorganizedOfferId" },
                keyValues: new object[] { 1, 33 });

            migrationBuilder.DeleteData(
                table: "UnorganizedOffersTransportTypesPrices",
                keyColumns: new[] { "TransportTypeId", "UnorganizedOfferId" },
                keyValues: new object[] { 1, 34 });

            migrationBuilder.DeleteData(
                table: "UnorganizedOffersTransportTypesPrices",
                keyColumns: new[] { "TransportTypeId", "UnorganizedOfferId" },
                keyValues: new object[] { 1, 35 });

            migrationBuilder.DeleteData(
                table: "CruiseRoomTypes",
                keyColumn: "Id",
                keyValue: 1);

            migrationBuilder.DeleteData(
                table: "CruiseRoomTypes",
                keyColumn: "Id",
                keyValue: 2);

            migrationBuilder.DeleteData(
                table: "CruiseRoomTypes",
                keyColumn: "Id",
                keyValue: 3);

            migrationBuilder.DeleteData(
                table: "CruiseRoomTypes",
                keyColumn: "Id",
                keyValue: 4);

            migrationBuilder.DeleteData(
                table: "Cruises",
                keyColumn: "Id",
                keyValue: 1);

            migrationBuilder.DeleteData(
                table: "Cruises",
                keyColumn: "Id",
                keyValue: 2);

            migrationBuilder.DeleteData(
                table: "Cruises",
                keyColumn: "Id",
                keyValue: 3);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 2);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 3);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 4);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 6);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 7);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 8);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 11);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 12);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 13);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 15);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 17);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 18);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 19);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 20);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 23);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 24);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 25);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 26);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 29);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 30);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 32);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 33);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 34);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 36);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 37);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 38);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 41);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 42);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 43);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 45);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 46);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 48);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 49);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 51);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 52);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 54);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 56);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 57);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 59);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 60);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 61);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 63);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 65);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 66);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 67);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 69);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 71);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 72);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 73);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 75);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 76);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 78);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 79);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 80);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 82);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 84);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 85);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 87);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 88);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 90);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 91);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 93);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 95);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 96);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 97);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 98);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 100);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 102);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 103);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 104);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 2);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 3);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 7);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 8);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 9);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 10);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 11);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 12);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 15);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 16);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 17);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 21);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 26);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 27);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 28);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 39);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 40);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 41);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 42);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 43);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 44);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 47);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 48);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 51);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 52);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 56);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 57);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 60);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 61);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 62);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 63);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 64);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 68);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 69);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 70);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 71);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 76);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 77);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 78);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 79);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 110);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 112);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 114);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 117);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 118);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 119);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 121);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 122);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 127);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 128);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 149);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 150);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 151);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 176);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 177);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 178);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 184);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 198);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 199);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 200);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 201);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 202);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 203);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 233);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 234);

            migrationBuilder.DeleteData(
                table: "OrganizedOfferDays",
                keyColumn: "Id",
                keyValue: 235);

            migrationBuilder.DeleteData(
                table: "OrganizedOffers",
                keyColumn: "Id",
                keyValue: 6);

            migrationBuilder.DeleteData(
                table: "OrganizedOffers",
                keyColumn: "Id",
                keyValue: 14);

            migrationBuilder.DeleteData(
                table: "OrganizedOffers",
                keyColumn: "Id",
                keyValue: 15);

            migrationBuilder.DeleteData(
                table: "OrganizedOffers",
                keyColumn: "Id",
                keyValue: 16);

            migrationBuilder.DeleteData(
                table: "OrganizedOffers",
                keyColumn: "Id",
                keyValue: 21);

            migrationBuilder.DeleteData(
                table: "OrganizedOffers",
                keyColumn: "Id",
                keyValue: 22);

            migrationBuilder.DeleteData(
                table: "OrganizedOffers",
                keyColumn: "Id",
                keyValue: 24);

            migrationBuilder.DeleteData(
                table: "OrganizedOffers",
                keyColumn: "Id",
                keyValue: 25);

            migrationBuilder.DeleteData(
                table: "OrganizedOffers",
                keyColumn: "Id",
                keyValue: 26);

            migrationBuilder.DeleteData(
                table: "OrganizedOffers",
                keyColumn: "Id",
                keyValue: 29);

            migrationBuilder.DeleteData(
                table: "OrganizedOffers",
                keyColumn: "Id",
                keyValue: 31);

            migrationBuilder.DeleteData(
                table: "OrganizedOffers",
                keyColumn: "Id",
                keyValue: 32);

            migrationBuilder.DeleteData(
                table: "OrganizedOffers",
                keyColumn: "Id",
                keyValue: 33);

            migrationBuilder.DeleteData(
                table: "OrganizedOffers",
                keyColumn: "Id",
                keyValue: 34);

            migrationBuilder.DeleteData(
                table: "PassByDestinations",
                keyColumn: "Id",
                keyValue: 1);

            migrationBuilder.DeleteData(
                table: "PassByDestinations",
                keyColumn: "Id",
                keyValue: 2);

            migrationBuilder.DeleteData(
                table: "PassByDestinations",
                keyColumn: "Id",
                keyValue: 3);

            migrationBuilder.DeleteData(
                table: "PassByDestinations",
                keyColumn: "Id",
                keyValue: 4);

            migrationBuilder.DeleteData(
                table: "PassByDestinations",
                keyColumn: "Id",
                keyValue: 5);

            migrationBuilder.DeleteData(
                table: "PassByDestinations",
                keyColumn: "Id",
                keyValue: 6);

            migrationBuilder.DeleteData(
                table: "PassByDestinations",
                keyColumn: "Id",
                keyValue: 7);

            migrationBuilder.DeleteData(
                table: "PassByDestinations",
                keyColumn: "Id",
                keyValue: 8);

            migrationBuilder.DeleteData(
                table: "PassByDestinations",
                keyColumn: "Id",
                keyValue: 9);

            migrationBuilder.DeleteData(
                table: "PassByDestinations",
                keyColumn: "Id",
                keyValue: 10);

            migrationBuilder.DeleteData(
                table: "PassByDestinations",
                keyColumn: "Id",
                keyValue: 11);

            migrationBuilder.DeleteData(
                table: "PassByDestinations",
                keyColumn: "Id",
                keyValue: 12);

            migrationBuilder.DeleteData(
                table: "PassByDestinations",
                keyColumn: "Id",
                keyValue: 13);

            migrationBuilder.DeleteData(
                table: "PassByDestinations",
                keyColumn: "Id",
                keyValue: 14);

            migrationBuilder.DeleteData(
                table: "PassByDestinations",
                keyColumn: "Id",
                keyValue: 15);

            migrationBuilder.DeleteData(
                table: "PassByDestinations",
                keyColumn: "Id",
                keyValue: 16);

            migrationBuilder.DeleteData(
                table: "PassByDestinations",
                keyColumn: "Id",
                keyValue: 17);

            migrationBuilder.DeleteData(
                table: "RoomTypes",
                keyColumn: "Id",
                keyValue: 1);

            migrationBuilder.DeleteData(
                table: "RoomTypes",
                keyColumn: "Id",
                keyValue: 2);

            migrationBuilder.DeleteData(
                table: "RoomTypes",
                keyColumn: "Id",
                keyValue: 3);

            migrationBuilder.DeleteData(
                table: "RoomTypes",
                keyColumn: "Id",
                keyValue: 4);

            migrationBuilder.DeleteData(
                table: "RoomTypes",
                keyColumn: "Id",
                keyValue: 5);

            migrationBuilder.DeleteData(
                table: "RoomTypes",
                keyColumn: "Id",
                keyValue: 6);

            migrationBuilder.DeleteData(
                table: "RoomTypes",
                keyColumn: "Id",
                keyValue: 7);

            migrationBuilder.DeleteData(
                table: "RoomTypes",
                keyColumn: "Id",
                keyValue: 8);

            migrationBuilder.DeleteData(
                table: "RoomTypes",
                keyColumn: "Id",
                keyValue: 9);

            migrationBuilder.DeleteData(
                table: "RoomTypes",
                keyColumn: "Id",
                keyValue: 10);

            migrationBuilder.DeleteData(
                table: "TransportTypes",
                keyColumn: "Id",
                keyValue: 3);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 16);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 40);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 44);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 47);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 62);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 64);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 70);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 74);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 77);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 86);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 92);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 94);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 99);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 101);

            migrationBuilder.DeleteData(
                table: "OrganizedOffers",
                keyColumn: "Id",
                keyValue: 1);

            migrationBuilder.DeleteData(
                table: "OrganizedOffers",
                keyColumn: "Id",
                keyValue: 2);

            migrationBuilder.DeleteData(
                table: "OrganizedOffers",
                keyColumn: "Id",
                keyValue: 3);

            migrationBuilder.DeleteData(
                table: "OrganizedOffers",
                keyColumn: "Id",
                keyValue: 4);

            migrationBuilder.DeleteData(
                table: "OrganizedOffers",
                keyColumn: "Id",
                keyValue: 5);

            migrationBuilder.DeleteData(
                table: "OrganizedOffers",
                keyColumn: "Id",
                keyValue: 7);

            migrationBuilder.DeleteData(
                table: "OrganizedOffers",
                keyColumn: "Id",
                keyValue: 8);

            migrationBuilder.DeleteData(
                table: "OrganizedOffers",
                keyColumn: "Id",
                keyValue: 9);

            migrationBuilder.DeleteData(
                table: "OrganizedOffers",
                keyColumn: "Id",
                keyValue: 10);

            migrationBuilder.DeleteData(
                table: "OrganizedOffers",
                keyColumn: "Id",
                keyValue: 11);

            migrationBuilder.DeleteData(
                table: "OrganizedOffers",
                keyColumn: "Id",
                keyValue: 12);

            migrationBuilder.DeleteData(
                table: "OrganizedOffers",
                keyColumn: "Id",
                keyValue: 13);

            migrationBuilder.DeleteData(
                table: "OrganizedOffers",
                keyColumn: "Id",
                keyValue: 17);

            migrationBuilder.DeleteData(
                table: "OrganizedOffers",
                keyColumn: "Id",
                keyValue: 18);

            migrationBuilder.DeleteData(
                table: "OrganizedOffers",
                keyColumn: "Id",
                keyValue: 19);

            migrationBuilder.DeleteData(
                table: "OrganizedOffers",
                keyColumn: "Id",
                keyValue: 20);

            migrationBuilder.DeleteData(
                table: "OrganizedOffers",
                keyColumn: "Id",
                keyValue: 23);

            migrationBuilder.DeleteData(
                table: "OrganizedOffers",
                keyColumn: "Id",
                keyValue: 27);

            migrationBuilder.DeleteData(
                table: "OrganizedOffers",
                keyColumn: "Id",
                keyValue: 28);

            migrationBuilder.DeleteData(
                table: "OrganizedOffers",
                keyColumn: "Id",
                keyValue: 30);

            migrationBuilder.DeleteData(
                table: "OrganizedOffers",
                keyColumn: "Id",
                keyValue: 35);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 1);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 5);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 9);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 10);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 14);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 21);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 22);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 27);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 28);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 31);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 35);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 39);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 50);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 53);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 55);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 58);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 68);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 81);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 83);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 89);

            migrationBuilder.DeleteData(
                table: "Hotels",
                keyColumn: "Id",
                keyValue: 105);

            migrationBuilder.DeleteData(
                table: "TransportTypes",
                keyColumn: "Id",
                keyValue: 1);

            migrationBuilder.DeleteData(
                table: "TransportTypes",
                keyColumn: "Id",
                keyValue: 2);

            migrationBuilder.DeleteData(
                table: "UnorganizedOffers",
                keyColumn: "Id",
                keyValue: 6);

            migrationBuilder.DeleteData(
                table: "UnorganizedOffers",
                keyColumn: "Id",
                keyValue: 14);

            migrationBuilder.DeleteData(
                table: "UnorganizedOffers",
                keyColumn: "Id",
                keyValue: 15);

            migrationBuilder.DeleteData(
                table: "UnorganizedOffers",
                keyColumn: "Id",
                keyValue: 16);

            migrationBuilder.DeleteData(
                table: "UnorganizedOffers",
                keyColumn: "Id",
                keyValue: 21);

            migrationBuilder.DeleteData(
                table: "UnorganizedOffers",
                keyColumn: "Id",
                keyValue: 22);

            migrationBuilder.DeleteData(
                table: "UnorganizedOffers",
                keyColumn: "Id",
                keyValue: 24);

            migrationBuilder.DeleteData(
                table: "UnorganizedOffers",
                keyColumn: "Id",
                keyValue: 25);

            migrationBuilder.DeleteData(
                table: "UnorganizedOffers",
                keyColumn: "Id",
                keyValue: 26);

            migrationBuilder.DeleteData(
                table: "UnorganizedOffers",
                keyColumn: "Id",
                keyValue: 29);

            migrationBuilder.DeleteData(
                table: "UnorganizedOffers",
                keyColumn: "Id",
                keyValue: 31);

            migrationBuilder.DeleteData(
                table: "UnorganizedOffers",
                keyColumn: "Id",
                keyValue: 32);

            migrationBuilder.DeleteData(
                table: "UnorganizedOffers",
                keyColumn: "Id",
                keyValue: 33);

            migrationBuilder.DeleteData(
                table: "UnorganizedOffers",
                keyColumn: "Id",
                keyValue: 34);

            migrationBuilder.DeleteData(
                table: "Destinations",
                keyColumn: "Id",
                keyValue: 6);

            migrationBuilder.DeleteData(
                table: "Destinations",
                keyColumn: "Id",
                keyValue: 14);

            migrationBuilder.DeleteData(
                table: "Destinations",
                keyColumn: "Id",
                keyValue: 15);

            migrationBuilder.DeleteData(
                table: "Destinations",
                keyColumn: "Id",
                keyValue: 16);

            migrationBuilder.DeleteData(
                table: "Destinations",
                keyColumn: "Id",
                keyValue: 21);

            migrationBuilder.DeleteData(
                table: "Destinations",
                keyColumn: "Id",
                keyValue: 22);

            migrationBuilder.DeleteData(
                table: "Destinations",
                keyColumn: "Id",
                keyValue: 24);

            migrationBuilder.DeleteData(
                table: "Destinations",
                keyColumn: "Id",
                keyValue: 25);

            migrationBuilder.DeleteData(
                table: "Destinations",
                keyColumn: "Id",
                keyValue: 26);

            migrationBuilder.DeleteData(
                table: "Destinations",
                keyColumn: "Id",
                keyValue: 29);

            migrationBuilder.DeleteData(
                table: "Destinations",
                keyColumn: "Id",
                keyValue: 31);

            migrationBuilder.DeleteData(
                table: "Destinations",
                keyColumn: "Id",
                keyValue: 32);

            migrationBuilder.DeleteData(
                table: "Destinations",
                keyColumn: "Id",
                keyValue: 33);

            migrationBuilder.DeleteData(
                table: "Destinations",
                keyColumn: "Id",
                keyValue: 34);

            migrationBuilder.DeleteData(
                table: "UnorganizedOffers",
                keyColumn: "Id",
                keyValue: 1);

            migrationBuilder.DeleteData(
                table: "UnorganizedOffers",
                keyColumn: "Id",
                keyValue: 2);

            migrationBuilder.DeleteData(
                table: "UnorganizedOffers",
                keyColumn: "Id",
                keyValue: 3);

            migrationBuilder.DeleteData(
                table: "UnorganizedOffers",
                keyColumn: "Id",
                keyValue: 4);

            migrationBuilder.DeleteData(
                table: "UnorganizedOffers",
                keyColumn: "Id",
                keyValue: 5);

            migrationBuilder.DeleteData(
                table: "UnorganizedOffers",
                keyColumn: "Id",
                keyValue: 7);

            migrationBuilder.DeleteData(
                table: "UnorganizedOffers",
                keyColumn: "Id",
                keyValue: 8);

            migrationBuilder.DeleteData(
                table: "UnorganizedOffers",
                keyColumn: "Id",
                keyValue: 9);

            migrationBuilder.DeleteData(
                table: "UnorganizedOffers",
                keyColumn: "Id",
                keyValue: 10);

            migrationBuilder.DeleteData(
                table: "UnorganizedOffers",
                keyColumn: "Id",
                keyValue: 11);

            migrationBuilder.DeleteData(
                table: "UnorganizedOffers",
                keyColumn: "Id",
                keyValue: 12);

            migrationBuilder.DeleteData(
                table: "UnorganizedOffers",
                keyColumn: "Id",
                keyValue: 13);

            migrationBuilder.DeleteData(
                table: "UnorganizedOffers",
                keyColumn: "Id",
                keyValue: 17);

            migrationBuilder.DeleteData(
                table: "UnorganizedOffers",
                keyColumn: "Id",
                keyValue: 18);

            migrationBuilder.DeleteData(
                table: "UnorganizedOffers",
                keyColumn: "Id",
                keyValue: 19);

            migrationBuilder.DeleteData(
                table: "UnorganizedOffers",
                keyColumn: "Id",
                keyValue: 20);

            migrationBuilder.DeleteData(
                table: "UnorganizedOffers",
                keyColumn: "Id",
                keyValue: 23);

            migrationBuilder.DeleteData(
                table: "UnorganizedOffers",
                keyColumn: "Id",
                keyValue: 27);

            migrationBuilder.DeleteData(
                table: "UnorganizedOffers",
                keyColumn: "Id",
                keyValue: 28);

            migrationBuilder.DeleteData(
                table: "UnorganizedOffers",
                keyColumn: "Id",
                keyValue: 30);

            migrationBuilder.DeleteData(
                table: "UnorganizedOffers",
                keyColumn: "Id",
                keyValue: 35);

            migrationBuilder.DeleteData(
                table: "Countries",
                keyColumn: "Id",
                keyValue: 10);

            migrationBuilder.DeleteData(
                table: "Countries",
                keyColumn: "Id",
                keyValue: 11);

            migrationBuilder.DeleteData(
                table: "Countries",
                keyColumn: "Id",
                keyValue: 13);

            migrationBuilder.DeleteData(
                table: "Countries",
                keyColumn: "Id",
                keyValue: 14);

            migrationBuilder.DeleteData(
                table: "Countries",
                keyColumn: "Id",
                keyValue: 17);

            migrationBuilder.DeleteData(
                table: "Countries",
                keyColumn: "Id",
                keyValue: 19);

            migrationBuilder.DeleteData(
                table: "Destinations",
                keyColumn: "Id",
                keyValue: 1);

            migrationBuilder.DeleteData(
                table: "Destinations",
                keyColumn: "Id",
                keyValue: 2);

            migrationBuilder.DeleteData(
                table: "Destinations",
                keyColumn: "Id",
                keyValue: 3);

            migrationBuilder.DeleteData(
                table: "Destinations",
                keyColumn: "Id",
                keyValue: 4);

            migrationBuilder.DeleteData(
                table: "Destinations",
                keyColumn: "Id",
                keyValue: 5);

            migrationBuilder.DeleteData(
                table: "Destinations",
                keyColumn: "Id",
                keyValue: 7);

            migrationBuilder.DeleteData(
                table: "Destinations",
                keyColumn: "Id",
                keyValue: 8);

            migrationBuilder.DeleteData(
                table: "Destinations",
                keyColumn: "Id",
                keyValue: 9);

            migrationBuilder.DeleteData(
                table: "Destinations",
                keyColumn: "Id",
                keyValue: 10);

            migrationBuilder.DeleteData(
                table: "Destinations",
                keyColumn: "Id",
                keyValue: 11);

            migrationBuilder.DeleteData(
                table: "Destinations",
                keyColumn: "Id",
                keyValue: 12);

            migrationBuilder.DeleteData(
                table: "Destinations",
                keyColumn: "Id",
                keyValue: 13);

            migrationBuilder.DeleteData(
                table: "Destinations",
                keyColumn: "Id",
                keyValue: 17);

            migrationBuilder.DeleteData(
                table: "Destinations",
                keyColumn: "Id",
                keyValue: 18);

            migrationBuilder.DeleteData(
                table: "Destinations",
                keyColumn: "Id",
                keyValue: 19);

            migrationBuilder.DeleteData(
                table: "Destinations",
                keyColumn: "Id",
                keyValue: 20);

            migrationBuilder.DeleteData(
                table: "Destinations",
                keyColumn: "Id",
                keyValue: 23);

            migrationBuilder.DeleteData(
                table: "Destinations",
                keyColumn: "Id",
                keyValue: 27);

            migrationBuilder.DeleteData(
                table: "Destinations",
                keyColumn: "Id",
                keyValue: 28);

            migrationBuilder.DeleteData(
                table: "Destinations",
                keyColumn: "Id",
                keyValue: 30);

            migrationBuilder.DeleteData(
                table: "Destinations",
                keyColumn: "Id",
                keyValue: 35);

            migrationBuilder.DeleteData(
                table: "Countries",
                keyColumn: "Id",
                keyValue: 2);

            migrationBuilder.DeleteData(
                table: "Countries",
                keyColumn: "Id",
                keyValue: 3);

            migrationBuilder.DeleteData(
                table: "Countries",
                keyColumn: "Id",
                keyValue: 4);

            migrationBuilder.DeleteData(
                table: "Countries",
                keyColumn: "Id",
                keyValue: 5);

            migrationBuilder.DeleteData(
                table: "Countries",
                keyColumn: "Id",
                keyValue: 6);

            migrationBuilder.DeleteData(
                table: "Countries",
                keyColumn: "Id",
                keyValue: 7);

            migrationBuilder.DeleteData(
                table: "Countries",
                keyColumn: "Id",
                keyValue: 8);

            migrationBuilder.DeleteData(
                table: "Countries",
                keyColumn: "Id",
                keyValue: 9);

            migrationBuilder.DeleteData(
                table: "Countries",
                keyColumn: "Id",
                keyValue: 12);

            migrationBuilder.DeleteData(
                table: "Countries",
                keyColumn: "Id",
                keyValue: 15);

            migrationBuilder.DeleteData(
                table: "Countries",
                keyColumn: "Id",
                keyValue: 16);

            migrationBuilder.DeleteData(
                table: "Countries",
                keyColumn: "Id",
                keyValue: 18);

            migrationBuilder.DeleteData(
                table: "Countries",
                keyColumn: "Id",
                keyValue: 20);

            migrationBuilder.DeleteData(
                table: "Continents",
                keyColumn: "Id",
                keyValue: 1);

            migrationBuilder.DeleteData(
                table: "Continents",
                keyColumn: "Id",
                keyValue: 2);

            migrationBuilder.DeleteData(
                table: "Continents",
                keyColumn: "Id",
                keyValue: 3);

            migrationBuilder.DeleteData(
                table: "Continents",
                keyColumn: "Id",
                keyValue: 4);

            migrationBuilder.AlterColumn<string>(
                name: "Name",
                table: "RoomTypes",
                type: "nvarchar(30)",
                maxLength: 30,
                nullable: false,
                comment: "Name of RoomType",
                oldClrType: typeof(string),
                oldType: "nvarchar(35)",
                oldMaxLength: 35,
                oldComment: "Name of RoomType");

            migrationBuilder.AlterColumn<int>(
                name: "ActivityId",
                table: "OrganizedOfferDays",
                type: "int",
                nullable: false,
                defaultValue: 0,
                comment: "Activity identifier",
                oldClrType: typeof(int),
                oldType: "int",
                oldNullable: true,
                oldComment: "Activity identifier");

            migrationBuilder.AlterColumn<string>(
                name: "Name",
                table: "Hotels",
                type: "nvarchar(60)",
                maxLength: 60,
                nullable: false,
                comment: "Name of Hotel",
                oldClrType: typeof(string),
                oldType: "nvarchar(80)",
                oldMaxLength: 80,
                oldComment: "Name of Hotel");

            migrationBuilder.AlterColumn<string>(
                name: "Name",
                table: "Activities",
                type: "nvarchar(60)",
                maxLength: 60,
                nullable: false,
                comment: "Name of activity",
                oldClrType: typeof(string),
                oldType: "nvarchar(100)",
                oldMaxLength: 100,
                oldComment: "Name of activity");
        }
    }
}
