using Microsoft.EntityFrameworkCore;
using Microsoft.EntityFrameworkCore.Metadata.Builders;
using TouristAgency.Infrastructure.Data.Models.MssqlModels;

namespace TouristAgency.Infrastructure.Data.Configurations
{
    public class ActivityConfiguration : IEntityTypeConfiguration<Activity>
    {
        public void Configure(EntityTypeBuilder<Activity> builder)
        {
            builder.HasOne(b => b.OrganizedOfferDay)
                .WithOne(ofd => ofd.Activity)
                .OnDelete(DeleteBehavior.Restrict);

            Seed(builder);
        }

        private static void Seed(EntityTypeBuilder<Activity> builder)
        {
            builder.HasData(new Activity[]
            {
                new Activity()
                {
                    Id = 1,
                    Name = "Пешеходна разходка в  Кавала",
                    Description = "Около: пристанището; акведуктът, построен по заповед на Сюлейман Великолепни през 1550 г.; църквата „Св. Богородица“, родната къща на Али Паша, който провежда значими реформи в Османската империя през 19 в.; турската крепост от 16 в., станала символ на града",
                    MinPeopleNeeded = 3,
                    Price = 40m,
                    OrganizedOfferDayId = 2
                },
                new Activity()
                {
                    Id = 2,
                    Name = "Панорамна обиколка на остров Тасос",
                    Description = "Съдържа посещение на традиционна фабрика за производство на зехтин, манастира \"Св. Архангели\" и на златарското ателие \"Iris Gold\". Пешеходна разходка и свободно време в столицата Лименас",
                    MinPeopleNeeded = 15,
                    Price = 110m,
                    OrganizedOfferDayId = 3
                },

                new Activity()
                {
                    Id = 3,
                    Name = "Дворецът Кносос",
                    Description = "Минойският дворец е основната забележителност в Кносос, град от значителна важност в античността, който основно е бил населяван през Неолитния период до 5 век пр. Хр. Дворецът е построен на хълма Кефала, с лесен достъп до морето. Според митологията е бил седалище на мъдрия цар Минос. Двореца Кносос се свързва с вълнуващи легенди като мита за Лабиринта, с Минотавъра и историята за Дедал и Икар. \r\nРазкопките на двореца са започнали още по времето на Сър Артър Еванс през 1900 г и тогава са разкрити двореца и прилежащите му сгради, които са били център на кулутрата по време на Брозновата ера",
                    MinPeopleNeeded = 20,
                    Price = 60m,
                    OrganizedOfferDayId = 7
                },
                new Activity()
                {
                    Id = 4,
                    Name = "Музеят Ираклион",
                    Description = "Археологическия музей в Ираклион е един от най-старите и важни музеи в Гърция, и един от най-известните в Европа. Той помещава експонати от всички периоди на Критската цивилизация, обхващащи хронологичен период от над 5500 години от неолита до римско време. Археологическият музей Ираклион се гордее със своята уникална колекция, която включва шедьоврите на минойското изкуство. С право се счита за музей на минойската култура",
                    MinPeopleNeeded = 20,
                    Price = 55m,
                    OrganizedOfferDayId = 8
                },
                new Activity()
                {
                    Id = 5,
                    Name = "Пазарът на Ираклион",
                    Description = "Централният пазар в Ираклион може да бъде намерен на улица „1866 г.“, улица с историческо значение за Крит, тъй като именно в тази област се състоя едно от въстанията  на критската нация в борбата за свобода от Османската империя. Туристите могат да закупят храна, напитки, дрехи, обувки  и сувенири",
                    MinPeopleNeeded = 20,
                    Price = 50m,
                    OrganizedOfferDayId = 9
                },
                new Activity()
                {
                    Id = 6,
                    Name = "Остров Спиналонга",
                    Description = "Остров Спиналонга е една от емблематичните забележителности в района на остров Крит. Малко островче, намиращо се във водите на залива Мирабело. Това място е известно още като остров Лепер, тъй като там прокажените от остров Крит и останалата част на Гърция са били под карантина до 1957 г. През 16-ти век венецианците са превърнали острова в непристъпна крепост, за да контролират достъпа до залива на Елунда. Старото име на острова е Калидон. След като турците превземат Крит през 1669 год., остров Спиналонга остава под венецианско владение още 46 години до 1715 г. Превземайки го, турците се настаняват на него, използвайки вече построеното от венецианците. Това продължава дори и след като Гърция извоюва своята независимост. Така през 1903 година гръцкото правителство взело решение да изолира болните от проказа от цяла Гърция на остров Спиналонга. Проказата е коварна и силно заразна болест. Така без да имат избор турците избягали пред страха от силната зараза и Спиналонга станал и фактически гръцки. Колонията на прокажените просъществувала от 1903 до 1957 година, когато е открито лекарството за проказата.\r\nСлед като пристигнетето в град Елунда с малко корабче се пътува до остров Спиналонга, след разглеждането нa крепостта с местен екскурзовод, туристите се връщат в град Елунда, където обядват. Следва отпътуване за град Агиос Николос, където туристите ще имат възможност за пазаруване и разглеждане на градчето",
                    MinPeopleNeeded = 40,
                    Price = 110m,
                    OrganizedOfferDayId = 10
                },
                new Activity()
                {
                    Id = 7,
                    Name = "Сърцето на Крит",
                    Description = "Плато  Ласити - едно от най-красивите места на острова, разположено в планината Диктис на 850 метра над морското равнище. Платото е с размери - дължина 10 км и ширина 5 км. Платото, което в миналото е впечатлявало със своите 10 000 вятърни мелници и невероятна природа. Това е най-голямото и най-високото плато на Гърция! Платото Ласити е разположено в източната част на остров Крит в планината Диктис.Първата спирака е в манастира Панагия Гюверьотиса, красив манастир със стара история.\r\nСлед това се посещава селото Краси където в центъра на селото ще имаме възможност да видим вековният дъб - най-голямото дърво на остров Крит. Екскурзията продължава с посещение на манастира Кера Кардиотиса с чудотворната икона на Света Богородица, както и стенописи от 13 и 14 век. След посещението на манастира по време на обиколката на платото Ласити се преминава през село Психро, където се намира пещерата, в която според митологията е роден Зевс - бащата на всички богове и хора.\r\nСледващата спирка е селцето Мохос, където можете да се разходите по живописни улици на градчето или просто да изпиете чаша традиционно гръцко кафе. Разходката продължава с посещение на Еко Парк Ласинтос - традиционно критско село, което ще ни запознае с живота и традициите на местното население. Тук можете да видите действащ тъкачен стан, процеса на производството на свещи, грънчарски колела и на планински мед и билки. Тук се произвежда и могат да се дегустират безплатно зехтин, ликьори, вина, сирена, маслинова паста.\r\nСвободно време и възможност за обяд",
                    MinPeopleNeeded = 40,
                    Price = 100m,
                    OrganizedOfferDayId = 11
                },
                new Activity()
                {
                    Id = 8,
                    Name = "Остров Санторини",
                    Description = "Ако не сте били на остров Санторини, а сте стигнали до остров Крит означава, че тази екскурзия е като задължителна за Вас – оставете се да бъдете очаровани от перлата на Цикладите!\r\nВече е възможно да пътувате с кораб и да бъдете на острова за около 2 часа. \r\nСанторини по същество е това, което остава след огромно вулканично изригване, което унищожава най-ранните селища и създаде сегашната геоложка калдера. Тази Калдера е с размери около 84 кв. км. и е заобиколена от 300 м високи стръмни скали от трите страни",
                    MinPeopleNeeded = 50,
                    Price = 180m,
                    OrganizedOfferDayId = 12
                },

                new Activity()
                {
                    Id = 9,
                    Name = "Oтпътуване за град Нидри за целодневен круиз с кораб (продължителност 9 часа)",
                    Description = "Порто Кацики или Егремни - най-красивите плажове на острова с възможност за скачане и плуване в кристалната вода на Йонийско море; остров Кефалония със свободно време в градчето Фискардо; остров Итака с възможност за разходка или плаж на острова на Одисей; пещерите на остров Меганиси; трите острова на семейство Онасис - Скорпиос, Спарти и Скорпиди; остров Мадури, известен със своята вечнозелена растителност",
                    MinPeopleNeeded = 25,
                    Price = 210m,
                    OrganizedOfferDayId = 15
                },
                new Activity()
                {
                    Id = 10,
                    Name = "Oтпътуване за Парга за целодневен круиз с корабче",
                    Description = "Остров Антипаксос с възможност за плуване в топлите и чисти води на Йонийско море; Сините пещери, известни с причудливите си форми, образувани през годините от морските води; остров Паксос с посещение на столицата Гайос и свободно време за разходка и обяд в някоя от местните рибни таверни",
                    MinPeopleNeeded = 25,
                    Price = 170m,
                    OrganizedOfferDayId = 16
                },
                new Activity()
                {
                    Id = 11,
                    Name = "Oбиколка на острова",
                    Description = "Посещение на: град Лефкада - Централният площад, църквата „Св. Спиридон“, построена през 1685 г. от венецианците, кметството, църквата „Св. Мина“ и катедралата; манастира \"Панагия Фанеромени\" - най-важният религиозен център на острова, построен през 1634 г. върху руините на древен храм, посветен на богинята Артемида; плажа „Катизма“ - един от най-добрите на острова",
                    MinPeopleNeeded = 15,
                    Price = 60m,
                    OrganizedOfferDayId = 17
                },

                new Activity()
                {
                    Id = 12,
                    Name = "Панорамна обиколка на остров Тасос",
                    Description = "Посещение на златарско ателие \"Iris Gold\", традиционна фабрика за производство на зехтин и манастира \"Св. Архангели\". Пешеходна разходка в столицата Лименас",
                    MinPeopleNeeded = 10,
                    Price = 60m,
                    OrganizedOfferDayId = 21
                },


                new Activity()
                {
                    Id = 13,
                    Name = "Екскурзия до: град-държава Ватикана; Площадите на Рим",
                    Description = "Екскурзия до: град-държава Ватикана; Площадите на Рим",
                    MinPeopleNeeded = 25,
                    Price = 80m,
                    OrganizedOfferDayId = 26
                },
                new Activity()
                {
                    Id = 14,
                    Name = "Екскурзия Колизеум и Римски форуми",
                    Description = "Екскурзия Колизеум и Римски форуми",
                    MinPeopleNeeded = 25,
                    Price = 70m,
                    OrganizedOfferDayId = 27
                },
                new Activity()
                {
                    Id = 15,
                    Name = "Екскурзия до Тиволи",
                    Description = "екскурзия до Тиволи",
                    MinPeopleNeeded = 25,
                    Price = 75m,
                    OrganizedOfferDayId = 28
                },

                new Activity()
                {
                    Id = 16,
                    Name = "Каляри и Баруминим",
                    Description = "Посещение на столицата Каляри – един от най-зелените градове на остров Сардиния. Разглеждане на стария град, откъдето се откриват прекрасни гледки към залива и пристанището. Тук са запазени и старите защитни стени, както и две кули от 13 век. Впечатляваш образец за съвременно развитие на град в централното Средиземноморие\r\nОтпътуване за археологическия обект Су Нураги в район Барумини. Су Нураги е древен град на народа нураги, населявал Сардиния през бронзовата епоха. Градът е построен в периода 17 - 13 век пр. Хр. и се състои от крепост с наблюдателни кули и жилищна зона, която заобикаля укреплението. Добре запазените останки от града са включени в Списъка за световно културно и природно наследство на ЮНЕСКО през 1997 г. Това е единствения начин да усетите в пълна степен цивилизацията на нурагите",
                    MinPeopleNeeded = 30,
                    Price = 150m,
                    OrganizedOfferDayId = 39
                },
                new Activity()
                {
                    Id = 17,
                    Name = "Коста Смералда",
                    Description = "Отпътуване от хотела за посещение на третия в Европа най-посещаван град от най-богатите хора в света – Коста Смералда. Изумрудения бряг или скъпоценният камък на остров Сардиния е изключително оживен и елегантен, градчето е символ за разточителството и лукса, които изпълват атмосферата. Това е едно екологично чисто кътче, при което и най-малката подробност е в пълна хармония със заобикалящия го приказно-красив пейзаж.\r\nВАЖНО: Предвидено е време за плаж",
                    MinPeopleNeeded = 30,
                    Price = 100m,
                    OrganizedOfferDayId = 40
                },
                new Activity()
                {
                    Id = 18,
                    Name = "Сасари и Кастелсардо",
                    Description = "Посещение на втория по големина град на остров Сардиния и една от най-предпочитаните дестинации за посещение от туристите, а именно градчето Сасари със своят неповторим и автентичен чар. Сасари е модерен град, който пази история още от неолита\r\nПрез ІХ-Х век в града се заселват римляни, благодарение на които и до днес са запазени изключителни забележителности. Възможност за разглеждане на забележителностите: Централния площад с паметника на Виктор Емануил, Катедралата, посветена на Св. Николас в готически стил от ХІІІвек, Крепостните стени от ХІІІ век\r\nОтпътуване за приказното пристанищно градче Кастелсардо кацнало върху скала на брега на морето",
                    MinPeopleNeeded = 30,
                    Price = 80m,
                    OrganizedOfferDayId = 41
                },
                new Activity()
                {
                    Id = 19,
                    Name = "Архипелага Магдалена (Ла Мадалена)",
                    Description = "Архипелага Магдалена (Ла Мадалена) е островна група, която се състои от над 60 острова, разположена североизточно от остров Сардиния. Изумява туристите със спиращите дъха гледки към прозрачните води в тази част на Средиземно море\r\nОтпътува се рано сутринта с автобус към град Палау. От пристанището в Палау се отпътува към архипелага Магдалена с туристически кораб. Посещение на 2 от големите острова на архипелага. Свободно време за плаж и снимки. Акостиране на пристанището в Палау и отпътуване с автобус към хотела\r\nВАЖНО: Свободно време за плаж – препоръчваме да носите бански и плажни принадлежности",
                    MinPeopleNeeded = 30,
                    Price = 190m,
                    OrganizedOfferDayId = 42
                },
                new Activity()
                {
                    Id = 20,
                    Name = "Корсика",
                    Description = "Посещение на остров Корсика или още познат като „Островът на красотата“. Изключителната природна красота на острова, привлича ежегодно много туристи. Една трета от острова е и Регионален природен парк „Корсика“. Тук могат да се срещнат много и различни плодове, като лимони, портокали, маслини, грозде и добре познатите плодове на кактуси. Тук можете да се насладите на прекрасни природни феномени, закътани морски заливи и бели плажове. Едно от нещата, които най-много впечатляват посетителите са: красивите римски храмове, църквите в романски стил, както и готическите и барокови катедрали\r\nВАЖНО: Възможно е ползването на туристическо влакче (по желание) – около 8 евро на човек в две посоки",
                    MinPeopleNeeded = 30,
                    Price = 190m,
                    OrganizedOfferDayId = 43
                },
                new Activity()
                {
                    Id = 21,
                    Name = "Алгеро",
                    Description = "Панорамна обиколка на едно от най-красивите градчета на остров Сардиния. Градчето е известно със своята изключително добре запазена типичната архитектура от Каталуния. Едни от най-известните забележителности са запазените Крепостни стени, порти и кули, най–високата от които е Торе де Сулис със своите 22 метра, а кулата Торе ди Порта е събрала най-интересните разкази за историята на прекрасното градче Алгеро. Алгеро е известно също така и със своите приказни плажове, където многобройните посетители ежедневно събират тен или се отдават на спортове, като – сърф, водни, каяк и други",
                    MinPeopleNeeded = 30,
                    Price = 120m,
                    OrganizedOfferDayId = 44
                },

                new Activity()
                {
                    Id = 22,
                    Name = "Сен Пол дьо Ванс + Кан и Сен Тропе",
                    Description = "Посещение на китното селце Сен Пол дьо Ванс (12 км) и пешеходен тур в средновековния град, чийто старинен чар не се е изгубил въпреки стичащите се тук тълпи през пиковия сезон. Типично френско селце, вдъхновило с красивата си природа множество артисти, поети и художници, сред които Джакомети, Миро, Калдер, Матис и Кандински, чиито произведения живеят тук за постоянно\r\nОтпътуваме за Кан (25 км), където с пешеходната обиколка ще посетим двукилометровия булевард Кроазет, който със своите палми и тропическа растителност е като изваден от Холивуд. На този булевард се намира и хотел Карлтън, където отсядат и световно известните личности по време на Филмовият фестивал.\r\nПродължаваме към Сен Тропе (88 км), който е един от най-известните курорти за почивка и е любимата дестинация на хиляди туристи за заслужен отдих. Прекрасните плажове на Сен Тропе придават на града неповторим чар. Всяка година в началото на Октомври се провежда и традиционната международна регата",
                    MinPeopleNeeded = 25,
                    Price = 130m,
                    OrganizedOfferDayId = 47
                },
                new Activity()
                {
                    Id = 23,
                    Name = "Монако и Монте Карло",
                    Description = "Отпътуване от хотела около 08:00 часа към Княжество Монако - перлата на Лазурния бряг, която предлага исторически и културни забележителности, тропическа растителност и безброй мероприятия - всичко създадено с цел да доставя удоволствие на многобройните туристи. Дворецът на фамилия Грималди - основатели на Княжеството, които превръщат миниатюрната държава в едно от най-проспериращите места в света и го управляват и до днес; Катедралата, където са погребани членове на фамилия Грималди. Възможност за посещение на Океанографския музей на Жак-Ив Кусто, представящ огромна колекция от морска флора и фауна, модели на изследователски кораби, аквариум с повече от 4000 представители на средиземноморската и тропическата екосистема\r\nПродължаваме към Монте Карло, квартал на Монако, един от най - богатите. Някога хората са го смятали за столица на Монако. В Монте Карло се намира най-известната писта на Формула 1. Състезанието преминава по улиците на града. Най-известните участъци от пистата са завоя „Фибата“ и „Тунела“. Днес Монте Карло освен като символ на Формула едно се слави и като туристическа дестинация. В града има много интересни забележителности, сред които са Катедралата на Монако, Музеят на Наполеон и Дворецът на принца на Монако. Известна атракция е и Големият Театър на Монте Карло – опера и балетна къща, комплексът от казина.\r\nПоследна наша спирка ще е Ментон, смятан за едно от най-очарователните и живописни места по Ривиерата, поради което е наречен \"Перлата на Франция\". Старият средновековен град на Мантон мигновено става любим на туристите със своите извити тесни улички, по които светят фенери. Звучи романтично, нали? Освен тях, силно впечатление правят великолепните градини в града, като една от най-посещаваните е Вал Рахме, създадена от сър Пърси Радклиф в чест на любимата му съпруга. Друга впечатляваща градина е Сере де ла Мадоне, дело на известния градинар Лорънс Джонстън",
                    MinPeopleNeeded = 25,
                    Price = 140m,
                    OrganizedOfferDayId = 48
                },

                new Activity()
                {
                    Id = 24,
                    Name = "Bonjour Paris",
                    Description = "Пешеходна обиколка с  екскурзовод на български език: посещение на   Латинския квартал - остров  Ла Сите, Нотр Дам, Съдебната палата, Сорбоната, Пантеона, Люксембургската градина с Двореца, крепостта Консиержери, разходка с панорамно корабче по Сена, посещение на Айфеловата кула, Марсово поле",
                    MinPeopleNeeded = 15,
                    Price = 110m,
                    OrganizedOfferDayId = 51
                },
                new Activity()
                {
                    Id = 25,
                    Name = "Пешеходна обиколка",
                    Description = "Посещение на операта „Гарние”, площад „Вандом” с  колона на Наполеон, ул. „Риволи”, Лувъра, градините на двореца „Тюйлери”, площад „Конкорд”, Парламента, Домa на инвалидите с гроба на Наполеон, мостa „Александър III”,  Триумфалната арка, Шан-з-Елизепосещение на операта „Гарние”, площад „Вандом” с  колона на Наполеон, ул. „Риволи”, Лувъра, градините на двореца „Тюйлери”, площад „Конкорд”, Парламента, Домa на инвалидите с гроба на Наполеон, мостa „Александър III”,  Триумфалната арка, Шан-з-Елизе",
                    MinPeopleNeeded = 20,
                    Price = 130m,
                    OrganizedOfferDayId = 52
                },

                new Activity()
                {
                    Id = 26,
                    Name = "Шедьоврите на Гауди",
                    Description = "Целодневна екскурзия Шедьоврите на Гауди – световно наследство под закрилата на ЮНЕСКО",
                    MinPeopleNeeded = 15,
                    Price = 130m,
                    OrganizedOfferDayId = 56
                },
                new Activity()
                {
                    Id = 27,
                    Name = "Абатство Монсерат с Черната Мадона",
                    Description = "Екскурзия до Абатство Монсерат с Черната Мадона ",
                    MinPeopleNeeded = 15,
                    Price = 90m,
                    OrganizedOfferDayId = 57
                },

                new Activity()
                {
                    Id = 28,
                    Name = "Полудневна екскурзия до Картахена",
                    Description = "Потопете се в историята на древния град Картахена, вървейки по неговите улици, по които в миналото са преминали цивилизациите на Картахенците, Римляните и Византийците и са оставили своя отпечатък  в историята на това място. Отпътуване сутринта за Картахена. Разглеждане на пристанището, паметника на героите от Кавие, площада на общината и реновирания наскоро дворец. Спускане надолу по главната улица за разглеждане на \"Гранд Хотел\" и други впечатляващи сгради като \"Ла каса Сервантес\" и сградата на казиното. По пътя за Римския театър се минава покрай църквата \"Санта Мария ла Виеха\". Римският театър датира от първи век пр. Хр. До него могат да се видят останките от стара катедрала, бомбардирана по време на Гражданската война. Накрая разглеждане на Църквата на благотворителността с патронния светец на града. По желание има възможност за изкачване с панорамен лифт над града (цена около 1 евро), за да се видят прекрасните пейзажи, които се откриват",
                    MinPeopleNeeded = 25,
                    Price = 100m,
                    OrganizedOfferDayId = 60
                },
                new Activity()
                {
                    Id = 29,
                    Name = "Полудневна екскурзия до Мурсия",
                    Description = "Посещение на най-голямата забележителност – катедралата в Мурсия, построена върху основите на древна джамия, където могат да се видят различни художествени стилове – от готика до неокласицизъм. Разглеждане на църквата \"Сан Хуан де Диос\", разположена на площад в стария град. Екскурзията завършва с посещение на Музея на Салсийо, където могат да се видят най-големите и впечатляващи колекции от работата на великия бароков скулптор от Мурсия",
                    MinPeopleNeeded = 20,
                    Price = 80m,
                    OrganizedOfferDayId = 61
                },
                new Activity()
                {
                    Id = 30,
                    Name = "Полудневна екскурзия до Лорка",
                    Description = "Както и да го наречем, той определено се откроява с множеството архитектурни паметници – комбинация от средновековен, ренесансов и бароков стил. От палеолита до днес град Лорка е бил дом на различни култури, всяка от които е оставила своя отпечатък в историята на града. Разходката ще ни отведе през емблематичния площад \"Испания\" с катедралата \"Свети Патрик\" от 18-ти век, съдебната палата и кметството. Продължаваме към Археологическия музей, житницата от 16-ти век, църква \"Свети Франциск\" и бароковия дворец \"Гевара\" (разглеждане отвън). Най-впечатляващ обаче е средновековният замък на Лорка (Крепостта на слънцето), който се издига на хълма над града. Екскурзията до Лорка е като машина на времето, която ни връща назад в историческото минало чрез средновековните улички, архитектурните шедьоври и градската атмосфера",
                    MinPeopleNeeded = 25,
                    Price = 110m,
                    OrganizedOfferDayId = 62
                },
                new Activity()
                {
                    Id = 31,
                    Name = "Полудневна екскурзия до остров Табарка",
                    Description = "Кратко пътуване с автобус и плаване с малко корабче (около 30 мин.) ще ви отведат до остров Табарка - най- малкият населен остров на испанското средиземноморие. До края на XVIII век берберски пирати го използват като отправна точка при набезите си към брега на материка, но през 1770 крал Карлос III заселва тук няколко генуезки фамилии, с което променя съдбата на острова. Днес Табарка е исторически и морски резерват, но и защитена зона за птиците и място с множество ендемични видове. Предпочитана за туристите е атмосферата на укрепения град Сан Педро и Сан Пабло, със запазените крепостни стени и порти, главната улица \"Mayor\", чаровни малки ресторанти и магазинчета. За край на разходката можете да опитате местната кухня под сянката на някоя палма или да направите плаж на брега",
                    MinPeopleNeeded = 20,
                    Price = 100m,
                    OrganizedOfferDayId = 63
                },
                new Activity()
                {
                    Id = 32,
                    Name = "Целодневна екскурзия до Валенсия",
                    Description = "Туристическа програма във Валенсия – третият по големина испански град, съхранил хармонията на средиземноморските и испано-арабските традиции. Панорамна обиколка: архитектурно-културният комплекс \"Град на изкуствата и науките\", дело на архитекта Сантяго Калатрава и включващ впечатляващите Л’Емисферик, Музей на науките, Опера, Л’Осеанографик (най-големият аквариум в Европа); пешеходна разходка в историческият център: Арената - една от най-големите в Испания, централният площад с Кметството и Историческият музей на града, Копринената борса - шедьовър на валенсианския готически стил, включен в списъка на ЮНЕСКО за Световно културно наследство, Катедралата, строена между 1252 г. и 1482 г. върху основите на по-стара джамия; Торес де Серанoс - една от запазените средновековни порти и сградата на валенсианското правителство. Свободно време",
                    MinPeopleNeeded = 30,
                    Price = 150m,
                    OrganizedOfferDayId = 64
                },

                new Activity()
                {
                    Id = 33,
                    Name = "Целодневна екскурзия до Валенсия",
                    Description = "Градът очарова посетителите си с малки, тесни улички, внушителни сгради и паркове с портокалови и лимонови дръвчета. Пешеходна  разходка: парламентът, църквата \"Санта Каталина\", катедралата на Валенсия, Музеят на фаите. Свободно време в историческия квартал Кармен с типични тесни улички с много магазини, ресторанти и кафенета",
                    MinPeopleNeeded = 25,
                    Price = 140m,
                    OrganizedOfferDayId = 68
                },
                new Activity()
                {
                    Id = 34,
                    Name = "Полудневна екскурзия до Елче",
                    Description = "Програмата включва - транспорт с автобус, екскурзоводско обслужване на български език, панорамен тур на Стария град, базиликата Санта Мария, Кулата Калхора, двореца Алтимира, Арабските бани. Елче е разположен на двата бряга на река Виналопо и е едно от най-старите населени места на Иберийския полуостров. Елче е обявен за най-добър европейски град за отглеждане на палми. Тук има ботаническа градина с всички видове палми, които растат на Земята, както и цитрусови дървета, кактуси и бамбук. Друга голяма забележителност на града е \"Мистерията на Елче\" - традиционен средновековен празник, включен в Списъка на ЮНЕСКО като културен шедьовър",
                    MinPeopleNeeded = 25,
                    Price = 110m,
                    OrganizedOfferDayId = 69
                },
                new Activity()
                {
                    Id = 35,
                    Name = "Полудневна екскурзия до Гуадалест",
                    Description = "Планинско селце, основано от маврите, разположено на 600 м. надморска височина, сгушено на самотно, но много красиво място. Красиви замъци се издигат между гранитни скали, сливащи се в едно със заобикалящата ги природа. Преди да пристигнете в долината на Гуадалест, пътувайки по планински криволичещи пътища, ще минете през няколко други очарователни малки селца. Едно от тях е Ла Нуция, с великолепна гледка към Средиземно море, така и към заобикалящите го планини. Фотопауза в красивото малко селце Полоп и посещение на магазин за типични местни продукти като мед, плодове, вина",
                    MinPeopleNeeded = 20,
                    Price = 100m,
                    OrganizedOfferDayId = 70
                },
                new Activity()
                {
                    Id = 36,
                    Name = "Вечерно фламенко шоу",
                    Description = "Вечерно фламенко шоу",
                    MinPeopleNeeded = 10,
                    Price = 70m,
                    OrganizedOfferDayId = 71
                },

                new Activity()
                {
                    Id = 37,
                    Name = "Целодневна екскурзия до Валенсия",
                    Description = "Градът очарова посетителите си с малки, тесни улички, внушителни сгради и паркове с портокалови и лимонови дръвчета. Пешеходна  разходка: парламентът, църквата \"Санта Каталина\", катедралата на Валенсия, Музеят на фаите. Свободно време в историческия квартал Кармен с типични тесни улички с много магазини, ресторанти и кафенета",
                    MinPeopleNeeded = 25,
                    Price = 140m,
                    OrganizedOfferDayId = 76
                },
                new Activity()
                {
                    Id = 38,
                    Name = "Полудневна екскурзия до Елче",
                    Description = "Програмата включва - транспорт с автобус, екскурзоводско обслужване на български език, панорамен тур на Стария град, базиликата Санта Мария, Кулата Калхора, двореца Алтимира, Арабските бани. Елче е разположен на двата бряга на река Виналопо и е едно от най-старите населени места на Иберийския полуостров. Елче е обявен за най-добър европейски град за отглеждане на палми. Тук има ботаническа градина с всички видове палми, които растат на Земята, както и цитрусови дървета, кактуси и бамбук. Друга голяма забележителност на града е \"Мистерията на Елче\" - традиционен средновековен празник, включен в Списъка на ЮНЕСКО като културен шедьовър",
                    MinPeopleNeeded = 25,
                    Price = 110m,
                    OrganizedOfferDayId = 77
                },
                new Activity()
                {
                    Id = 39,
                    Name = "Полудневна екскурзия до Гуадалест",
                    Description = "Планинско селце, основано от маврите, разположено на 600 м. надморска височина, сгушено на самотно, но много красиво място. Красиви замъци се издигат между гранитни скали, сливащи се в едно със заобикалящата ги природа. Преди да пристигнете в долината на Гуадалест, пътувайки по планински криволичещи пътища, ще минете през няколко други очарователни малки селца. Едно от тях е Ла Нуция, с великолепна гледка към Средиземно море, така и към заобикалящите го планини. Фотопауза в красивото малко селце Полоп и посещение на магазин за типични местни продукти като мед, плодове, вина",
                    MinPeopleNeeded = 20,
                    Price = 100m,
                    OrganizedOfferDayId = 78
                },
                new Activity()
                {
                    Id = 40,
                    Name = "Вечерно фламенко шоу",
                    Description = "Вечерно фламенко шоу",
                    MinPeopleNeeded = 10,
                    Price = 70m,
                    OrganizedOfferDayId = 79
                },

                new Activity()
                {
                    Id = 41,
                    Name = "Целодневна екскурзия до Остров Хиос",
                    Description = "Целодневна екскурзия до остров Хиос. След закуска ще преминем с ферибот (40 мин) до остров Хиос (Гърция) - пети по големина от гръцките острови. Добре дошли в Хиос - скрито съкровище в Егейско море, чакащо своите откриватели. Ароматен и гостоприемен през цялата година, Хиос е своеобразна палитра от картини и преживявания. Ще започнем с Пирги - най-голямото и красиво селище след столицата Хиос (Хора). Това изумително кътче може да послужи за вдъхновение на художник или като декор за нетрадиционен филм. Къщите са украсени от горе до долу с рисувани елементи на животни, цветя и геометрични фигури. Ефекта е едновременно деликатен и зашеметяващ. Ще се отправим към манастира „Неа Мони“ – най-важният паметник на острова, включен в списъка на ЮНЕСКО за световното културно наследство. Построен през 11-ти век от византийския император Константин IX Мономах, той е един от най-красивите и стари манастири в Гърция. Разположен на хълм, сгушен сред кипарисови и маслинови дървета, той е пример за прекрасната византийската архитектура и тук се намират световноизвестните зашеметяващи мозайки. Ще продължим към столицата на острова. Ще разгледаме византийската крепост, стария квартал, площад Фруриу, църквата „Агиос Георгиос“ и търговския квартал",
                    MinPeopleNeeded = 25,
                    Price = 170m,
                    OrganizedOfferDayId = 110
                },
                new Activity()
                {
                    Id = 42,
                    Name = "Целодневна екскурзия до Измир",
                    Description = "Екскурзия до Измир. Днес ще посетим забележителния съвременен град Измир или древна Смирна. Измир е третият по големина град в Турция и един от най-големите търговски центрове в страната, благодарение на ключовото географско разположение на брега на Егейско море. Градът е едно от най-старите селища в Средиземноморския басейн и съществува повече от 3500 години. Древна Смирна е била една от най-развитите култури, сравнима дори с Троя. Апогея в своето развитие градът бележи между 650 г. до 545 г. пр. Хр. По време на нашата обиколка с местен екскурзовод ще разгледате Агората на хълма Кадифекале, Етнографския музей, Асансьорът на Измир – построен от местен жител през 1907 г. и някога задвижван със силата на водата. Днес той е електрифициран и предоставя на посетителите прекрасна панорамна гледка и възможност за романтичен обяд или вечеря в ресторанта на върха. Ще посетите и площад „Конак“, на който величествено се извисява Часовниковата кула \"Сахат Кулеси\". Тя е красива мраморна кула, висока 25 метра и пищно украсена и декорирана. Построена е от френски архитект Пере и е и в завършена за 25-годишнината от качването на престола на Абдулхамид II през 1901 г. Свободно време на колоритният пазар Кемералтъ",
                    MinPeopleNeeded = 20,
                    Price = 130m,
                    OrganizedOfferDayId = 112
                },
                new Activity()
                {
                    Id = 43,
                    Name = "Полудневна екскурзия до Алачатъ",
                    Description = "Райското градче Алачатъ е разположено само на 9.5 км от Чешме. Това място кара сетивата на всеки посетител да ликуват, а сърцето му да бие учестено. Алачатъ е турски град с гръцка история, който днес размива границите между двете. Това любимо както на чуждестранните туристи, така и на местните жители, място, предлага на своите посетители слънчеви дни на зашеметяващите плажове, оживени нощи в баровете и ресторантите и мързеливи разходки по очарователни, сенчести калдъръмени улици. Докато се разхождате из града, наистина се чувствате като в Гърция. Старите каменни къщи са красиво реставрирани, а боядисаните в блестящи, ярки цветове врати и прозоречни капаци са увенчани елегантно от разцъфнали бугенвилии. Не пропускайте да се разходите и до вятърните мелници от XIX век, които бдят над града",
                    MinPeopleNeeded = 20,
                    Price = 100m,
                    OrganizedOfferDayId = 114
                },

                new Activity()
                {
                    Id = 44,
                    Name = "Фадо шоу с включени 2 напитки",
                    Description = "Около 22.00 ч. взимане от хотела, 22.30 ч. пристигане в ресторанта, около 00.30 - 01.00 ч. връщане в хотела",
                    MinPeopleNeeded = 10,
                    Price = 60m,
                    OrganizedOfferDayId = 117
                },
                new Activity()
                {
                    Id = 45,
                    Name = "Целодневна екскурзия до Обидуш, Назаре и Фатима",
                    Description = "Ден, през който ще посетите едни от най-известните исторически места в Португалия. Забравете настоящето и се върнете назад във времето в село Обидуш, заобиколено от крепостните стени, зад които се намират традиционни бели къщи и малки търговски улички, които водят към замъка. Отпътуване за Назаре, който в миналото е бил малко рибарско селце, а в наши дни е известен не само с риболова, но и с хубавите си плажове, прекрасната кухня и уникалните местни народни носии. Посещение на Фатима – център на католическата вяра и дестинация за поклонници от цял свят",
                    MinPeopleNeeded = 25,
                    Price = 120m,
                    OrganizedOfferDayId = 118
                },
                new Activity()
                {
                    Id = 46,
                    Name = "Екскурзия до Синтра и нос Кабо да Рока",
                    Description = "Екскурзия до Синтра - приказен град на феи и добри вълшебници, лятна резиденция на португалското кралско семейство от 12 в., включена в списъка на ЮНЕСКО за световно културно наследство и нос Кабо да Рока - най-западната точка на Европейския континент, където \"свършва Земята и започва Морето\"",
                    MinPeopleNeeded = 20,
                    Price = 130m,
                    OrganizedOfferDayId = 119
                },

                new Activity()
                {
                    Id = 47,
                    Name = "Екскурзия до Дрезден",
                    Description = "Пешеходна разходка - комплекса Цвингер, Оперния площад, Кралската катедрала, катедралата Фрауенкирхе. Свободно време и възможност за посещение на музеи - бароковия дворец \"Цвингер”, прочут с Музея на порцелана, Оръжейния музей и една от най-богатите картинни галерии в света, известна с шедьовъра на Рафаело – \"Сикстинската Мадона”. * Входните такси на музеите не са включени в цената на тура",
                    MinPeopleNeeded = 20,
                    Price = 120m,
                    OrganizedOfferDayId = 121
                },
                new Activity()
                {
                    Id = 48,
                    Name = "Екскурзия до Карлови Вари",
                    Description = "Един от най-старите европейски балнео-курорти, известен с лечебния ефект на горещите си минерални извори, Бехеровката и стъкларските изделия",
                    MinPeopleNeeded = 20,
                    Price = 110m,
                    OrganizedOfferDayId = 122
                },

                new Activity()
                {
                    Id = 49,
                    Name = "Екскурзия до ранчо и среща с гаучоси в пампата",
                    Description = "Ще тръгнем в 09.00 ч. сутринта, за да прекараме един ден сред типичната среда на аржентинските гаучоси. Тук  ще имате възможност да участвате или наблюдавате обяздване на коне, да наблюдавате шоу на гаучосите с танци и да опитате от  чая мате. Очаква ви вкусен обяд с местни специалитети  и напитки",
                    MinPeopleNeeded = 20,
                    Price = 180m,
                    OrganizedOfferDayId = 127
                },
                new Activity()
                {
                    Id = 50,
                    Name = "Еднодневна екскурзия с ферибот до Монтевидео",
                    Description = "Тръгване от хотела в 06.15 ч. В 08.00 ч. – отплаване с кораб от пристанището на Буенос Айрес. В 11.00 ч. - пристигане в Монтевидео. Следва туристическа обиколка: Площада на Независимостта, Сградата на Парламента, театър Солис, закрития пазар на Монтевидео. Обиколката продължава с посещение на аристократичния квартал Карраско, Крайбрежния булевард с хубавите плажове, откъдето имате възможност да се наслаждавате на панорамата на града. В 16.00 ч.- посещение на шопинг центъра “Пунта Каретас”. В 17.00 ч.- трансфер до пристанището. В 19.00 ч. – отпътуване за Буенос Айрес",
                    MinPeopleNeeded = 35,
                    Price = 210m,
                    OrganizedOfferDayId = 128
                },

                new Activity()
                {
                    Id = 51,
                    Name = "Посещение на нощен клуб Rio Scenarium",
                    Description = "Организирано посещение на един от най-ярките нощни клубове Rio Scenarium, където ще се насладите на еклектичната атмосфера, ще пиете кайпириня и ще може да потанцувате под горещите латино ритми",
                    MinPeopleNeeded = 15,
                    Price = 120m,
                    OrganizedOfferDayId = 149
                },
                new Activity()
                {
                    Id = 52,
                    Name = "Посещение на съседния град Нитерой",
                    Description = "Ще разгледаме Музея на съвременното изкуство. Футуристичната сграда е завършена през 1996 г. и често я наричат „космическо творение“ и „летяща чиния“. Едни от най-ценните и незабравими „експонати“ вътре са отраженията на Захарната глава и на Корковадо в стъклената фасада. Крепостта Санта Круз ще ни разкрие своите тайни и допълнително ще ни омагьоса с невероятните гледки към Рио. Тази крепост е от 1555 г. и е основното фортификационно съоръжение в залива, привличаща и до днес хиляди търсачи на история и допълваща знанията им за живота и отбраната в колониалната и имперската епохи. Днес Санта Круз е действащо съоръжение и се охранява от щаба на Артилерийската дивизия. Включен обяд в местен ресторант",
                    MinPeopleNeeded = 25,
                    Price = 140m,
                    OrganizedOfferDayId = 150
                },
                new Activity()
                {
                    Id = 53,
                    Name = "Фолклорно шоу в ресторант Рафаин Катаратас",
                    Description = "Тук ще наблегнете на първокласната бразилска скара и ще имате възможност да опитате традиционни деликатеси и многобройните местни салати, основни ястия и десерти",
                    MinPeopleNeeded = 20,
                    Price = 170m,
                    OrganizedOfferDayId = 151
                },

                new Activity()
                {
                    Id = 54,
                    Name = "Целодневна екскурзия до площад Тиенанмън, Забранения град и „Храма на небето“",
                    Description = "Площад Тиенанмън е един от най-впечатляващите и големи площади в света, намиращ се в центъра на Пекин и способен да побере над един милион души. Площадът носи името на вратата „Тиенанмън“ (в буквален превод „Вратата на небесното спокойствие“), построена в северната част на площада, която го отделя от Забранения град. Тук се намира мавзолеят на видния китайски политик Мао Дзъдун. Следва посещение на Забранения град, където ще се впечатлите от залите и градините на най-голямата древна дворцова структура в света. Това е най-добре запазеният императорски дворец в Китай и място с голямо историческо значение (затворен всеки понеделник). Градът получава името си, защото дворцовият комплекс е бил недостъпен за обикновените китайци. Всеки, който е бил хванат да нахлува в Забранения град без разрешение, бива подлоган на строго наказание, включително екзекуция. Изключителността на Забранения град имала за цел да подчертае божествения и върховен статут на императора като син на небето. Храмът на Небето представлява даоистки комплекс, състоящ се от храмови сгради. Разположен е на мраморна тераса в южната част на Пекин в парка \"Тиантан\". Построен е на три етажа, над които се издигат конусовидни покриви, направени от над 50 000 тъмносини глазирани керемиди и е най-добре запазилият се архитектурен паметник от династията Мин. Тук императорите са идвали, за да се молят на боговете за милост и за добра реколта. Церемонията за почитането на небето била най-специалната дейност на императорите от династият Мин и Цин- нещо, което обикновените хора нямат право да извършат",
                    MinPeopleNeeded = 25,
                    Price = 140m,
                    OrganizedOfferDayId = 176
                },
                new Activity()
                {
                    Id = 55,
                    Name = "Посещение на Великата китайска стена",
                    Description = "Juyongguan е един от трите най-известни маршрути по Великата китайска стена, заедно с Jiayuguan и Shanhaiguan. Намира се на 75 км северозападно от Пекин и минава през уникална планинска природа. Juyongguan е строен през 770-475 г. пр.н.е. и има дължина 2484 мили. Изкачването до върха е невероятно. Тази част от стената се състои от 14 високи и стръмни наблюдателни кули, които осигуряват прекрасна гледка към хълмовете. На връщане ще се отправите към парка Олимпия и Националния стадион в Пекин, наричан „Птиче гнездо“, заради футуристичния си дизайн – едно от най-внушителните съоръжения в Китай, където ще имате фото пауза",
                    MinPeopleNeeded = 20,
                    Price = 130m,
                    OrganizedOfferDayId = 177
                },
                new Activity()
                {
                    Id = 56,
                    Name = "Посещение на Летния дворец и Храма на Лама „Yonghe Temple“ ",
                    Description = "Сградите и дворовете на Летния дворец са красиво декорирани и заредени с много история. На негова територия се намира най-добре запазената и най-голямата императорска градина, съществуваща в Китай. Ще направите разходка с лодка до Хълма на дълголетието (предлага се на място) \r\nСледва посещение на храма „Yonghe Temple“ или Храм Лама. Храмът Лама е един от най-колоритните и оживени храмове в Пекин. Известен със своите извити покриви, страхотни стенописи, великолепни декоративни арки, гоблени, огледала и тантрически статуи, смесващи се в плътни облаци тамян. Това е най-големият будистки манастир извън Тибет, който е бил построен като имение за император Йончжън от династията Цин, когато той е бил принц",
                    MinPeopleNeeded = 25,
                    Price = 135m,
                    OrganizedOfferDayId = 178
                },

                new Activity()
                {
                    Id = 57,
                    Name = "Полудневна екскурзия до остров Сентоса",
                    Description = "Островът е най-посещаваната градска атракция, считан за прародител на Сингапурските паркове – с музеи, аквариуми, паркове, алеи за разходка и езда, невероятни плажове, ресторанти и барове. С автобус имате възможност да разгледате острова и да спирате при всяка атракция: статуята на Мерлиона, който е полу-риба/полу-лъв и е символът на Сингапур, Аквариума, Делфинариума, където имате възможност да видите шоуто на делфините и др. Свободно време с възможност за плаж. Вечерта – посещение на шоуто ”Светлина и звук“, където танцът на цветните фонтани, създаден с най-модерната техника ще Ви достави невероятно удоволствие",
                    MinPeopleNeeded = 25,
                    Price = 120m,
                    OrganizedOfferDayId = 184
                },

                new Activity()
                {
                    Id = 58,
                    Name = "Полудневна екскурзия подводница Submarine",
                    Description = "Ако не обичате да плувате, но желаете да разгледате вълшебния свят под повърхността на водата, то задължително се възползвайте от екскурзията с туристическата подводница Submarine. Подводницата се спуска на 25 метра дълбочина под водата, сред цветовете на Червено море, където за един час ще може да се насладите на изобилие от красиви корали и множество морски рибни видове. Ще се запознаете отблизо с естествената водна среда на едни от най-атрактивните морски обитатели. Продължителност около 3 часа",
                    MinPeopleNeeded = 15,
                    Price = 140m,
                    OrganizedOfferDayId = 198
                },
                new Activity()
                {
                    Id = 59,
                    Name = "Целодневна екскурзия Луксор",
                    Description = "Хиляди туристи от целия свят всяка година избират Луксор за своя ваканционна дестинация, за да се насладят на тези паметници на историята и архитектурата. Луксор е идеалното място и за онези, които са решили да посетят Горен Египет. В Луксор е и крайната спирка на корабните пътешествия по река Нил. Отпътуване от хотела около 04:30 ч. за Луксор – древната столица на египетските фараони. Посещение на Карнак - най-големият религиозен комплекс в света, който заема площ от 840 декара. Той е бил известен на древните египтяни като Ипет-Исут (най-святото място) и представлява град от храмове, обособен в 3 зони, посветени на върховният бог Амон, бог Монту и богинята Мут. Най-значителното здание в комплекса е храмът на Амон Ра – истински архитектурен шедьовър, включващ огромна колонна зала, различни храмови помещения и 10 пилона, най-големият от които е 113 м. Разглеждане на Алеята на сфинксовете, която свързва Луксорския и Карнакския храм, с общата дължина около 5 км. По алеята се извършвало шествието на фараоните до карнакския храм. Отпътуване към Долината на царете - пустинна равнина, заобиколена от стръмни хълмове. Разположена е на западния бряг на Нил, близо до град Тива. Тук се намира прочутата гробница на фараона Тутанкамон – една от 62-те открити гробници досега. Посещение на изумителният храм на Хатшепсут – първата жена фараон, управлявала Египет две мирни десетилетия Разглеждане Колосите на Мемнон – две масивни каменни статуи, които представят фараона Аменхотеп III в седнало положение, с ръце на коленете и поглед, насочен на изток към реката и изгряващото слънце. Посещение на местна фабрика за алабастър и музея на папируса",
                    MinPeopleNeeded = 20,
                    Price = 160m,
                    OrganizedOfferDayId = 199
                },
                new Activity()
                {
                    Id = 60,
                    Name = "Целодневна екскурзия Super safary",
                    Description = "Отпътуване от хотела към 13 ч. от хотела. Ще можете да видите същността на ландшафта в пустинята – долините и красивите пясъчни планини с червеникавият им оттенък. Запознанството Ви с Египет ще е непълно, ако пропуснете пътуване в пустинята на сафари. Ще имате възможност да се сдобиете с неповторими впечатления от препускането с джипове по дюните, екстремното шофиране на квадроцикли и двуместни бъгита. Ще яздите камила и ще се запознаете отблизо с живота в пустинята, ще посетите малък зоопарк и терариум, ще се насладите на фолклорно шоу (танура, ориенталски танци, огнено шоу). Продължителност на екскурзията около 8 часа",
                    MinPeopleNeeded = 20,
                    Price = 110m,
                    OrganizedOfferDayId = 200
                },
                new Activity()
                {
                    Id = 61,
                    Name = "Целодневна екскурзия Кайро и Пирамидите в Гиза",
                    Description = "Екскурзия до Пирамидите – едно от Седемте чудеса на Древния свят и Сфинкса в Гиза – най-големият, най-старият и най-известният от безбройните запазени сфинксове в Египет. Отпътуване от хотела около 02:00 ч. Пирамидите в Гиза от дълго време са най-посещаваната атракция около Кайро. От времето на тяхното изграждане пирамидите в Гиза въплъщават древността, мистерията – и дават повод за невероятни хипотези. Пирамидата на Хеопс е най-старата в Гиза и най-голямата в света, изградена ок. 2500 г. пр.н.е. от близо 2,3 милиона варовикови блокове, тежащи средно по 2,75 тона и придвижвани от 100 000 роби. Трите по-малки пирамиди в съседство принадлежат на Хеопсовите царици или сестри. Посещение на Египетския музей, който пази най-голямата колекция с антики от времето на фараоните в света. В музея има 160 000 артефакти, покриващи 5000 годишна история",
                    MinPeopleNeeded = 20,
                    Price = 130m,
                    OrganizedOfferDayId = 201
                },
                new Activity()
                {
                    Id = 62,
                    Name = "Полудневна екскурзия – Дайвинг в красивите рифове на Червено Море",
                    Description = "Едно от най-предпочитаните места за гмуркане в света се намира в Египет. В подводния резерват, между разноцветни коралови рифове (тук виреят над 150 вида корали), можете да наблюдавате живота на хиляди морски обитатели. Червено море е описвано като „коридор на чудесата“за гмуркане. Отпътуване от хотела към 8 ч. сутринта. Подводният свят е очарователен, пълен с живот и цветове, непроучен и загадъчен и затова е още по-привлекателен. Гмуркането е начин да се опознае този свят, удивително съчетаващ в себе си нови впечатления, наслада от богатството на подводния свят. Морето е известно със своята разнообразна фауна и впечатляващата чистота на водата, с видимост, която често превишава 45 метра. Голяма част от уникалността на гмуркането в Червено море се дължи на впечатляващото припокриване на ярката красота на пустинята и истинската райска градина във водите на Червено море. Около 10 процента от животинските видове в Червено море не се срещат никъде другаде на Земята. Ще имате възможност да се насладите на гмуркане, прекрасна разходка с лодка и риболов и да наблюдавате невороятният и богатит животински свят на Червено море",
                    MinPeopleNeeded = 15,
                    Price = 135m,
                    OrganizedOfferDayId = 202
                },
                new Activity()
                {
                    Id = 63,
                    Name = "Целодневна екскурзия Orange Island и шнорхелинг",
                    Description = "Едно от най-популярните места за екскурзия с лодка и шнорхелинг в Хургада. Екскурзията започва около 8:00 ч. и включва морска разходка с яхта с възможност да се насладите на красотата на един от прекрасните острови и съкровища на кораловия риф, белият пясък и слънчевите лъчи на Червено море. Слизане на плажа на острова за плуване и релакс. Обяд на яхтата. Едно от най-прекрасните места за гмуркане в целия свят е в околностите на острова. Две спирания за гмуркане в близост до коралови рифове. Като за тези, които не са любители на гмуркането няма да им е трудно също да видят и да се полюбуват на красивите морски видове, тъй като водата в Червено море е кристално бистра и чиста",
                    MinPeopleNeeded = 20,
                    Price = 140m,
                    OrganizedOfferDayId = 203
                },

                new Activity()
                {
                    Id = 64,
                    Name = "Разходка с пиратски кораб (полудневна)",
                    Description = "Едно вълнуващо плаване, спектакъл със пиратски танци и костюми на борда на кораб, на който всеки е мечтал да бъде като дете, вълнуващо се и готово да посрещтне това морско приключение. Върнете се назад във времето, когато сте мечтали да се качите на подобен кораб, да бъдете част от пиратско приключение, да покорявате нови брегове, да търсите скрити съкровища…",
                    MinPeopleNeeded = 15,
                    Price = 80m,
                    OrganizedOfferDayId = 233
                },
                new Activity()
                {
                    Id = 65,
                    Name = "Кайруан и Ел Джем (целодневна екскурзия)",
                    Description = "Екскурзията започва с посещение на Кайруан - най-святото за мюсюлманите място в Магреб и 4-ят по святост град за исляма. Ще разгледаме Окба джамия / Голямата джамия, издигната заедно с града през 670 г., и ще се отдадем на шопинг, а след това продължаваме обиколката на Кайруан с посещение на водните резервоари на града – построени преди повече от 1000 години. Продължаваме нашият маршрут до Ел Джем , където се намира най-добре запазения и трети в света амфитеатър. Това е един от най-впечатляващите паметници на световната история и именно той е послужил като декор за заснемането на незабравимия “Гладиатор”. Вечерта се връщаме в хотела",
                    MinPeopleNeeded = 20,
                    Price = 110m,
                    OrganizedOfferDayId = 234
                },
                new Activity()
                {
                    Id = 66,
                    Name = "Полудневна екскурзия - Фригиа зоопарк",
                    Description = "Friguia Park е частна зоологическа градина в Тунис, открита на 11 ноември 2000 г. близо до град Буфича. Зоологическата градина на Фригия се намира между градовете Енфида и Буфиша. Заема площ от 360 000 кв. м, за сравнение Московският зоопарк (вторият по големина зоопарк в Русия) заема 220 000 кв. м. В зоопарка са представени 61 вида от фауната на африканския континент. Общо зоологическата градина съдържа 420 животни. Паркът Фригия е първият парк за диви животни в Тунис, където всички животни се държат в относителна свобода, което позволява да се запазят естествените инстинкти и социалното поведение на представения вид. В допълнение към загражденията за животни в парка Фригия можете да видите шоу на морски лъвове, етническо шоу на зулусите, а през 2010 г. в парка беше открит първият делфинариум в Тунис",
                    MinPeopleNeeded = 15,
                    Price = 75m,
                    OrganizedOfferDayId = 235
                }
            });
        }
    }
}
