using Microsoft.EntityFrameworkCore;
using Microsoft.EntityFrameworkCore.Metadata.Builders;
using TouristAgency.Infrastructure.Data.Models.MssqlModels;


namespace TouristAgency.Infrastructure.Data.Configurations
{
    public class CruiseDayConfiguration : IEntityTypeConfiguration<CruiseDay>
    {
        public void Configure(EntityTypeBuilder<CruiseDay> builder)
        {
            builder.HasData(new CruiseDay[]
            {
                new CruiseDay()
                {
                    Id = 1,
                    DayNumber = 1,
                    Description = "16:00 ч. Начало на круиза с кораб CELESTYAL JOURNEY. Корабът потегля от пристанището в Пирея в посока Солун. Нощувка на кораба",
                    CruiseId = 1
                },
                new CruiseDay()
                {
                    Id = 2,
                    DayNumber = 2,
                    Description = "09:30 ч. Акостиране на пристанището в Солун. Свободно време за посещение и разглеждане на забележителности. Връщане на кораба. 20:00 ч. Отплаване към Кавала. Нощувка на кораба",
                    CruiseId = 1
                },
                new CruiseDay()
                {
                    Id = 3,
                    DayNumber = 3,
                    Description = "08:00 ч. Корабът акостира на пристанището в Кавала. Свободно време за посещение и разглеждане на забележителности. Връщане на кораба. 16:00 ч. Отплаване в посока Солун. Нощувка на кораба",
                    CruiseId = 1
                },
                new CruiseDay()
                {
                    Id = 4,
                    DayNumber = 4,
                    Description = "09:30 ч. Акостиране на пристанището в Истанбул. Свободно време за посещение и разглеждане на забележителности. Връщане на кораба. 20:00 ч. Отплаване в посока Дикили. Нощувка на кораба. ",
                    CruiseId = 1
                },
                new CruiseDay()
                {
                    Id = 5,
                    DayNumber = 5,
                    Description = "12:00 ч. Акостиране на пристанището в Дикили. Свободно време за посещение и разглеждане на забележителности. Връщане на кораба. 20:00 ч. Отплаване в посока Кушадасъ. Нощувка на кораба",
                    CruiseId = 1
                },
                new CruiseDay()
                {
                    Id = 6,
                    DayNumber = 6,
                    Description = "08:00 ч. Пристигане в Кушадасъ. Възможност за свободно време или допълнителна екскурзия в Кушадасъ! 23:30 ч. Отплаване в посока Патмос",
                    CruiseId = 1
                },
                new CruiseDay()
                {
                    Id = 7,
                    DayNumber = 7,
                    Description = "07:00 ч. пристигане на остров Патмос. Тук слизането на брега става с лодки и е безплатно. Патмос: Историческото минало на Патмос му е заслужила прозвището Йерусалим на Егейско море. Разположен на север от Лерос (Leros) и на юг от остров Кирил (Ikaria), Патмос се състои от три малки суши, свързани помежду си с провлак. Общата им площ е около 28 кв. км на които са разположени красиво пристанище, доста плажове, хотели и заведения, както и няколко забележителни исторически обекта. Един от тях е пещерата, където свети Йоан Богослов прекарва изгнанието си и където пише Апокалипсис. Според историята той създал своето Откровение, след като Бог му проговорил, явявайки му се през пукнатина в една скала. Днес пред пещерата има изграден малък параклис – „Света Ана”, който датира още от 11 в. Друга от забележителностите на острова е укрепеният манастир на Свети Йоан. Обителта е издигната на красиво място, което се издига на целия район на острова. В тази най-висока част на Патмос, заемана от красивия манастир има и богата библиотека, която според тукашните монаси през 17 в. е била посещавана и от български духовници. Както пещерата на Йоан Богослов, така и укрепеният манастир са включени в списъка със световното културно наследство на ЮНЕСКО. Възможност да посетите града и други забележителности с екскурзия организирана от кораба или самостоятелно! 18:30 ч. отплаване към Пирея",
                    CruiseId = 1
                },
                new CruiseDay()
                {
                    Id = 8,
                    DayNumber = 8,
                    Description = "В 07:00 ч. корабът пристига в Атина (Пирея) и следва напускане на борда. Приключване на прогрмата заредени с много положителна емоция и спомени за цял живот!",
                    CruiseId = 1
                },


                new CruiseDay()
                {
                    Id = 9,
                    DayNumber = 1,
                    Description = "10:00 ч. Начало на круиза. Корабът потегля от пристанището в Рим в посока Неапол. Нощувка на кораба",
                    CruiseId = 2
                },
                new CruiseDay()
                {
                    Id = 10,
                    DayNumber = 2,
                    Description = "07:30 ч. Акостиране на пристанището в Неапол. Свободно време за посещение и разглеждане на забележителности. Връщане на кораба. 18:00 ч. Отплаване към Палермо. Нощувка на кораба",
                    CruiseId = 2
                },
                new CruiseDay()
                {
                    Id = 11,
                    DayNumber = 3,
                    Description = "11:30 ч. Акостиране на пристанището в Палермо. Свободно време за посещение и разглеждане на забележителности. Връщане на кораба. 19:00 ч. Отплаване към Каляри. Нощувка на кораба",
                    CruiseId = 2
                },
                new CruiseDay()
                {
                    Id = 12,
                    DayNumber = 4,
                    Description = "11:00 ч. Акостиране на пристанището в Каляри. Свободно време за посещение и разглеждане на забележителности. Връщане на кораба. 17:00 ч. Отплаване към Тунис. Нощувка на кораба",
                    CruiseId = 2
                },
                new CruiseDay()
                {
                    Id = 13,
                    DayNumber = 5,
                    Description = "09:00 ч. Акостиране на пристанището в Тунис. Свободно време за посещение и разглеждане на забележителности. Връщане на кораба. 20:00 ч. Отплаване към Рим. Нощувка на кораба",
                    CruiseId = 2
                },
                new CruiseDay()
                {
                    Id = 14,
                    DayNumber = 6,
                    Description = "Престой на кораба. Възползване от удобствата, които предоставя. Нощувка на кораба",
                    CruiseId = 2
                },
                new CruiseDay()
                {
                    Id = 15,
                    DayNumber = 7,
                    Description = "В 8:00 корабът пристига в Рим. Напускане на круиза",
                    CruiseId = 2
                },


                new CruiseDay()
                {
                    Id = 16,
                    DayNumber = 1,
                    Description = "12:00 ч. Начало на круиза. Корабът потегля от пристанището в Нант в посока Ла Рошел. Нощувка на кораба",
                    CruiseId = 3
                },
                new CruiseDay()
                {
                    Id = 17,
                    DayNumber = 2,
                    Description = "07:00 ч. Акостиране на пристанището в Ла Рошел. Свободно време за посещение и разглеждане на забележителности. Връщане на кораба. 16:00 ч. Отплаване към Билбао. Нощувка на кораба",
                    CruiseId = 3
                },
                new CruiseDay()
                {
                    Id = 18,
                    DayNumber = 3,
                    Description = "07:00 ч. Акостиране на пристанището в Билбао. Свободно време за посещение и разглеждане на забележителности. Връщане на кораба. 16:00 ч. Отплаване към Порто. Нощувка на кораба",
                    CruiseId = 3
                },
                new CruiseDay()
                {
                    Id = 19,
                    DayNumber = 4,
                    Description = "07:00 ч. Акостиране на пристанището в Порто. Свободно време за посещение и разглеждане на забележителности. Връщане на кораба. 18:30 ч. Отплаване към Лисабон. Нощувка на кораба",
                    CruiseId = 3
                },
                new CruiseDay()
                {
                    Id = 20,
                    DayNumber = 5,
                    Description = "08:30 ч. Акостиране на пристанището в Лисабон. Свободно време за посещение и разглеждане на забележителности. Връщане на кораба. 20:30 ч. Отплаване към Нант. Нощувка на кораба",
                    CruiseId = 3
                },
                new CruiseDay()
                {
                    Id = 21,
                    DayNumber = 6,
                    Description = "Престой на кораба. Възползване от удобствата, които предоставя. Нощувка на кораба",
                    CruiseId = 3
                },
                new CruiseDay()
                {
                    Id = 22,
                    DayNumber = 7,
                    Description = "Престой на кораба. Възползване от удобствата, които предоставя. Нощувка на кораба",
                    CruiseId = 3
                },
                new CruiseDay()
                {
                    Id = 23,
                    DayNumber = 8,
                    Description = "В 8:00 корабът пристига в Нант. Напускане на круиза",
                    CruiseId = 3
                }
            });
        }
    }
}
