using Microsoft.EntityFrameworkCore;
using Microsoft.EntityFrameworkCore.Metadata.Builders;
using TouristAgency.Infrastructure.Data.Models.MssqlModels;

namespace TouristAgency.Infrastructure.Data.Configurations
{
    public class DestinationConfiguration : IEntityTypeConfiguration<Destination>
    {
        public void Configure(EntityTypeBuilder<Destination> builder)
        {
            builder.HasData(new Destination[]
            {
                new Destination()
                {
                    Id = 1,
                    Name = "Кавала",
                    Description = "Кавала е град в Северна Гърция, най-важното пристанище в Източна Македония и Тракия и център на дем Кавала. Градът е и център на Филипийската, Неаполска и Тасоска епархия на Гръцката православна църква",
                    CountryId = 2
                },
                new Destination()
                {
                    Id = 2,
                    Name = "Остров Крит",
                    Description = "Крит е една от тринадесетте административни области на Република Гърция. Той е най-големият гръцки остров с площ от 8336 км², и петият по големина в Средиземно море, като на него е най-южната точка на Гърция. Населението му е над 600 000 души",
                    CountryId = 2
                },
                new Destination()
                {
                    Id = 3,
                    Name = "Остров Лефкада",
                    Description = "Лефкада е гръцки остров в Йонийско море. Островът разполага с няколко средно големи курорта по източното крайбрежие и голям брой отделни плажове, най-известни от които са Порто Кацики, Егремни и Нидри. В административно отношение Лефкада е отделен дем в област Йонийски острови. Столица и най-голям град е Лефкада. Другите населени места са типични курорти, които се оживяват предимно през летните месеци. Пристанището на Нидри е изходен пункт за посещение на съседните острови Итака, Кефалония, Скорпио",
                    CountryId = 2
                },
                new Destination()
                {
                    Id = 4,
                    Name = "Тасос",
                    Description = "Тасос е остров в северната част на Бяло море, наричана източно от него Тракийско море, близо до брега на Източна Македония и Западна Тракия, при устието на река Места. Днес главен и най-голям град е Лимен (с българско име Боровец), често наричан и Тасос. Второто по големина селище е Лименария",
                    CountryId = 2
                },
                new Destination()
                {
                    Id = 5,
                    Name = "Рим",
                    Description = "Рим е столицата на Италия и област Лацио. Разположен е на реките Тибър и Аниене. Бил е столица на Римската империя, най-могъщата, голяма и най-дълго просъществувалата империя в класическата западна цивилизация. Ватиканът, анклав в Рим, е суверенна държава, седалище на Римската католическа църква и папата.\r\nРим е най-големият град в Италия и един от най-големите европейски градове с площ от 1287,36 кв. км. Предградията му достигат до Тиренско море. В границите на града населението е 2,8 милиона жители (към 31 декември 2019 г.); почти 4,4 милиона живеят в района на Рим.",
                    CountryId = 3
                },
                new Destination()
                {
                    Id = 6,
                    Name = "Сицилия",
                    Description = "Сицилия е най-големият остров в Средиземно море, с площ 25 460 km² Островът е отделен от Апенинския полуостров чрез Месинския пролив. Три морета мият бреговете ѝ: Тиренско, Йонийско и Средиземно. Релефът е предимно хълмист и планински. На острова се намира вулканът Етна, висок 3323 m. Административен център на Сицилия и най-голям град е Палермо.\r\n",
                    CountryId = 3
                },
                new Destination()
                {
                    Id = 7,
                    Name = "Сардиния",
                    Description = "Остров Сардиния е вторият по големина остров в Средиземно море (след Сицилия). Климатът е типичен средиземноморски. Има площ от 24,090 км2",
                    CountryId = 3
                },
                new Destination()
                {
                    Id = 8,
                    Name = "Ница",
                    Description = "Ница е град в Югоизточна Франция, регион Прованс-Алпи-Лазурен бряг. Градът е важен туристически център на Средиземно море. Населението му е 344 064 души, а на градската агломерация – около 933 000 души (1999).\r\nГрадът е разположен по бреговете на Залива на ангелите, заобиколен от приморските Алпи, защитаващи града от хладни ветрове. Столицата на Лазурния бряг е петият по големина град във Франция (след Париж, Марсилия, Лион и Тулуза) и най-големият на френската Ривиера",
                    CountryId = 4,
                },
                new Destination()
                {
                    Id = 9,
                    Name = "Париж",
                    Description = "Париж възбужда всички сетива, настояващ да бъде видян, чут, докоснат, усетен на вкус и мирис. От романтичната Сена до просторните многоцветни пейзажи и изтънченото поведение на местните, Париж е същината на всичко френско. Вгледайте се в булевардите, обсипани с внушителни паметници, велики произведения на изкуството и магически светлини. Насладете се на невероятния вкус на сирената, шоколада, виното и морските деликатеси. Почувстайте как вятърът гали лицето ви, докато се движите с ролери покрай Бастилията или усетете пристъпа на страх и еуфория на върха на Айфеловата кула",
                    CountryId = 4
                },
                new Destination()
                {
                    Id = 10,
                    Name = "Барселона",
                    Description = "Барселона (Barcelona) е столица на автономната област Каталония и вторият по големина град в Испания.\r\n\r\nИсторията на Барселона може да се разгледа из целия град. Най-старите райони са разположени в близост до морето, включително и пазарната зона, разположена в  готическия квартал (Barri Gotic). От другата страна на главния булевард Ла Рамбла (La Rambla) е известният квартал Равал (Raval). До 80-те години на ХХ в. това е бил бедняшки квартал, включващ и китайски квартал. Днес там може да намерите скъпи бутици и заведения",
                    CountryId = 5
                },
                new Destination()
                {
                    Id = 11,
                    Name = "Ла Манга",
                    Description = "Със своите 325 слъчневи дни в годината Ла Манга дел Мар Менор е описван като Рая между две морета и когато дойдете в тази част на испанското крайбрежие, ще разберете, че това е най-точното възможно описание. Ла Манга е тясна ивица суша, дълга около 20 километра, която разделя двете \"морета\" – Средиземно и Мар Менор (което не е море, а солена лагуна)",
                    CountryId = 5
                },
                new Destination()
                {
                    Id = 12,
                    Name = "Коста Бланка",
                    Description = "Коста Бланка (Costa Blanca - означава Бяло крайбрежие) е брегова линия с дължина над 200 км в испанската провинцията Аликанте. Простира се от Дения на север, през Коста дел Таронгерс, на юг от Торевиеха, през Коста Калида. Включва в себе си много известни дестинации в Испания, като туризма там е много добре развит",
                    CountryId = 5
                },
                new Destination()
                {
                    Id = 13,
                    Name = "Бенидорм",
                    Description = "Бенидорм (Benidorm) е пристанищен град в провинция Аликанте в автономната област Валенсия. Бенидорм е едно от най-популярните курортни селища в Испания и е част от Коста Бланка. Градът е известен още като „Манхатън на Испания“ или „Бенийорк“ заради многобройните си високи хотели и блокове с ваканционни апартаменти, които често на повече от 25 етажа\r\n\r\nБенидорм е популярен с нощния си живот. Има барове и клубове, концентрирани в центъра на града, а безплатните кабаре представления (от 21 часа до ранните часове) го отличават от подобни курорти",
                    CountryId = 5
                },
                new Destination()
                {
                    Id = 14,
                    Name = "Анталия",
                    Description = "Анта̀лия е град на средиземноморското крайбрежие на Турция, административен център на едноименния вилает Анталия\r\nНаселението на града сега е около 1 000 000 жители\r\nАнталия е живописен град, заобиколен от високи планини, Средиземно море, притежаващ красив плаж. Районът на града е изпълнен с множество археологически и исторически обекти. Градът е един от важните центрове на така наречената Турска ривиера",
                    CountryId = 6
                },
                new Destination()
                {
                    Id = 15,
                    Name = "Кушадасъ",
                    Description = "Кушадасъ е град във вилает Айдън, Западна Турция, разположен на брега на Егейско море. Селището е отдалечено на 90 км от третия по големина град в Турция — Измир. Населението наброява приблизително 44 000 души (2005 г.). Кушадасъ е атрактивна туристическа дестинация, посещавана от хиляди души годишно. Буквално преведено, името на града означава Птичият остров",
                    CountryId = 6
                },
                new Destination()
                {
                    Id = 16,
                    Name = "Бодрум",
                    Description = "Бодрум (Bodrum) се намира в Югозападна Турция, разположен е на полуостров Бодрум.\r\nБодрум се намира на територията на древният град Халикарнас, където се е намирал мавзолеят от Халикарнас - едно от Седемте чудеса на древния свят. Самият мавзолей е разрушен през Средновековието от силно земетресение, като някои части от него са запазени и са изложени в Британския музей",
                    CountryId = 6
                },
                new Destination()
                {
                    Id = 17,
                    Name = "Чешме",
                    Description = "Чешме – \"Перлата на Егейска Турция\" , \"Оазисът на турската аристокрация\" или \"Раят за сърфистите на Средиземно море\" е курорт с уникална атмосфера, основан от Римляните през 196 г. пр.н.е., като важно пристанище. Разположен е на върха на полуостров, част от залива на Измир (на 81 км. западно от града). В превод името му означава \"Фонтан\" , наименованието се дължи на изобилието от лечебни извори с топла вода. Освен с изворите, Чешме е известен с винопроизводството си, природните красоти, белите пясъчни плажове и исторически забележителности и предлага на посетителите си красиви природни гледки и богата култура",
                    CountryId = 6
                },
                new Destination()
                {
                    Id = 18,
                    Name = "Лисабон",
                    Description = "Разположението на Лисабон (Lisboa, на португалски се произнася Лижбоа) върху седем ниски хълмчета до река Тежу, привличаща някога търговци и заселници, е истински впечатляваща гледка. Добавете културното разнообразие и архитектурата и ще получите един от най-интересните градове в Европа\r\n\r\nЛисабон просто сияе в отражението си в реката - един поглед и ще сте влюбени в него  В центъра на Лисабон има широки, оградени с дървета площади, украсени със сгради в стил арт нуво, тротоари с мозайка и улични кафенета. Старият град със своите стръмни улички и уютни барове предлага невероятна атмосфера",
                    CountryId = 7
                },
                new Destination()
                {
                    Id = 19,
                    Name = "Прага",
                    Description = "Прага е столицата и най-големият град на Чехия\r\nНаселението на града през 2012 година е 1 241 273 души, което е над 10% от населението на Чешката република. Разположен е на река Вълтава. Прага е смятана за един от най-красивите градове в света и е сред най-посещаваните от туристи\r\nИзвестна е с многообразната си архитектура от различни периоди - барок, рококо, готика, романтизъм, кубизъм и др.",
                    CountryId = 8
                },
                new Destination()
                {
                    Id = 20,
                    Name = "Буенос Айрес",
                    Description = "Ще почувствате колко различен е този град. Различен от всички, които сте виждали до сега. Сгради, повечето бели и масивни, следващи прави линии, които се кръстосват по цялата площ на града като бяла рибарска мрежа. Подреденост, избегнала напълно тягостното внушение на урбанизацията. След обиколка на града всички изтъркани фрази на възхищение, вече изпразнени от съдържание, изведнъж отново ще имат смисъл. Неволно ще повтаряте убедено „Това е най–красивият град в Южна Америка!“",
                    CountryId = 9
                },
                new Destination()
                {
                    Id = 21,
                    Name = "Хавана",
                    Description = "Хавана е столицата на Куба и най-голям град в страната и на Антилските острови. Градът е една от четиринадесетте провинции на страната, наричана Сиудад де ла Абана. Населението му е около 2 110 000 души",
                    CountryId = 10
                },
                new Destination()
                {
                    Id = 22,
                    Name = "Лима",
                    Description = "Лѝма (на испански: Lima) е столица и най-голям град на Република Перу. Градът е разположен в алувиалната долина на историческата река Римак, на пустинния и висок тихоокеански перуански бряг. Заедно с пристанищния град Каляо образува най-голямата урбанизирана зона в Перу (известна като голяма Лима) и една от най-големите в Южна Америка",
                    CountryId = 11
                },
                new Destination()
                {
                    Id = 23,
                    Name = "Рио де Жанейро",
                    Description = "Рио де Жанейро (на португалски: Rio de Janeiro, което означава януарска река) е град в Югоизточна Бразилия, център на щат Рио де Жанейро\r\n\r\nНаселението на града е около 6 100 000 души (2006),[1] а на градската агломерация – около 11 582 000 души (2009). Рио де Жанейро е вторият по големина град в Бразилия след Сао Пауло и служи за столица на страната от 1764 до 1960, когато столицата е преместена в Бразилия. През 1808 – 1821, градът е столица на Португалската империя",
                    CountryId = 12
                },
                new Destination()
                {
                    Id = 24,
                    Name = "Токио",
                    Description = "Токио е столицата на Япония. Градът е една от 47-те префектури в страната и център на Голямо Токио, най-големият метрополен регион в света.[3] Токио е седалище на японското правителство и на Императорския дворец. Разположен е в региона Канто в югоизточната част на главния японски остров Хоншу и включва в административните си граници архипелазите Идзу и Бонински острови",
                    CountryId = 13
                },
                new Destination()
                {
                    Id = 25,
                    Name = "Киото",
                    Description = "Киото е град в Япония с население 1,5 милиона души. В миналото е бил столица на императорска Япония, сега е столица на префектура Киото и част от района Осака-Кобе-Киото. Киото е разделен на 11 квартала\r\nКиото е една от най-популярните туристически дестинации в Япония",
                    CountryId = 13
                },
                new Destination()
                {
                    Id = 26,
                    Name = "Канди",
                    Description = "Канди е известен със своята архитектура. „Храмът на Зъба“ е един от най-забележителните будистки храмове в Канди и страната. Намира се в дворцов комплекс. В него се съхранява безценна будистка реликва – зъб на Буда. Други значими архитектурни обекти са: Дворцовият комплекс, храмът на Бог Ната, храмът на Бог Вишну и храмът на Бог Катарагама",
                    CountryId = 14
                },
                new Destination()
                {
                    Id = 27,
                    Name = "Пекин",
                    Description = "С население от над 21 000 000 жители и площ от около 16 801 km² градът е сред най-населените и най-обширните в света\r\n\r\nПекин има статут на град-провинция и граничи с Тиендзин на югозапад и с провинция Хъбей на север, запад и юг. Градът се разделя на 14 окръга – градски и предградия, и две селски общини. От 1949 г. Пекин е столица на Китайската народна република. Той е вторият по население град в страната и е нейният политически, образователен и културен център",
                    CountryId = 15
                },
                new Destination()
                {
                    Id = 28,
                    Name = "Сингапур",
                    Description = "Името Сингапур произхожда от санскрит, съставено е от думите синга, сингха и пура, и означава „Лъвски град“. При заселването през 7. – 8. век, тогавашното княжество получава името Темасек („Морски град“), но според легендата то скоро след това било сменено на „Лъвски град“. Причина за това била появата на морско чудовище, наподобяващо лъв. „Мерлион“ – знакът на града – води от там своето начало",
                    CountryId = 16
                },
                new Destination()
                {
                    Id = 29,
                    Name = "Мале",
                    Description = "Малдивите са островна държава в Индийския океан, състояща се от група атоли и намираща се на югозапад от Индия и на около 700 км югозападно от Шри Ланка. Те са най-малката азиатска държава и по население, и по територия\r\n\r\nНай-високата им точка е 2,3 метра над морското равнище, а средната им височина е 1,5 м. Общата им площ е 300 км². Столицата се намира на най-големия атол и се нарича Мале. Малдивите нямат нито една река или голямо езеро и се чувства недостига на питейна вода. Температурата на въздуха целогодишно е между 24°C до 33°C",
                    CountryId = 17
                },
                new Destination()
                {
                    Id = 30,
                    Name = "Хургада",
                    Description = "Хургада е курортен град в Египет, административен център на мухафаза Червено море. В миналото курортът е бил малко рибарско селище, но сега със своите чисти брегове и рифове се се нарежда сред най-добрите египетски курорти\r\nС повече от 20 км плажна ивица изпъстрена с много хотели, Хургада може да задоволи изискванията на всеки турист. Предлага атракции като гмуркане с акваланг, уиндсърфинг и пустинни сафарита. Хурагда е често посещавана дестинация от руснаци, немци и чехи, както и от други европейски туристи",
                    CountryId = 18
                },
                new Destination()
                {
                    Id = 31,
                    Name = "Сома Бей",
                    Description = "Сома Бей е крайбрежен курорт на Червено море в Египет, на 45 км южно от международното летище Хургада и на около 28 км северно от пристанището Сафага. Самостоятелната общност от 10 000 000 m² в Сома Бей се намира на полуостров, заобиколен от всички страни от морето",
                    CountryId = 18
                },
                new Destination()
                {
                    Id = 32,
                    Name = "Макада Бей",
                    Description = "Макади Бей е курортен град – част от ривиерата на Червено море, осеян с хотели и спа центрове. Пясъчните плажове са популярни за водолазно гмуркане и гмуркане с шнорхел. В района се предлагат организирани екскурзии, които включват гмуркане в пещери край коралови рифове, както и разглеждане на морски обитатели, като баракуди. Край залива са разположени множество работещи до късно дискотеки и ресторанти, където се предлагат морска храна и кухня от цял свят. Популярните сред семействата атракции включват аквапарк и парка Mini Egypt с модели на известни египетски забележителности",
                    CountryId = 18
                },
                new Destination()
                {
                    Id = 33,
                    Name = "Мароко",
                    Description = "Мароко е един от туристическите гиганти в Африка. Всяка година страната се посещава от милиони туристи, които идват заради топлия климат, прекрасни плажове, огнено червени пейзажи и ориенталска култура. Най-посещасваните градове в Кралство Мароко са Касабланка, Маракеш и Агадир. Колкото и да е странно тези градове са изключително различни един от друг и всеки от тях притежава своя собствена неповторима идентичност",
                    CountryId = 19
                },
                new Destination()
                {
                    Id = 34,
                    Name = "Остров Джерба",
                    Description = "Джерба или Джарба е остров на Тунис в област Меденин. Намира се в залива Габес на Средиземно море\r\n\r\nТова е най-големият средиземноморски остров на Африка. Площта му е 514 км². Повърхността на острова е равнинна. За източници на вода се използват артезиански кладенци",
                    CountryId = 20
                },
                new Destination()
                {
                    Id = 35,
                    Name = "Тунис",
                    Description = "Тунис е държава в Северна Африка, населена предимно от араби. Има излаз на Средиземно море. Граничи с Алжир на запад и с Либия на юг и изток",
                    CountryId = 20
                },
                //new Destination()
                //{
                //    Id = 6,
                //    Name = "",
                //    Description = "",
                //    CountryId = 3
                //},
            });
        }
    }
}
