using Microsoft.EntityFrameworkCore;
using Microsoft.EntityFrameworkCore.Metadata.Builders;
using TouristAgency.Infrastructure.Data.Models.MssqlModels;

namespace TouristAgency.Infrastructure.Data.Configurations
{
    public class OrganizedOfferDayConfiguration : IEntityTypeConfiguration<OrganizedOfferDay>
    {
        public void Configure(EntityTypeBuilder<OrganizedOfferDay> builder)
        {
            builder.HasData(new OrganizedOfferDay[]
            {
                new OrganizedOfferDay()
                {
                    Id = 1,
                    DayNumber = 1,
                    Description = "Отпътуване от София в 7.30 ч. от ул. \"Оборище\" (в участъка между пл. „Александър Невски“ и бул. „Васил Левски“), в 8.00 ч. от автогара „Сердика“, в 8.30 ч. от Студена - бензиностанция \"Shell/Mc Donald's\", в 9.00 ч. от Дупница, в 9.30 ч. от Благоевград, в 10.30 ч. от Сандански по маршрут ГКПП Кулата - Кавала. Пристигане в хотел \"Airotel Galaxy\" 4* ранния следобяд. Настаняване. Свободно време. Вечеря. Нощувка",
                    ActivityId = null,
                    OrganizedOfferId = 1,
                },
                new OrganizedOfferDay()
                {
                    Id = 2,
                    DayNumber = 2,
                    Description = "Закуска. Свободно време или пешеходна разходка в Кавала: пристанището; акведуктът, построен по заповед на Сюлейман Великолепни през 1550 г.; църквата „Св. Богородица“, родната къща на Али Паша, който провежда значими реформи в Османската империя през 19 в.; турската крепост от 16 в., станала символ на града. Свободно време за самостоятелна разходка в града. Връщане в хотела на обяд. Свободно време. Вечеря. Нощувка",
                    ActivityId = 1,
                    OrganizedOfferId = 1
                },
                new OrganizedOfferDay()
                {
                    Id = 3,
                    DayNumber = 3,
                    Description = "Закуска. Свободно време за плаж или целодневна туристическа програма по желание: панорамна обиколка на остров Тасос с посещение на традиционна фабрика за производство на зехтин, манастира \"Св. Архангели\" и на златарското ателие \"Iris Gold\". Пешеходна разходка и свободно време в столицата Лименас. Отпътуване за хотела късния следобяд. Вечеря. Нощувка",
                    ActivityId = 2,
                    OrganizedOfferId = 1
                },
                new OrganizedOfferDay()
                {
                    Id = 4,
                    DayNumber = 4,
                    Description = "Закуска. Свободно време. Използване на включените в пакета услуги. Вечеря. Нощувка",
                    ActivityId = null,
                    OrganizedOfferId = 1
                },
                new OrganizedOfferDay()
                {
                    Id = 5,
                    DayNumber = 5,
                    Description = "Закуска. Отпътуване за България в 10:00 ч. Пристигане в София на бензиностанция „Lukoil“ (бул. „Сливница“, след кръстовище Орион), автогара „Сердика“, ул. \"Оборище\" (в участъка между пл. „Александър Невски“ и бул. „Васил Левски“) привечер",
                    ActivityId = null,
                    OrganizedOfferId = 1
                },

                
                new OrganizedOfferDay()
                {
                    Id = 6,
                    DayNumber = 1,
                    Description = "Сборен час на Летище София - Терминал 2 с полет София – Крит с European Air Charter. Пристигане на летище Крит. Трансфер до избрания хотел.\r\n\r\nНастаняване – в периода от пристигане в хотела до настаняване, туристите могат да се възползват от всички услуги, включени в концепцията на хотела.\r\n\r\nСвободно време. Нощувка",
                    ActivityId = null,
                    OrganizedOfferId = 2
                },
                new OrganizedOfferDay()
                {
                    Id = 7,
                    DayNumber = 2,
                    Description = "Свободно време за плаж и забавления или възможност за допълнителна екскурзия",
                    ActivityId = 3,
                    OrganizedOfferId = 2
                },
                new OrganizedOfferDay()
                {
                    Id = 8,
                    DayNumber = 3,
                    Description = "Свободно време за плаж и забавления или възможност за допълнителна екскурзия",
                    ActivityId = 4,
                    OrganizedOfferId = 2
                },
                new OrganizedOfferDay()
                {
                    Id = 9,
                    DayNumber = 4,
                    Description = "Свободно време за плаж и забавления или възможност за допълнителна екскурзия",
                    ActivityId = 5,
                    OrganizedOfferId = 2
                },
                new OrganizedOfferDay()
                {
                    Id = 10,
                    DayNumber = 5,
                    Description = "Свободно време за плаж и забавления или възможност за допълнителна екскурзия",
                    ActivityId = 6,
                    OrganizedOfferId = 2
                },
                new OrganizedOfferDay()
                {
                    Id = 11,
                    DayNumber = 6,
                    Description = "Свободно време за плаж и забавления или възможност за допълнителна екскурзия",
                    ActivityId = 7,
                    OrganizedOfferId = 2
                },
                new OrganizedOfferDay()
                {
                    Id = 12,
                    DayNumber = 7,
                    Description = "Свободно време за плаж и забавления или възможност за допълнителна екскурзия",
                    ActivityId = 8,
                    OrganizedOfferId = 2
                },
                new OrganizedOfferDay()
                {
                    Id = 13,
                    DayNumber = 8,
                    Description = "Закуска. Tрансфер за полет Крит – София с European Air Charter",
                    ActivityId = null,
                    OrganizedOfferId = 2
                },


                new OrganizedOfferDay()
                {
                    Id = 14,
                    DayNumber = 1,
                    Description = "Отпътуване от София в 6.30 ч. от автогара „Сердика“, в 7.00 ч. от Студена - бензиностанция \"Shell/Mc Donald's\", в 7.30 ч. от Дупница, в 8.00 ч. от Благоевград, в 9.00 ч. от Сандански по маршрут Кулата - остров Лефкада. Пристигане вечерта. Настаняване. Вечеря. Нощувка",
                    ActivityId = null,
                    OrganizedOfferId = 3,
                },
                new OrganizedOfferDay()
                {
                    Id = 15,
                    DayNumber = 2,
                    Description = "Закуска. Свободно време. По желание - отпътуване за град Нидри за целодневен круиз с кораб (продължителност 9 часа): Порто Кацики или Егремни - най-красивите плажове на острова с възможност за скачане и плуване в кристалната вода на Йонийско море; остров Кефалония със свободно време в градчето Фискардо; остров Итака с възможност за разходка или плаж на острова на Одисей; пещерите на остров Меганиси; трите острова на семейство Онасис - Скорпиос, Спарти и Скорпиди; остров Мадури, известен със своята вечнозелена растителност. Връщане в хотела привечер. *препоръчителни са аква обувки, бански, слънчеви очила и шапки*  Вечеря. Нощувка",
                    ActivityId = 9,
                    OrganizedOfferId = 3
                },
                new OrganizedOfferDay()
                {
                    Id = 16,
                    DayNumber = 3,
                    Description = "Закуска. Свободно време. По желание - отпътуване за Парга за целодневен круиз с корабче: остров Антипаксос с възможност за плуване в топлите и чисти води на Йонийско море; Сините пещери, известни с причудливите си форми, образувани през годините от морските води; остров Паксос с посещение на столицата Гайос и свободно време за разходка и обяд в някоя от местните рибни таверни. Връщане в хотела привечер. *препоръчителни са бански, слънчеви очила и шапки* Вечеря. Нощувка",
                    ActivityId = 10,
                    OrganizedOfferId = 3
                },
                new OrganizedOfferDay()
                {
                    Id = 17,
                    DayNumber = 4,
                    Description = "Закуска. Свободно време. По желание - обиколка на острова с посещение на: град Лефкада - Централният площад, църквата „Св. Спиридон“, построена през 1685 г. от венецианците, кметството, църквата „Св. Мина“ и катедралата; манастира \"Панагия Фанеромени\" - най-важният религиозен център на острова, построен през 1634 г. върху руините на древен храм, посветен на богинята Артемида; плажа „Катизма“ - един от най-добрите на острова. Връщане в хотела привечер. *препоръчителни са аква обувки, бански, слънчеви очила и шапки*  Вечеря. Нощувка",
                    ActivityId = 11,
                    OrganizedOfferId = 3
                },
                new OrganizedOfferDay()
                {
                    Id = 18,
                    DayNumber = 5,
                    Description = "Закуска. Отпътуване за България. Пристигане в София на автогара „Сердика“ вечер",
                    ActivityId = null,
                    OrganizedOfferId = 3
                },


                new OrganizedOfferDay()
                {
                    Id = 19,
                    DayNumber = 1,
                    Description = "Отпътуване от София в 7.00 ч. от ул. \"Оборище\" (в участъка между пл. „Александър Невски“ и бул. „Васил Левски“), 7.30 ч. - Автогара \"Сердика\", 8.00 ч. от Студена - бензиностанция \"Shell/Mc Donald's\", Дупница - 8.30 ч., Благоевград - 9.00 ч., Сандански - 10.00 ч. по маршрут ГКПП Кулата - Керамоти. Пътуване с ферибот до един от най-красивите егейски острови - Тасос. Пристигане следобед. Настаняване късния следобед. Свободно време за плаж. Вечеря. Нощувка",
                    ActivityId = null,
                    OrganizedOfferId = 4
                },
                new OrganizedOfferDay()
                {
                    Id = 20,
                    DayNumber = 2,
                    Description = "Закуска. Свободен ден за плаж. Вечеря. Нощувка",
                    ActivityId = null,
                    OrganizedOfferId = 4
                },
                new OrganizedOfferDay()
                {
                    Id = 21,
                    DayNumber = 3,
                    Description = "Закуска. Свободно време или туристическа програма по желание: панорамна обиколка на остров Тасос с посещение на златарско ателие \"Iris Gold\", традиционна фабрика за производство на зехтин и манастира \"Св. Архангели\". Пешеходна разходка в столицата Лименас. Вечеря. Нощувка",
                    ActivityId = 12,
                    OrganizedOfferId = 4
                },
                new OrganizedOfferDay()
                {
                    Id = 22,
                    DayNumber = 4,
                    Description = "Закуска. Свободен ден за плаж. Вечеря. Нощувка",
                    ActivityId = null,
                    OrganizedOfferId = 4
                },
                new OrganizedOfferDay()
                {
                    Id = 23,
                    DayNumber = 5,
                    Description = "Закуска. Свободен ден за плаж. Вечеря. Нощувка",
                    ActivityId = null,
                    OrganizedOfferId = 4
                },
                new OrganizedOfferDay()
                {
                    Id = 24,
                    DayNumber = 6,
                    Description = "Закуска. Отпътуване за Кавала. Пешеходна разходка: пристанището; акведуктът, построен по заповед на Сюлейман Великолепни през 1550 г.; църквата „Св. Богородица“, родната къща на Али паша, който провежда значими реформи в Османската империя през 19 в.; турската крепост от 16 в., станала символ на града. Свободно време. Отпътуване за България. Пристигане в София на бензиностанция \"Lukoil\" (бул. \"Сливница\", след кръстовище Орион), Автогара \"Сердика\", ул. \"Оборище\" (в участъка между пл. „Александър Невски“ и бул. „Васил Левски“) вечерта",
                    ActivityId = null,
                    OrganizedOfferId = 4
                },


                new OrganizedOfferDay()
                {
                    Id = 25,
                    DayNumber = 1,
                    Description = "Събиране на летище София. Отпътуване за Рим с директен полет на Wizz air. Кацане на летището. Трансфер до центъра на Рим. Панорамна обиколка на Рим (включена в цената). Настаняване. Нощувка",
                    ActivityId = null,
                    OrganizedOfferId = 5,
                },
                new OrganizedOfferDay()
                {
                    Id = 26,
                    DayNumber = 2,
                    Description = "Закуска. Свободно време или екскурзия по желание: Сутринта – Екскурзия до град-държава Ватикана, Следобяда – Площадите на Рим. Нощувка",
                    ActivityId = 13,
                    OrganizedOfferId = 5
                },
                new OrganizedOfferDay()
                {
                    Id = 27,
                    DayNumber = 3,
                    Description = "Закуска. Свободно време или екскурзия по желание: Допълнителна екскурзия Колизеум и Римски форуми. Нощувка",
                    ActivityId = 14,
                    OrganizedOfferId = 5
                },
                new OrganizedOfferDay()
                {
                    Id = 28,
                    DayNumber = 4,
                    Description = "Закуска. Свободно време или екскурзия по желание: Допълнителна екскурзия до Тиволи. Нощувка",
                    ActivityId = 15,
                    OrganizedOfferId = 5
                },
                new OrganizedOfferDay()
                {
                    Id = 29,
                    DayNumber = 5,
                    Description = "Закуска. Освобождаване на хотела. Трансфер до летището. Директен полет от Рим за София",
                    ActivityId = null,
                    OrganizedOfferId = 5
                },


                new OrganizedOfferDay()
                {
                    Id = 30,
                    DayNumber = 1,
                    Description = "Среща на Летище София. Директен полет до Катания. Трансфер и настаняване в хотел в района на Сиракуза или Рагуза",
                    ActivityId = null,
                    OrganizedOfferId = 6,
                },
                new OrganizedOfferDay()
                {
                    Id = 31,
                    DayNumber = 2,
                    Description = "Закуска. Отпътуване от хотела за посещение на Сиракуза и Ното.\r\nПосещение на Сиракуза - Пешеходна разходка с местен екскурзовод в стария град на Сиракуза, остров Ортиджа, известен с богатата си древногръцка история, част от световното културно наследство на ЮНЕСКО. Сиракуза е най-известната гръцка колония в Средиземноморието.\r\nПосещение на Ното - В ранният следобед се отправяме към Ното, обявен за перфектният бароков град. Истинско бижу на барока, включено в листата на ЮНЕСКО. Настаняване в хотела. Вечеря. Нощувка в района на Сиракуза или Рагуза",
                    ActivityId = null,
                    OrganizedOfferId = 6,
                },
                new OrganizedOfferDay()
                {
                    Id = 32,
                    DayNumber = 3,
                    Description = "Закуска. Отпътуване от хотела за посещение на Модика и Рагуза.\r\nПосещение на Модика - Модика е включен в списъка на световното културно наследство на ЮНЕСКО. Градът е основан от сикулите около VII век пр. н. е. По-късно е бил окупиран от римляните.\r\nПосещение на Рагуза - Градът е разделен на две части. В едната част няма забележителности, тя се е появила след земетресението през 1693 г. Другата част, наречена Рагуза Ибла, се разполага на хълма и е възстановена в средновековния си вид от местните жители след земетресението. Настаняване в хотела в района на Агридженто. Вечеря. Нощувка",
                    ActivityId = null,
                    OrganizedOfferId = 6,
                },
                new OrganizedOfferDay()
                {
                    Id = 33,
                    DayNumber = 4,
                    Description = "Закуска. Отпътуване за екскурия до Агридженто.\r\nПосещение на Агридженто – Ще разгледате една от основните забележителности на Сицилия, която включва останките на седем древногръцки храма от V век пр.н.е., посветени на боговете Хера, Зевс Олимпийски, Херкулес, храма Конкордия. Долината на Храмовете е включена в списъка със световното културно наследство на ЮНЕСКО.\r\nПосещение на Мазара Дел Вало - Мазара дел Вало e земеделски и риболовен център, разположен в провинция Трапани, Югозападна Сицилия. Като основан още по времето на финикийците град, той има древна и богата история, която личи в останалите запазени в него много древни руини и красиви сгради от Средновековието. Настаняване в хотела в района на Палермо/ Чефалу. Вечеря. Нощувка",
                    ActivityId = null,
                    OrganizedOfferId = 6,
                },
                new OrganizedOfferDay()
                {
                    Id = 34,
                    DayNumber = 5,
                    Description = "Закуска. Свободно време или допълнителна екскурзия до Палермо и Монреале.\r\nПосещение на Палермо – Разходка из столицата на Сицилия. Сърцето на Палермо е белязано от бароковото кръстовище „Куатро Канти”, непосредсвено до него се намира „Пиаца Претория” с „Фонтана на срама”, зад сградата на Общината е разположена църквата „Марторана”, където афрески, византийска мозайка и барок се сливат в хармоничен шедъовър.\r\nПосещение на Монреале - Посещение на Катедралата на града – изключителен шедьовър на норманската архитектура от 12 в. с впечатляващи мозайки във византийски стил, които разказват стария и новия завет. Вечеря. Нощувка в района на Палермо/ Чефалу",
                    ActivityId = null,
                    OrganizedOfferId = 6,
                },
                new OrganizedOfferDay()
                {
                    Id = 35,
                    DayNumber = 6,
                    Description = "Закуска. Отпътуване за Чефалу и Месина.\r\nПосещение на Чефалу – Градът е построен под огромна канара, наподобяваща крепост, в подножието, на която се е сгушил един от най-елегантните главни площади в Сицилия – Дуомо и величествената норманска катедрала от 12 в.\r\nПосещение на Месина - Разходка из Месина - третият по големина град в Сицилия и столица на провинцията Месина. Религиозните здания в Месина са няколко – катедралата на Месина от 12-ти век разрушавана и построявана два пъти - след земетресение (1908г.) и бомбардировки (1943г.), Annunziata dei Catalani – със засилен арабски архитектурен стил, Santa Maria degli Alemanni – било е параклис на тевтонските рицари. Настаняване в хотела в района на Етна или Катания. Вечеря. Нощувка",
                    ActivityId = null,
                    OrganizedOfferId = 6,
                },
                new OrganizedOfferDay()
                {
                    Id = 36,
                    DayNumber = 7,
                    Description = "Закуска. Свободно време или допълнителна екскурзия до Етна и Таормина.\r\nПосещение на Етна - Етна е най-високият действащ вулкан в Европа. Изкачване с автобус до 1910 м. Свободно време с възможност за разходка на страничните кратери „Силвестри”, които са били активни 1986 г., да си купите сувенири от лава в някое от многобройните магазинчета, да опитате мед от Дзаферана или ракията „Огъня на Етна”.\r\nПосещение на Таормина – Автобусът ни оставя на паркинг в подножието на града, откъдето се придвижваме до централната улица с безплатно бусче. Свободно време за разходка по живописните улички на града. Връщане в хотела в района на Етна или Катания. Вечеря. Нощувка",
                    ActivityId = null,
                    OrganizedOfferId = 6,
                },
                new OrganizedOfferDay()
                {
                    Id = 37,
                    DayNumber = 8,
                    Description = "Закуска. Трансфер до летище Катания. Прибиране в България с директен полет Катания - София",
                    ActivityId = null,
                    OrganizedOfferId = 6,
                },


                new OrganizedOfferDay()
                {
                    Id = 38,
                    DayNumber = 1,
                    Description = "Директен полет София – Олбия/Сардиния. Трансфер до хотела. Информационна среща. Вечеря. Нощувка",
                    ActivityId = null,
                    OrganizedOfferId = 7,
                },
                new OrganizedOfferDay()
                {
                    Id = 39,
                    DayNumber = 2,
                    Description = "Закуска. Информационна среща. Свободно време за плаж или възможност за допълнителна екскурзия по желание - Каляри и Баруминими",
                    ActivityId = 16,
                    OrganizedOfferId = 7
                },
                new OrganizedOfferDay()
                {
                    Id = 40,
                    DayNumber = 3,
                    Description = "Закуска. Свободно време за плаж или възможност за допълнителна екскурзия по желание - Коста Смералда",
                    ActivityId = 17,
                    OrganizedOfferId = 7
                },
                new OrganizedOfferDay()
                {
                    Id = 41,
                    DayNumber = 4,
                    Description = "Закуска. Свободно време за плаж или възможност за допълнителна екскурзия по желание - Сасари и Кастелсардо",
                    ActivityId = 18,
                    OrganizedOfferId = 7
                },
                new OrganizedOfferDay()
                {
                    Id = 42,
                    DayNumber = 5,
                    Description = "Закуска. Свободно време за плаж или възможност за допълнителна екскурзия по желание - Архипелага Магдалена (Ла Мадалена)",
                    ActivityId = 19,
                    OrganizedOfferId = 7
                },
                new OrganizedOfferDay()
                {
                    Id = 43,
                    DayNumber = 6,
                    Description = "Закуска. Свободно време за плаж или възможност за допълнителна екскурзия по желание - Корсика",
                    ActivityId = 20,
                    OrganizedOfferId = 7,
                },
                new OrganizedOfferDay()
                {
                    Id = 44,
                    DayNumber = 7,
                    Description = "Закуска. Свободно време за плаж или възможност за допълнителна екскурзия по желание - Панорамна обиколка на Алгеро",
                    ActivityId = 21,
                    OrganizedOfferId = 7,
                },
                new OrganizedOfferDay()
                {
                    Id = 45,
                    DayNumber = 8,
                    Description = "Закуска. Трансфер до летище Олбия. Директен полет Олбия - София с авиокомпания European Air Charter",
                    ActivityId = null,
                    OrganizedOfferId = 7,
                },


                new OrganizedOfferDay()
                {
                    Id = 46,
                    DayNumber = 1,
                    Description = "Среща на летище София, за директен полет с авиокомпания Wizz air до Ница. Трансфер до Ница и пешеходен тур на Ница, включен в цената. Настаняване. Информационна среща с вашият представител. Нощувка",
                    ActivityId = null,
                    OrganizedOfferId = 8,
                },
                new OrganizedOfferDay()
                {
                    Id = 47,
                    DayNumber = 2,
                    Description = "Закуска. Свободно време или възможност за допълнителна екскурзия по желание - Целодневна екскурзия до Сен Пол дьо Ванс, Кан и Сен Тропе. Прибиране в хотела. Нощувка",
                    ActivityId = 22,
                    OrganizedOfferId = 8
                },
                new OrganizedOfferDay()
                {
                    Id = 48,
                    DayNumber = 3,
                    Description = "Закуска. Свободно време или възможност за допълнителна екскурзия по желание - Целодневна екскурзия до: Ментон, Монако и Монте Карло. Прибиране в хотела. Нощувка",
                    ActivityId = 23,
                    OrganizedOfferId = 8
                },
                new OrganizedOfferDay()
                {
                    Id = 49,
                    DayNumber = 4,
                    Description = "Закуска. Свободно време. Освобождаване на хотела. Трансфер до летището за полет Ница – София",
                    ActivityId = null,
                    OrganizedOfferId = 8
                },


                new OrganizedOfferDay()
                {
                    Id = 50,
                    DayNumber = 1,
                    Description = "Полет от Терминал 2 на летище София в 07:10 ч. Кацане на летище „Шарл дьо Гол” в 09:10 ч. Трансфер до хотела. Свободно време. Нощувка",
                    ActivityId = null,
                    OrganizedOfferId = 9,
                },
                new OrganizedOfferDay()
                {
                    Id = 51,
                    DayNumber = 2,
                    Description = "Закуска. Свободно време или възможност за допълнителна екскурзия Bonjour Paris – пешеходна обиколка с  екскурзовод на български език: посещение на   Латинския квартал - остров  Ла Сите, Нотр Дам, Съдебната палата, Сорбоната, Пантеона, Люксембургската градина с Двореца, крепостта Консиержери, разходка с панорамно корабче по Сена, посещение на Айфеловата кула, Марсово поле",
                    ActivityId = 24,
                    OrganizedOfferId = 9
                },
                new OrganizedOfferDay()
                {
                    Id = 52,
                    DayNumber = 3,
                    Description = "Закуска. Свободно време и възможност за допълнителна екскурзия – Пешеходна обиколка с посещение на операта „Гарние”, площад „Вандом” с  колона на Наполеон, ул. „Риволи”, Лувъра, градините на двореца „Тюйлери”, площад „Конкорд”, Парламента, Домa на инвалидите с гроба на Наполеон, мостa „Александър III”,  Триумфалната арка, Шан-з-Елизе. Нощувка",
                    ActivityId = 25,
                    OrganizedOfferId = 9
                },
                new OrganizedOfferDay()
                {
                    Id = 53,
                    DayNumber = 4,
                    Description = "Закуска. Освобождаване на хотела. Трансфер до летище „Шарл дьо Гол” за полет в 10:15 ч. и кацане на летище София в 14:00 ч.",
                    ActivityId = null,
                    OrganizedOfferId = 9
                },


                new OrganizedOfferDay()
                {
                    Id = 54,
                    DayNumber = 1,
                    Description = "Среща на летище София 2 часа преди полета. Директен полет до Барселона. Трансфер до хотела. Настаняване. Свободно време. Нощувка в хотел Catalonia Park Putxet 4*",
                    ActivityId = null,
                    OrganizedOfferId = 10
                },
                new OrganizedOfferDay()
                {
                    Id = 55,
                    DayNumber = 2,
                    Description = "Закуска. Панорамна обиколка на Барселона(включена в цената). Връщане в хотела. Свободно време или по желание и срещу допълнително заплащане Фламенко вечер с включена напитка. Нощувка",
                    ActivityId = null,
                    OrganizedOfferId = 10
                },
                new OrganizedOfferDay()
                {
                    Id = 56,
                    DayNumber = 3,
                    Description = "Закуска. Свободно време или по желание и срещу допълнително заплащане целодневна екскурзия Шедьоврите на Гауди – световно наследство под закрилата на ЮНЕСКО",
                    ActivityId = 26,
                    OrganizedOfferId = 10
                },
                new OrganizedOfferDay()
                {
                    Id = 57,
                    DayNumber = 4,
                    Description = "Закуска. Освобождаване на хотела. Свободно време или по желание и срещу допълнително заплащане екскурзия до Абатство Монсерат с Черната Мадона. Трансер до летище. Директен полет до София. Кацане на летище София",
                    ActivityId = 27,
                    OrganizedOfferId = 10
                },


                new OrganizedOfferDay()
                {
                    Id = 58,
                    DayNumber = 1,
                    Description = "Отпътуване от летище София в 21,10 ч. с директен полет за Аликанте. Кацане на летището в Аликанте. Трансфер до Ла Манга дел Мар Менор (около 1.30 ч.). Настаняване. Вечеря (Студена вечеря/сух пакет). Нощувка",
                    ActivityId = null,
                    OrganizedOfferId = 11
                },
                new OrganizedOfferDay()
                {
                    Id = 59,
                    DayNumber = 2,
                    Description = "Закуска. Информационна среща. Обяд. Свободно време за плаж или самостоятелно разглеждане. Вечеря. Нощувка",
                    ActivityId = null,
                    OrganizedOfferId = 11
                },
                new OrganizedOfferDay()
                {
                    Id = 60,
                    DayNumber = 3,
                    Description = "Закуска. Свободно време или по желание полудневна екскурзия до Картахена – потопете се в историята на древния град Картахена, вървейки по неговите улици, по които в миналото са преминали цивилизациите на Картахенците, Римляните и Византийците и са оставили своя отпечатък  в историята на това място. Отпътуване сутринта за Картахена. Разглеждане на пристанището, паметника на героите от Кавие, площада на общината и реновирания наскоро дворец. Спускане надолу по главната улица за разглеждане на \"Гранд Хотел\" и други впечатляващи сгради като \"Ла каса Сервантес\" и сградата на казиното. По пътя за Римския театър се минава покрай църквата \"Санта Мария ла Виеха\". Римският театър датира от първи век пр. Хр. До него могат да се видят останките от стара катедрала, бомбардирана по време на Гражданската война. Накрая разглеждане на Църквата на благотворителността с патронния светец на града. По желание има възможност за изкачване с панорамен лифт над града (цена около 1 евро), за да се видят прекрасните пейзажи, които се откриват. Връщане в хотела. Обяд. Свободно време. Вечеря. Нощувка",
                    ActivityId = 28,
                    OrganizedOfferId = 11
                },
                new OrganizedOfferDay()
                {
                    Id = 61,
                    DayNumber = 4,
                    Description = "Закуска. Свободно време или по желание полудневна екскурзия до Мурсия – столицата на едноименната автономна област. Посещение на най-голямата забележителност – катедралата в Мурсия, построена върху основите на древна джамия, където могат да се видят различни художествени стилове – от готика до неокласицизъм. Разглеждане на църквата \"Сан Хуан де Диос\", разположена на площад в стария град. Екскурзията завършва с посещение на Музея на Салсийо, където могат да се видят най-големите и впечатляващи колекции от работата на великия бароков скулптор от Мурсия. Връщане в хотела. Вечеря. Нощувка",
                    ActivityId = 29,
                    OrganizedOfferId = 11
                },
                new OrganizedOfferDay()
                {
                    Id = 62,
                    DayNumber = 5,
                    Description = "Закуска. Свободно време или по желание полудневна екскурзия до Лорка – градът на слънцето, на стоте щита или на стоте имена. Както и да го наречем, той определено се откроява с множеството архитектурни паметници – комбинация от средновековен, ренесансов и бароков стил. От палеолита до днес град Лорка е бил дом на различни култури, всяка от които е оставила своя отпечатък в историята на града. Разходката ще ни отведе през емблематичния площад \"Испания\" с катедралата \"Свети Патрик\" от 18-ти век, съдебната палата и кметството. Продължаваме към Археологическия музей, житницата от 16-ти век, църква \"Свети Франциск\" и бароковия дворец \"Гевара\" (разглеждане отвън). Най-впечатляващ обаче е средновековният замък на Лорка (Крепостта на слънцето), който се издига на хълма над града. Екскурзията до Лорка е като машина на времето, която ни връща назад в историческото минало чрез средновековните улички, архитектурните шедьоври и градската атмосфера. Връщане в хотела. Вечеря. Нощувка",
                    ActivityId = 30,
                    OrganizedOfferId = 11
                },
                new OrganizedOfferDay()
                {
                    Id = 63,
                    DayNumber = 6,
                    Description = "Закуска. Свободно време или екскзурзия по желание. Обяд. Свободно време. Вечеря. Нощувка",
                    ActivityId = 31,
                    OrganizedOfferId = 11
                },
                new OrganizedOfferDay()
                {
                    Id = 64,
                    DayNumber = 7,
                    Description = "Закуска. Свободно време или по желание целодневна екскурзия до Валенсия. Туристическа програма във Валенсия – третият по големина испански град, съхранил хармонията на средиземноморските и испано-арабските традиции. Панорамна обиколка: архитектурно-културният комплекс \"Град на изкуствата и науките\", дело на архитекта Сантяго Калатрава и включващ впечатляващите Л’Емисферик, Музей на науките, Опера, Л’Осеанографик (най-големият аквариум в Европа); пешеходна разходка в историческият център: Арената - една от най-големите в Испания, централният площад с Кметството и Историческият музей на града, Копринената борса - шедьовър на валенсианския готически стил, включен в списъка на ЮНЕСКО за Световно културно наследство, Катедралата, строена между 1252 г. и 1482 г. върху основите на по-стара джамия; Торес де Серанoс - една от запазените средновековни порти и сградата на валенсианското правителство. Свободно време. Връщане в хотела. Вечеря. Нощувка",
                    ActivityId = 32,
                    OrganizedOfferId = 11
                },
                new OrganizedOfferDay()
                {
                    Id = 65,
                    DayNumber = 8,
                    Description = "Закуска. Освобождаване на стаите.  Отпътуване за Аликанте. Панорамна обиколка на Аликанте (включена в цената). Любителите на забележителна архитектура, богата история и културно наследство, отлични плажове, шопинг центрове и множество забавления, със сигурност ще останат очаровани от посещението на Аликанте: крепостта \"Санта Барбара\", построена на 166 м височина на хълма Бенакантил; преминаване по крайбрежната улица \"Еспланада\" с нейната знаменита алея от палми – символ на морската душа на града; катедралата със син купол \"Сан Николас\"; кметството на Аликанте, отличаващо се с орнаментирани елементи и интересни фасади на двете му кули.  Трансфер до летището в Аликанте и отпътуване за България в 16,30 ч.. Пристигане на летище София",
                    ActivityId = null,
                    OrganizedOfferId = 11
                },


                new OrganizedOfferDay()
                {
                    Id = 66,
                    DayNumber = 1,
                    Description = "Отпътуване от летище София с директен полет на авиокомпания „Wizz Air“. Кацане на летището в Аликанте. Панорамна обиколка на Аликанте (включена в цената). Любителите на забележителна архитектура, богата история и културно наследство, отлични плажове, шопинг центрове и множество забавления, със сигурност ще останат очаровани от посещението на Аликанте: крепостта „Санта Барбара“, построена на 166 м височина на хълма Бенакантил; преминаване по крайбрежната улица „Еспланада“ с нейната знаменита алея от палми – символ на морската душа на града; катедралата със син купол „Сан Николас“; кметството на Аликанте, отличаващо се с орнаментирани елементи и интересни фасади на двете му кули. Tрансфер до Бенидорм. Настаняване. Вечеря. Нощувка",
                    ActivityId = null,
                    OrganizedOfferId = 12
                },
                new OrganizedOfferDay()
                {
                    Id = 67,
                    DayNumber = 2,
                    Description = "Закуска. Информационна среща. Обяд. Свободно време. Вечеря. Нощувка",
                    ActivityId = null,
                    OrganizedOfferId = 12
                },
                new OrganizedOfferDay()
                {
                    Id = 68,
                    DayNumber = 3,
                    Description = "Закуска. Свободно време или по желание целодневна екскурзия до Валенсия - третият по големина град в Испания, разположен при вливането на река Турия в Средиземно море. Градът очарова посетителите си с малки, тесни улички, внушителни сгради и паркове с портокалови и лимонови дръвчета. Пешеходна  разходка: парламентът, църквата \"Санта Каталина\", катедралата на Валенсия, Музеят на фаите. Свободно време в историческия квартал Кармен с типични тесни улички с много магазини, ресторанти и кафенета. Връщане в хотела. Вечеря. Нощувка",
                    ActivityId = 33,
                    OrganizedOfferId = 12
                },
                new OrganizedOfferDay()
                {
                    Id = 69,
                    DayNumber = 4,
                    Description = "Закуска. Свободно време или по желание полудневна екскурзия до Елче. Програмата включва - транспорт с автобус, екскурзоводско обслужване на български език, панорамен тур на Стария град, базиликата Санта Мария, Кулата Калхора, двореца Алтимира, Арабските бани. Елче е разположен на двата бряга на река Виналопо и е едно от най-старите населени места на Иберийския полуостров. Елче е обявен за най-добър европейски град за отглеждане на палми. Тук има ботаническа градина с всички видове палми, които растат на Земята, както и цитрусови дървета, кактуси и бамбук. Друга голяма забележителност на града е \"Мистерията на Елче\" - традиционен средновековен празник, включен в Списъка на ЮНЕСКО като културен шедьовър. Вечеря. Нощувка",
                    ActivityId = 34,
                    OrganizedOfferId = 12
                },
                new OrganizedOfferDay()
                {
                    Id = 70,
                    DayNumber = 5,
                    Description = "Закуска. Свободно време или по желание полудневна екскурзия до Гуадалест - планинско селце, основано от маврите, разположено на 600 м. надморска височина, сгушено на самотно, но много красиво място. Красиви замъци се издигат между гранитни скали, сливащи се в едно със заобикалящата ги природа. Преди да пристигнете в долината на Гуадалест, пътувайки по планински криволичещи пътища, ще минете през няколко други очарователни малки селца. Едно от тях е Ла Нуция, с великолепна гледка към Средиземно море, така и към заобикалящите го планини. Фотопауза в красивото малко селце Полоп и посещение на магазин за типични местни продукти като мед, плодове, вина. Вечеря. Нощувка",
                    ActivityId = 35,
                    OrganizedOfferId = 12
                },
                new OrganizedOfferDay()
                {
                    Id = 71,
                    DayNumber = 6,
                    Description = "Закуска. Свободно време. Обяд. Свободно време или по желание вечерно фламенко шоу. Вечеря. Нощувка",
                    ActivityId = 36,
                    OrganizedOfferId = 12
                },
                new OrganizedOfferDay()
                {
                    Id = 72,
                    DayNumber = 7,
                    Description = "Закуска. Свободно време. Обяд. Вечеря. Нощувка",
                    ActivityId = null,
                    OrganizedOfferId = 12
                },
                new OrganizedOfferDay()
                {
                    Id = 73,
                    DayNumber = 8,
                    Description = "Закуска. Освобождаване на стаите. Трансфер до летището в Аликанте и полет за България на авиокомпания „Wizz Air“. Пристигане на летище София",
                    ActivityId = null,
                    OrganizedOfferId = 12
                },


                new OrganizedOfferDay()
                {
                    Id = 74,
                    DayNumber = 1,
                    Description = "Отпътуване от летище София с директен полет на авиокомпания „Wizz Air“. Кацане на летището в Аликанте. Панорамна обиколка на Аликанте (включена в цената). Любителите на забележителна архитектура, богата история и културно наследство, отлични плажове, шопинг центрове и множество забавления, със сигурност ще останат очаровани от посещението на Аликанте: крепостта „Санта Барбара“, построена на 166 м височина на хълма Бенакантил; преминаване по крайбрежната улица „Еспланада“ с нейната знаменита алея от палми – символ на морската душа на града; катедралата със син купол „Сан Николас“; кметството на Аликанте, отличаващо се с орнаментирани елементи и интересни фасади на двете му кули. Tрансфер до Бенидорм. Настаняване. Вечеря. Нощувка",
                    ActivityId = null,
                    OrganizedOfferId = 13
                },
                new OrganizedOfferDay()
                {
                    Id = 75,
                    DayNumber = 2,
                    Description = "Закуска. Информационна среща. Обяд. Свободно време. Вечеря. Нощувка",
                    ActivityId = null,
                    OrganizedOfferId = 13
                },
                new OrganizedOfferDay()
                {
                    Id = 76,
                    DayNumber = 3,
                    Description = "Закуска. Свободно време или по желание целодневна екскурзия до Валенсия - третият по големина град в Испания, разположен при вливането на река Турия в Средиземно море. Градът очарова посетителите си с малки, тесни улички, внушителни сгради и паркове с портокалови и лимонови дръвчета. Пешеходна  разходка: парламентът, църквата \"Санта Каталина\", катедралата на Валенсия, Музеят на фаите. Свободно време в историческия квартал Кармен с типични тесни улички с много магазини, ресторанти и кафенета. Връщане в хотела. Вечеря. Нощувка",
                    ActivityId = 37,
                    OrganizedOfferId = 13
                },
                new OrganizedOfferDay()
                {
                    Id = 77,
                    DayNumber = 4,
                    Description = "Закуска. Свободно време или по желание полудневна екскурзия до Елче. Програмата включва - транспорт с автобус, екскурзоводско обслужване на български език, панорамен тур на Стария град, базиликата Санта Мария, Кулата Калхора, двореца Алтимира, Арабските бани. Елче е разположен на двата бряга на река Виналопо и е едно от най-старите населени места на Иберийския полуостров. Елче е обявен за най-добър европейски град за отглеждане на палми. Тук има ботаническа градина с всички видове палми, които растат на Земята, както и цитрусови дървета, кактуси и бамбук. Друга голяма забележителност на града е \"Мистерията на Елче\" - традиционен средновековен празник, включен в Списъка на ЮНЕСКО като културен шедьовър. Вечеря. Нощувка",
                    ActivityId = 38,
                    OrganizedOfferId = 13
                },
                new OrganizedOfferDay()
                {
                    Id = 78,
                    DayNumber = 5,
                    Description = "Закуска. Свободно време или по желание полудневна екскурзия до Гуадалест - планинско селце, основано от маврите, разположено на 600 м. надморска височина, сгушено на самотно, но много красиво място. Красиви замъци се издигат между гранитни скали, сливащи се в едно със заобикалящата ги природа. Преди да пристигнете в долината на Гуадалест, пътувайки по планински криволичещи пътища, ще минете през няколко други очарователни малки селца. Едно от тях е Ла Нуция, с великолепна гледка към Средиземно море, така и към заобикалящите го планини. Фотопауза в красивото малко селце Полоп и посещение на магазин за типични местни продукти като мед, плодове, вина. Вечеря. Нощувка",
                    ActivityId = 39,
                    OrganizedOfferId = 13
                },
                new OrganizedOfferDay()
                {
                    Id = 79,
                    DayNumber = 6,
                    Description = "Закуска. Свободно време. Обяд. Свободно време или по желание вечерно фламенко шоу. Вечеря. Нощувка",
                    ActivityId = 40,
                    OrganizedOfferId = 13
                },
                new OrganizedOfferDay()
                {
                    Id = 80,
                    DayNumber = 7,
                    Description = "Закуска. Свободно време. Обяд. Вечеря. Нощувка",
                    ActivityId = null,
                    OrganizedOfferId = 13
                },
                new OrganizedOfferDay()
                {
                    Id = 81,
                    DayNumber = 8,
                    Description = "Закуска. Освобождаване на стаите. Трансфер до летището в Аликанте и полет за България на авиокомпания „Wizz Air“. Пристигане на летище София",
                    ActivityId = null,
                    OrganizedOfferId = 13
                },


                new OrganizedOfferDay()
                {
                    Id = 82,
                    DayNumber = 1,
                    Description = "Среща на Летище София - Терминал 2 за директен чартърен полет до Анталия. Кацане на летището в Анталия и посрещане от представител на фирма партньор",
                    ActivityId = null,
                    OrganizedOfferId = 14
                },
                new OrganizedOfferDay()
                {
                    Id = 83,
                    DayNumber = 2,
                    Description = "Свободно време за плаж и почивка. Възможност за посещение на допълнителните екскурзии на място, предложени от фирмата партньор",
                    ActivityId = null,
                    OrganizedOfferId = 14
                },
                new OrganizedOfferDay()
                {
                    Id = 84,
                    DayNumber = 3,
                    Description = "Свободно време за плаж и почивка. Възможност за посещение на допълнителните екскурзии на място, предложени от фирмата партньор",
                    ActivityId = null,
                    OrganizedOfferId = 14
                },
                new OrganizedOfferDay()
                {
                    Id = 85,
                    DayNumber = 4,
                    Description = "Свободно време за плаж и почивка. Възможност за посещение на допълнителните екскурзии на място, предложени от фирмата партньор",
                    ActivityId = null,
                    OrganizedOfferId = 14
                },
                new OrganizedOfferDay()
                {
                    Id = 86,
                    DayNumber = 5,
                    Description = "Свободно време за плаж и почивка. Възможност за посещение на допълнителните екскурзии на място, предложени от фирмата партньор",
                    ActivityId = null,
                    OrganizedOfferId = 14
                },
                new OrganizedOfferDay()
                {
                    Id = 87,
                    DayNumber = 6,
                    Description = "Свободно време за плаж и почивка. Възможност за посещение на допълнителните екскурзии на място, предложени от фирмата партньор",
                    ActivityId = null,
                    OrganizedOfferId = 14
                },
                new OrganizedOfferDay()
                {
                    Id = 88,
                    DayNumber = 7,
                    Description = "Свободно време за плаж и почивка. Възможност за посещение на допълнителните екскурзии на място, предложени от фирмата партньор",
                    ActivityId = null,
                    OrganizedOfferId = 14
                },
                new OrganizedOfferDay()
                {
                    Id = 89,
                    DayNumber = 8,
                    Description = "След закуска освобождаване на стаите и трансфер до Летище Анталия. директен чартърен полет до София. Кацане на летище София - Терминал 2",
                    ActivityId = null,
                    OrganizedOfferId = 14
                },


                new OrganizedOfferDay()
                {
                    Id = 90,
                    DayNumber = 1,
                    Description = "Отпътуване от София по маршрут ГКПП \"Капитан Андреево\" - Кушадасъ. Нощен преход",
                    ActivityId = null,
                    OrganizedOfferId = 15
                },
                new OrganizedOfferDay()
                {
                    Id = 91,
                    DayNumber = 2,
                    Description = "Пристигане на сутринта в съответния хотел. Настаняване след 14:00 ч. Свободно време. Нощувка",
                    ActivityId = null,
                    OrganizedOfferId = 15
                },
                new OrganizedOfferDay()
                {
                    Id = 92,
                    DayNumber = 3,
                    Description = "Свободен ден и/или по желание включване в допълнителни екскурзии, които се заявяват. заплащат и организират на място от местния контрагент",
                    ActivityId = null,
                    OrganizedOfferId = 15
                },
                new OrganizedOfferDay()
                {
                    Id = 93,
                    DayNumber = 4,
                    Description = "Свободен ден и/или по желание включване в допълнителни екскурзии, които се заявяват. заплащат и организират на място от местния контрагент",
                    ActivityId = null,
                    OrganizedOfferId = 15
                },
                new OrganizedOfferDay()
                {
                    Id = 94,
                    DayNumber = 5,
                    Description = "Свободен ден и/или по желание включване в допълнителни екскурзии, които се заявяват. заплащат и организират на място от местния контрагент",
                    ActivityId = null,
                    OrganizedOfferId = 15
                },
                new OrganizedOfferDay()
                {
                    Id = 95,
                    DayNumber = 6,
                    Description = "Свободен ден и/или по желание включване в допълнителни екскурзии, които се заявяват. заплащат и организират на място от местния контрагент",
                    ActivityId = null,
                    OrganizedOfferId = 15
                },
                new OrganizedOfferDay()
                {
                    Id = 96,
                    DayNumber = 7,
                    Description = "Свободен ден и/или по желание включване в допълнителни екскурзии, които се заявяват. заплащат и организират на място от местния контрагент",
                    ActivityId = null,
                    OrganizedOfferId = 15
                },
                new OrganizedOfferDay()
                {
                    Id = 97,
                    DayNumber = 8,
                    Description = "Свободен ден и/или по желание включване в допълнителни екскурзии, които се заявяват. заплащат и организират на място от местния контрагент",
                    ActivityId = null,
                    OrganizedOfferId = 15
                },
                new OrganizedOfferDay()
                {
                    Id = 98,
                    DayNumber = 9,
                    Description = "Освобождаване на хотела. Отпътуване за България. Нощен преход. Пристигане в България на следващия ден",
                    ActivityId = null,
                    OrganizedOfferId = 15
                },


                new OrganizedOfferDay()
                {
                    Id = 99,
                    DayNumber = 1,
                    Description = "Отпътуване от София, Пазарджик, Пловдив или Димитровград по маршрут ГКПП \"Капитан Андреево\" - Бодрум. Нощен преход",
                    ActivityId = null,
                    OrganizedOfferId = 16
                },
                new OrganizedOfferDay()
                {
                    Id = 100,
                    DayNumber = 2,
                    Description = "Пристигане на сутринта в съответния хотел. Настаняване след 14:00 ч. Свободно време",
                    ActivityId = null,
                    OrganizedOfferId = 16
                },
                new OrganizedOfferDay()
                {
                    Id = 101,
                    DayNumber = 3,
                    Description = "Свободен ден и/или по желание включване в допълнителни екскурзии, които се заявяват. заплащат и организират на място от местния контрагент",
                    ActivityId = null,
                    OrganizedOfferId = 16
                },
                new OrganizedOfferDay()
                {
                    Id = 102,
                    DayNumber = 4,
                    Description = "Свободен ден и/или по желание включване в допълнителни екскурзии, които се заявяват. заплащат и организират на място от местния контрагент",
                    ActivityId = null,
                    OrganizedOfferId = 16
                },
                new OrganizedOfferDay()
                {
                    Id = 103,
                    DayNumber = 5,
                    Description = "Свободен ден и/или по желание включване в допълнителни екскурзии, които се заявяват. заплащат и организират на място от местния контрагент",
                    ActivityId = null,
                    OrganizedOfferId = 16
                },
                new OrganizedOfferDay()
                {
                    Id = 104,
                    DayNumber = 6,
                    Description = "Свободен ден и/или по желание включване в допълнителни екскурзии, които се заявяват. заплащат и организират на място от местния контрагент",
                    ActivityId = null,
                    OrganizedOfferId = 16
                },
                new OrganizedOfferDay()
                {
                    Id = 105,
                    DayNumber = 7,
                    Description = "Свободен ден и/или по желание включване в допълнителни екскурзии, които се заявяват. заплащат и организират на място от местния контрагент",
                    ActivityId = null,
                    OrganizedOfferId = 16
                },
                new OrganizedOfferDay()
                {
                    Id = 106,
                    DayNumber = 8,
                    Description = "Свободен ден и/или по желание включване в допълнителни екскурзии, които се заявяват. заплащат и организират на място от местния контрагент",
                    ActivityId = null,
                    OrganizedOfferId = 16
                },
                new OrganizedOfferDay()
                {
                    Id = 107,
                    DayNumber = 9,
                    Description = "Освобождаване на хотела. Отпътуване за България. Нощен преход. Пристигане в България на следващия ден",
                    ActivityId = null,
                    OrganizedOfferId = 16
                },


                new OrganizedOfferDay()
                {
                    Id = 108,
                    DayNumber = 1,
                    Description = "Отпътуване от София в 05:30 ч. Преминаване на Дарданелите по новият мост „Чанаккале 1915“ с основен отвор от 2023 м. Мостът надминава моста Акаши Кайкьо в Япония с 32 м. и става най-дългият висящ мост в света. Пристигане в Чешме вечерта. Настаняване в хотел Babylon 4*. Вечеря. Нощувка",
                    ActivityId = null,
                    OrganizedOfferId = 17
                },
                new OrganizedOfferDay()
                {
                    Id = 109,
                    DayNumber = 2,
                    Description = "Свободно време за плаж, почивка и разходки. Нощувка",
                    ActivityId = null,
                    OrganizedOfferId = 17
                },
                new OrganizedOfferDay()
                {
                    Id = 110,
                    DayNumber = 3,
                    Description = "Закуска. Свободно време или по желание и срещу допълнително заплащане - Целодневна екскурзия до остров Хиос. След закуска ще преминем с ферибот (40 мин) до остров Хиос (Гърция) - пети по големина от гръцките острови. Добре дошли в Хиос - скрито съкровище в Егейско море, чакащо своите откриватели. Ароматен и гостоприемен през цялата година, Хиос е своеобразна палитра от картини и преживявания. Ще започнем с Пирги - най-голямото и красиво селище след столицата Хиос (Хора). Това изумително кътче може да послужи за вдъхновение на художник или като декор за нетрадиционен филм. Къщите са украсени от горе до долу с рисувани елементи на животни, цветя и геометрични фигури. Ефекта е едновременно деликатен и зашеметяващ. Ще се отправим към манастира „Неа Мони“ – най-важният паметник на острова, включен в списъка на ЮНЕСКО за световното културно наследство. Построен през 11-ти век от византийския император Константин IX Мономах, той е един от най-красивите и стари манастири в Гърция. Разположен на хълм, сгушен сред кипарисови и маслинови дървета, той е пример за прекрасната византийската архитектура и тук се намират световноизвестните зашеметяващи мозайки. Ще продължим към столицата на острова. Ще разгледаме византийската крепост, стария квартал, площад Фруриу, църквата „Агиос Георгиос“ и търговския квартал. Връщане в Чешме. Вечеря. Нощувка",
                    ActivityId = 41,
                    OrganizedOfferId = 17
                },
                new OrganizedOfferDay()
                {
                    Id = 111,
                    DayNumber = 4,
                    Description = "Свободно време за плаж, почивка и релакс в СПА центъра на хотела",
                    ActivityId = null,
                    OrganizedOfferId = 17
                },
                new OrganizedOfferDay()
                {
                    Id = 112,
                    DayNumber = 5,
                    Description = "Закуска. Свободно време или по желание и срещу допълнително заплащане – Екскурзия до Измир. Днес ще посетим забележителния съвременен град Измир или древна Смирна. Измир е третият по големина град в Турция и един от най-големите търговски центрове в страната, благодарение на ключовото географско разположение на брега на Егейско море. Градът е едно от най-старите селища в Средиземноморския басейн и съществува повече от 3500 години. Древна Смирна е била една от най-развитите култури, сравнима дори с Троя. Апогея в своето развитие градът бележи между 650 г. до 545 г. пр. Хр. По време на нашата обиколка с местен екскурзовод ще разгледате Агората на хълма Кадифекале, Етнографския музей, Асансьорът на Измир – построен от местен жител през 1907 г. и някога задвижван със силата на водата. Днес той е електрифициран и предоставя на посетителите прекрасна панорамна гледка и възможност за романтичен обяд или вечеря в ресторанта на върха. Ще посетите и площад „Конак“, на който величествено се извисява Часовниковата кула \"Сахат Кулеси\". Тя е красива мраморна кула, висока 25 метра и пищно украсена и декорирана. Построена е от френски архитект Пере и е и в завършена за 25-годишнината от качването на престола на Абдулхамид II през 1901 г. Свободно време на колоритният пазар Кемералтъ. Връщане в хотела. Вечеря. Нощувка",
                    ActivityId = 42,
                    OrganizedOfferId = 17
                },
                new OrganizedOfferDay()
                {
                    Id = 113,
                    DayNumber = 6,
                    Description = "Свободно време за плаж и почивка",
                    ActivityId = null,
                    OrganizedOfferId = 17
                },
                new OrganizedOfferDay()
                {
                    Id = 114,
                    DayNumber = 7,
                    Description = "Закуска. Свободно време или по желание и срещу допълнително заплащане -  Полудневна екскурзия до Алачатъ. Райското градче Алачатъ е разположено само на 9.5 км от Чешме. Това място кара сетивата на всеки посетител да ликуват, а сърцето му да бие учестено. Алачатъ е турски град с гръцка история, който днес размива границите между двете. Това любимо както на чуждестранните туристи, така и на местните жители, място, предлага на своите посетители слънчеви дни на зашеметяващите плажове, оживени нощи в баровете и ресторантите и мързеливи разходки по очарователни, сенчести калдъръмени улици. Докато се разхождате из града, наистина се чувствате като в Гърция. Старите каменни къщи са красиво реставрирани, а боядисаните в блестящи, ярки цветове врати и прозоречни капаци са увенчани елегантно от разцъфнали бугенвилии. Не пропускайте да се разходите и до вятърните мелници от XIX век, които бдят над града. Връщане в хотела за обяд. Свободно време. Вечеря. Нощувка",
                    ActivityId = 43,
                    OrganizedOfferId = 17
                },
                new OrganizedOfferDay()
                {
                    Id = 115,
                    DayNumber = 8,
                    Description = "Закуска. След закуска освобождаване на стаите. Отпътуване за България. Пристигане в Хасково, Пловдив, Пазарджик и София около полунощ",
                    ActivityId = null,
                    OrganizedOfferId = 17
                },


                new OrganizedOfferDay()
                {
                    Id = 116,
                    DayNumber = 1,
                    Description = "Отпътуване от летище София с полет на авиокомпания \"Wizz Air\" по маршрут София – Лисабон. Пристигане на летището в Лисабон. Трансфер до хотела. Настаняване. Нощувка",
                    ActivityId = null,
                    OrganizedOfferId = 18
                },
                new OrganizedOfferDay()
                {
                    Id = 117,
                    DayNumber = 2,
                    Description = "Закуска. Панорамна обиколка на Лисабон с местен екскурзовод: площад \"Маракеш де Помбал\"; квартал Байша, реставриран след земетресението през 1755 г.: площадите \"Росио\", \"Фигейра\" и \"Комерсио\"; Статуята на мореплавателите, кулата \"Белем\" и манастирът \"Жеронимош\", считан за шедьовър на португалското мануелско изкуство, чийто основоположник е крал Мануел. Следобед свободно време за посещение на стария квартал Алфама, известен с тесните си улички, традиционните фадо ресторанти и многото барове, където изкачването става с ретро трамвай (необходимо е ползване на местен и градски транспорт). По желание фадо шоу с включени 2 напитки (около 22.00 ч. взимане от хотела, 22.30 ч. пристигане в ресторанта, около 00.30 - 01.00 ч. връщане в хотела). Нощувка",
                    ActivityId = 44,
                    OrganizedOfferId = 18
                },
                new OrganizedOfferDay()
                {
                    Id = 118,
                    DayNumber = 3,
                    Description = "Закуска. Свободно време или по желание целодневна екскурзия до Обидуш, Назаре и Фатима – ден, през който ще посетите едни от най-известните исторически места в Португалия. Забравете настоящето и се върнете назад във времето в село Обидуш, заобиколено от крепостните стени, зад които се намират традиционни бели къщи и малки търговски улички, които водят към замъка. Отпътуване за Назаре, който в миналото е бил малко рибарско селце, а в наши дни е известен не само с риболова, но и с хубавите си плажове, прекрасната кухня и уникалните местни народни носии. Посещение на Фатима – център на католическата вяра и дестинация за поклонници от цял свят. Връщане в хотела. Нощувка",
                    ActivityId = 45,
                    OrganizedOfferId = 18
                },
                new OrganizedOfferDay()
                {
                    Id = 119,
                    DayNumber = 4,
                    Description = "Закуска. Свободно време в Лисабон – необходимо е ползване на местен и градски транспорт или туристическа програма по желание: екскурзия до Синтра - приказен град на феи и добри вълшебници, лятна резиденция на португалското кралско семейство от 12 в., включена в списъка на ЮНЕСКО за световно културно наследство и нос Кабо да Рока - най-западната точка на Европейския континент, където \"свършва Земята и започва Морето\". Трансфер до летището. Отпътуване за България с полет на авиокомпания \"Wizz Air\". Пристигане на летище София",
                    ActivityId = 46,
                    OrganizedOfferId = 18
                },


                new OrganizedOfferDay()
                {
                    Id = 120,
                    DayNumber = 1,
                    Description = "Среща на летище Варна два часа преди полета, около 10:00ч. Oтпътуване в 12:00 ч. от летище Варна за Прага с полет на авиокомпания Bulgaria Air. Кацане в Прага около 14:00 ч. Обзорна обиколка на Прага – включена в цената на пакета. Трансфер до хотелите за настаняване. Свободно време. Нощувка",
                    ActivityId = null,
                    OrganizedOfferId = 19
                },
                new OrganizedOfferDay()
                {
                    Id = 121,
                    DayNumber = 2,
                    Description = "Закуска. Свободно време и възможност за допълнителна екскурзия: Екскурзия до Дрезден – столицата на Саксония, известна като \"Флоренция на Елба”. Пешеходна разходка - комплекса Цвингер, Оперния площад, Кралската катедрала, катедралата Фрауенкирхе. Свободно време и възможност за посещение на музеи - бароковия дворец \"Цвингер”, прочут с Музея на порцелана, Оръжейния музей и една от най-богатите картинни галерии в света, известна с шедьовъра на Рафаело – \"Сикстинската Мадона”. * Входните такси на музеите не са включени в цената на тура. Свободно време. Връщане в Прага. Нощувка",
                    ActivityId = 47,
                    OrganizedOfferId = 19
                },
                new OrganizedOfferDay()
                {
                    Id = 122,
                    DayNumber = 3,
                    Description = "Закуска. Свободно време и възможност за допълнителна екскурзия: Екскурзия до Карлови Вари - един от най-старите европейски балнео-курорти, известен с лечебния ефект на горещите си минерални извори, Бехеровката и стъкларските изделия. Връщане в Прага. Нощувка",
                    ActivityId = 48,
                    OrganizedOfferId = 19
                },
                new OrganizedOfferDay()
                {
                    Id = 123,
                    DayNumber = 4,
                    Description = "Закуска. Освобождаване на хотела. Свободно време. Трансфер до летището за полет на авиокомпания Bulgaria Air за Варна в 14:00ч. Кацане на летище Варна около 16:10ч.",
                    ActivityId = null,
                    OrganizedOfferId = 19
                },


                new OrganizedOfferDay()
                {
                    Id = 124,
                    DayNumber = 1,
                    Description = "Среща в 10.55 ч. на летище София, Терминал 2. за полет София – Рим с Bulgaria Air. Пристигане в Рим , следва полет Рим - Буенос Айрес с ITA Airways",
                    ActivityId = null,
                    OrganizedOfferId = 20
                },
                new OrganizedOfferDay()
                {
                    Id = 125,
                    DayNumber = 2,
                    Description = "Пристигане в Буенос Айрес сутринта.  Трансфер до хотел. Свободно време за първи впечатления от най-европейския град на Латинска Америка. Нощувка в Буенос Айрес",
                    ActivityId = null,
                    OrganizedOfferId = 20
                },
                new OrganizedOfferDay()
                {
                    Id = 126,
                    DayNumber = 3,
                    Description = "Закуска и ще имате малко свободно време, тъй като от 14.00 ч.  ще започне нашата  панорамна  туристическа обиколка  на  Буенос  Айрес. Като начало започваме с  чаровния квартал „Ла Бока”, най-големият типично италиански район, където много артисти и художници предлагат своите великолепни творби, а всяка събота и неделя тук има пазар на художествени произведения и рисунки. Ще се разходим по колоритната пешеходна улица “Caminito”, родното място на тангото.  Ще се потопим в историята на страната сред забележително красивите сгради на историческия комплекс  Пласа де Майо, където е  Парламента, известен още като Розовата къща, Катедралата, Националната банка и архитектурното творение от 18 век – сградата  Кабилдо. Няма да пропуснем и останалите забележителности в града - театър Колон, който е един от най-големите театри в света, известен със своята величествена сграда и безупречна акустика. (само отвън), следва гробницата на Евита Перон в елегантния квартал Реколета, Палермо с фото-стоп на площада на Обединените нации...Вечерта ще имате свободно време и нощувка",
                    ActivityId = null,
                    OrganizedOfferId = 20
                },
                new OrganizedOfferDay()
                {
                    Id = 127,
                    DayNumber = 4,
                    Description = "Закуска. Този ден може да бъде свободен за вас,или да изберете екскурзия до ранчо и среща с гаучоси в пампата *. Ще тръгнем в 09.00 ч. сутринта, за да прекараме един ден сред типичната среда на аржентинските гаучоси. Тук  ще имате възможност да участвате или наблюдавате обяздване на коне, да наблюдавате шоу на гаучосите с танци и да опитате от  чая мате. Очаква ви вкусен обяд с местни специалитети  и напитки. Връщане в хотела около 17.00-18.00 ч. Нощувка",
                    ActivityId = 49,
                    OrganizedOfferId = 20
                },
                new OrganizedOfferDay()
                {
                    Id = 128,
                    DayNumber = 5,
                    Description = "Еднодневна екскурзия с ферибот до Монтевидео* с включена туристическа обиколка. Ранна закуска. Тръгване от хотела в 06.15 ч. В 08.00 ч. – отплаване с кораб от пристанището на Буенос Айрес. В 11.00 ч. - пристигане в Монтевидео. Следва туристическа обиколка: Площада на Независимостта, Сградата на Парламента, театър Солис, закрития пазар на Монтевидео. Обиколката продължава с посещение на аристократичния квартал Карраско, Крайбрежния булевард с хубавите плажове, откъдето имате възможност да се наслаждавате на панорамата на града. В 16.00 ч.- посещение на шопинг центъра “Пунта Каретас”. В 17.00 ч.- трансфер до пристанището. В 19.00 ч. – отпътуване за Буенос Айрес. Пристигане в Буенос Айрес около 23.00 ч. ",
                    ActivityId = 50,
                    OrganizedOfferId = 20
                },
                new OrganizedOfferDay()
                {
                    Id = 129,
                    DayNumber = 6,
                    Description = "Закуска. Този ден ще ви предложим още едно интересно преживяване - екскурзия с корабче по делтата на р.Парана*. Пътува се с автобус до гр.Тигре, откъдето се прави разходка с корабче. Очаква ви едно изключително приятно плаване между острови с хубави вили и къщи по ръкавите на делтата, за да добиете представа как живеят хората извън континенталната част. В 12,30ч.  ще се върнем обратно в Буенос Айрес. Имате възможност за разходка в централанта част на града с пешеходната улица „Флорида’’, където ще се насладите на танцуващи по площадите майстори на аржентинското танго, на редица красиви сгради и множество магазини. Не пропускайте да изпиете чаша кафе в Café Tortoni, открито през 1858 г., средище на културния и политически елит, днес обявено за Национален исторически паметник на Аржентина.  Не пропускайте и другото уникално място  - една от най-големите книжарници в Южна Америка, обявена през 2019 г. от Нешънъл Географик за най-красивата книжарница в света. В сградата с името Еl Ateneo Grand Splendid през 1919 година е открит театър Teatro Gran Splendid. През 2000 година, невероятната със своята архитектура сграда, е преустроена в книжарница, като е запазен изключителният интериор с ложите,  сцената,  и балконите  с оригиналната орнаментика. Представете си -  местата за публиката са превърнати в ....рафтове за книги. Уникално е ! А вечерта, хайде на една незабравима вечер с много танци – посещение на танго шоу*. Нощувка",
                    ActivityId = null,
                    OrganizedOfferId = 20
                },
                new OrganizedOfferDay()
                {
                    Id = 130,
                    DayNumber = 7,
                    Description = "Закуска. Напускане на Буенос Айрес и връщане към София",
                    ActivityId = null,
                    OrganizedOfferId = 20
                },


                new OrganizedOfferDay()
                {
                    Id = 131,
                    DayNumber = 1,
                    Description = "Отпътуване от Терминал 2 на летище София в 21:25 ч. за Истанбул с полет на авиокомпания „Turkish Airlines“. Кацане на летището в Истанбул в 23:45 ч.",
                    ActivityId = null,
                    OrganizedOfferId = 21
                },
                new OrganizedOfferDay()
                {
                    Id = 132,
                    DayNumber = 2,
                    Description = "Отпътуване за Хавана в 02:05 ч. с полет на авиокомпания „Turkish Airlines“. Кацане на летището в Хавана в 08:55 ч. Посрещане от представител на местната агенция. Отпътуване за Варадеро (около 160 км.). Настаняване в хотела на база All Inclusive (след 14.00 ч.). Свободно време във Варадеро – най-известният курорт на Куба, превърнал се във визитна картичка на острова. Живописните му плажове с белоснежен фин пясък и лазурните води на Атлантическото крайбрежие са на челно място в класацията за най-чисти плажове в света. Плажната ивица на Варадеро се простира на цели 20 км и е защитена от най-големия коралов риф в Карибско море, а приказните морски дълбини и техните обитатели няма да оставят равнодушен нито един от любителите на подводните спортове – на разположение на посетителите са множество дайвинг центрове и огромна територия за гмуркане.  Живата музика, горещите ритми и екзотичните коктейли правят кубинските вечери незабравими. Нощувка",
                    ActivityId = null,
                    OrganizedOfferId = 21
                },
                new OrganizedOfferDay()
                {
                    Id = 133,
                    DayNumber = 3,
                    Description = "Закуска. Свободно време и престой в хотела на база All Inclusive. Нощувка",
                    ActivityId = null,
                    OrganizedOfferId = 21
                },
                new OrganizedOfferDay()
                {
                    Id = 134,
                    DayNumber = 4,
                    Description = "Закуска. Свободно време и престой в хотела на база All Inclusive. Нощувка",
                    ActivityId = null,
                    OrganizedOfferId = 21
                },
                new OrganizedOfferDay()
                {
                    Id = 135,
                    DayNumber = 5,
                    Description = "Закуска. Свободно време и престой в хотела на база All Inclusive. Нощувка",
                    ActivityId = null,
                    OrganizedOfferId = 21
                },
                new OrganizedOfferDay()
                {
                    Id = 136,
                    DayNumber = 6,
                    Description = "Закуска. Напускане на хотела. Екскурзия „По стъпките на Хемингуей и кубинските пури“ с включен обяд в традиционен кубински ресторант: посещение на работилница за пури и запознаване с изкуството на производството на известните кубински пури. По време на презентацията ще научите всичко, свързано с процеса на производството, както и тайната как се разпознава качествената пура. Ще има и демонстрация на живо как се прави истинската кубинска пура. Отпътуване по стъпките на Хемингуей: посещение на вила „Ла Финка Вихия“ – бившият дом на американския писател, превърнат в музей; посещение на Кохимар – малко рибарско селище, вдъхновило Хемингуей да напише известната си творба „Старецът и морето“ и където се намира статуята на писателя, направена от стари котви, подпори и инструменти, събрани от местните рибари; хотел „Амбос Мундос”, където той често отсядал през 1930 г.; автентичните бар-ресторанти „La Bodeguita del Medio” и „Cojimar”, където са създадени популярните днес в цял свят коктейли мохито и дайкири. Отпътуване за Хавана. Настаняване. Нощувка",
                    ActivityId = null,
                    OrganizedOfferId = 21
                },
                new OrganizedOfferDay()
                {
                    Id = 137,
                    DayNumber = 7,
                    Description = "Закуска. Туристическа програма с включен обяд в традиционен кубински ресторант в Хавана: Катедралният площад, Площадът на оръжията с Двореца на генерал-капитаните, където днес се помещава Градският музей на Хавана; морската алея „Малекон“; площад „Свети Франциск от Асизи“ с едноименния манастир, построен през XVII век и седалище на францисканците до XIX в.; посещение на популярния музей „Клуб Хавана Ром“ с възможност за дегустация на известния ром; Площадът на Революцията. Свободно време във Хавана. Вечеря с двучасов концерт в клуб \"Habana Cafe\", по време на който се изпълняват едни от най-известните кубински песни (включени са две напитки по време на вечерята и трансфер). Нощувка",
                    ActivityId = null,
                    OrganizedOfferId = 21
                },
                new OrganizedOfferDay()
                {
                    Id = 138,
                    DayNumber = 8,
                    Description = "Закуска. Целодневна екскурзия с включен обяд до долината Винялес в Пинар дел Рио – уникален пейзаж, осеян с гъсти гори и хълмове от гигантски карстови образувания, наречени „моготи“. Фотопауза при Лос Хасминес, откъдето се открива удивителна гледка към долината и моготите. Прекрасната долина е обградена от величествени коркови палми. Това е един от най-плодородните райони на Куба, където се отглежда, събира, суши и преработва най-висококачественият тютюн в света. Тютюневото растение достига пълната си височина между ноември и февруари. След като реколтата приключи, до октомври се засаждат други култури като маланга, юка, царевица. През 1999 г. долината Винялес е обявена за обект на световното наследство на ЮНЕСКО. Разходка с лодка през Пещерата на индианците – част от най-старата пещерна система в Куба. Разглеждане на гигантската праисторическа фреска на художника Леовихилдо Гонсалес върху 120-метрова скала – реплика на праисторически рисунки, разкриващи еволюцията на живота в планината Сиера де лос Органос. Връщане обратно в Хавана. Нощувка",
                    ActivityId = null,
                    OrganizedOfferId = 21
                },
                new OrganizedOfferDay()
                {
                    Id = 139,
                    DayNumber = 9,
                    Description = "Закуска (сух пакет). Трансфер до летището. Отпътуване в 10:25 ч. за Истанбул с полет на авиокомпания „Turkish Airlines“. Междинно спиране в Каракас (около 2 часа, без слизане от самолета)",
                    ActivityId = null,
                    OrganizedOfferId = 21
                },
                new OrganizedOfferDay()
                {
                    Id = 140,
                    DayNumber = 10,
                    Description = "Кацане на летището в Истанбул в 10:05 ч. Отпътуване за София в 14:45 ч. с полет на авиокомпания „Turkish Airlines“. Кацане на летище София (Терминал 2) в 15:05 ч. ",
                    ActivityId = null,
                    OrganizedOfferId = 21
                },


                new OrganizedOfferDay()
                {
                    Id = 141,
                    DayNumber = 1,
                    Description = "Среща на летище София за редовен полет до Мадрид. Кратък престой и полет до Лима, столицата на Перу.\r\nКацане на летище Хорхе Чавес в 18:15 местно време.\r\nПосрещане и трансфер до избрания хотел в Лима. Настаняване и нощувка",
                    ActivityId = null,
                    OrganizedOfferId = 22
                },
                new OrganizedOfferDay()
                {
                    Id = 142,
                    DayNumber = 2,
                    Description = "Закуска. Целодневна панорамна обиколка на Лима. Връщане в хотел. Вечеря. Нощувка",
                    ActivityId = null,
                    OrganizedOfferId = 22
                },
                new OrganizedOfferDay()
                {
                    Id = 143,
                    DayNumber = 3,
                    Description = "Закука. Свободно време и възможност за наслаждаванена удобствата на хотела",
                    ActivityId = null,
                    OrganizedOfferId = 22
                },
                new OrganizedOfferDay()
                {
                    Id = 144,
                    DayNumber = 4,
                    Description = "Закука. Свободно време и възможност за наслаждаванена удобствата на хотела",
                    ActivityId = null,
                    OrganizedOfferId = 22
                },
                new OrganizedOfferDay()
                {
                    Id = 145,
                    DayNumber = 5,
                    Description = "Закука. Свободно време и възможност за наслаждаванена удобствата на хотела",
                    ActivityId = null,
                    OrganizedOfferId = 22
                },
                new OrganizedOfferDay()
                {
                    Id = 146,
                    DayNumber = 6,
                    Description = "Закуска. Напускане на хотела. Връщане в София с полет до Мадрид и прикачване",
                    ActivityId = null,
                    OrganizedOfferId = 22
                },


                new OrganizedOfferDay()
                {
                    Id = 147,
                    DayNumber = 1,
                    Description = "Излитане от летище София в 06:00 ч. за Мюнхен. Кацане в Мюнхен в 07:00 ч. Продължение за Рио де Жанейро в 12:15 ч. Кацане в Рио де Жанейро в 19:05 ч. Посрещане, трансфер и нощувка",
                    ActivityId = null,
                    OrganizedOfferId = 23
                },
                new OrganizedOfferDay()
                {
                    Id = 148,
                    DayNumber = 2,
                    Description = "Закуска в хотела. Целодневна екскурзия, разкриваща историята и съвремието на „Града на чудесата“. Този ден ще се докоснем до красотата и съкровищата на Рио: от цветните стенописи, въплатили духа и веселието на кариоките, през помпозния рококо интериор на старата кралска църква и тишината на португалските книгите до неофутуристичния шедьовър на Калатрава – една мечта за живот, посветен на опазването на нашата планета... Денят ни започва с изкачване до 705 м на най-известната планина в Рио де Жанейро – Корковадо с емблематичната статуя на Иисус Христос Изкупителя, която от октомври 1931 г., с разперени ръце посреща и благославя хората в многомилионния град. Изкачването с влакчето ще ни покаже смайващи гледки към красивото Атлантическо крайбрежие, гъстата тропична гора, гранитното сърце на планината и многобройните квартали наоколо. Ще имате време да си направите незабравими снимки, да влезете в параклисчето, изградено в основата на статуята, както и да си купите нещо за спомен от многобройните сувенири, изкушаващи посетителите. Включен обяд в местен ресторант. Продължаваме обиколката с разглеждане на историческата част на града с модерната Катедрала, известното Кафене Коломбо, Кралската библиотека за Португалска литература, Площад XV, Двореца Тирадентес (отвън), сградата на бившия Кралски дворец, Арката Телес, Старата Катедрала, Музеят на Бъдещето (отвън), Стенописите на Кобра и др. Връщане в хотела. Нощувка",
                    ActivityId = null,
                    OrganizedOfferId = 23
                },
                new OrganizedOfferDay()
                {
                    Id = 149,
                    DayNumber = 3,
                    Description = "Закуска. Изкачване с лифт до върха на природния феномен Захарната глава – поредното насищане на сетивата с незабравими гледки. Следобеда ще посетим цветния квартал Санта Тереза с емблематичния трамвай, който ще ни качи на Акведукта на Лапа. По улиците на Санта Тереза и малкото площадче Ларго до Гимараеш времето бавно тече… Санта Тереза е артистичното сърце на Рио и очарова посетителите със своите стръмни калдъръмени улички, весели графити, оживени ресторанти, улични барове, занаятчийски магазинчета, студия, галерии на художници и огромни колониални имения, строени през 18 и 19 в. за заможните бразилски фамилии. Кварталът е разположен върху хълм с централно местоположение, с благоприятен климат и приятен бриз, който разхлажда горещите летни дни. На върха на този хълм са две от забележителностите в Санта Тереза: Паркът на Руините с фантастична гледка на 360о и Чакара до Сеу – Музеят на Кастро Мая, потънал в зеленината на поддържаната тропична градина. За последно този ден си оставяме за разглеждане емблематичните Стълби на Селарон с многобройните цветни мозайки. Връщане в хотела. Вечерта по желание организирано посещение на един от най-ярките нощни клубове Rio Scenarium, където ще се насладите на еклектичната атмосфера, ще пиете кайпириня и ще може да потанцувате под горещите латино ритми. Нощувка",
                    ActivityId = 51,
                    OrganizedOfferId = 23
                },
                new OrganizedOfferDay()
                {
                    Id = 150,
                    DayNumber = 4,
                    Description = "Закуска. Свободно време за почивка, плаж и разходки из прекрасния град. По желание – посещение на съседния град Нитерой, откъдето ще се насладите на фантастичните гледки към планинските върхове на Рио. Ще разгледаме Музея на съвременното изкуство. Футуристичната сграда е завършена през 1996 г. и често я наричат „космическо творение“ и „летяща чиния“. Едни от най-ценните и незабравими „експонати“ вътре са отраженията на Захарната глава и на Корковадо в стъклената фасада. Крепостта Санта Круз ще ни разкрие своите тайни и допълнително ще ни омагьоса с невероятните гледки към Рио. Тази крепост е от 1555 г. и е основното фортификационно съоръжение в залива, привличаща и до днес хиляди търсачи на история и допълваща знанията им за живота и отбраната в колониалната и имперската епохи. Днес Санта Круз е действащо съоръжение и се охранява от щаба на Артилерийската дивизия. Включен обяд в местен ресторант. Връщане в хотела. Свободно време за вечерна разходка по Копакабана за последен коктейл „кайпириня“ на брега на океана. Нощувка",
                    ActivityId = 52,
                    OrganizedOfferId = 23
                },
                new OrganizedOfferDay()
                {
                    Id = 151,
                    DayNumber = 5,
                    Description = "Закуска. Свободно време за почивка, плаж и разходки из прекрасния град",
                    ActivityId = 53,
                    OrganizedOfferId = 23
                },
                new OrganizedOfferDay()
                {
                    Id = 152,
                    DayNumber = 6,
                    Description = "Закуска. Свободно време за почивка, плаж и разходки из прекрасния град",
                    ActivityId = null,
                    OrganizedOfferId = 23
                },
                new OrganizedOfferDay()
                {
                    Id = 153,
                    DayNumber = 7,
                    Description = "Закуска. Напускане ха хотела. Връщане в София чрез прикачвна в Мюнхен",
                    ActivityId = null,
                    OrganizedOfferId = 23
                },


                new OrganizedOfferDay()
                {
                    Id = 154,
                    DayNumber = 1,
                    Description = "Излитане от София в 21:10 ч. с Turkish airlines. Кацане в Истанбул в 22:35 ч. Кратък престой на летището",
                    ActivityId = null,
                    OrganizedOfferId = 24
                },
                new OrganizedOfferDay()
                {
                    Id = 155,
                    DayNumber = 2,
                    Description = "Излитане за Токио в 02:20 ч. Кацане на летище Ханеда, Токио в 19:25 ч. Посрещане от представител на фирмата партньор на място. Трансфер до хотела. Настаняване в хотел. Нощувка",
                    ActivityId = null,
                    OrganizedOfferId = 24
                },
                new OrganizedOfferDay()
                {
                    Id = 156,
                    DayNumber = 3,
                    Description = "Закуска. В 09:00 ч. вашият гид ще ви вземе от хотела. Първата ни спирка е парка Chidorigafuchi. Разходката до императорския дворец предлага невероятно красива гледка. Следва Yasukuni Shrine — шинтоистки храм, разположен в Чиода, Токио. Основан е от император Мейджи през юни 1869 г. и отбелязва в памет на загиналите в служба на Япония войни. Тук са изброени имената, произхода, рождените дати и местата на смъртта на 2 466 532 души. Ще посетим храмът Asakusa Kannon, един от най-колоритните и популярни будистки храмове в Токио, разположен в Асакуса. Легендата разказва, че през 628 г. двама братя извадили статуя на Кannon, богинята на милосърдието, от река Сумида и въпреки че върнали статуята обратно в реката, тя винаги се връщала при тях. Храмът е завършен през 645 г., което го прави най-старият в Токио. След това  ще се приберем в хотела. Свободно време. Нощувка",
                    ActivityId = null,
                    OrganizedOfferId = 24
                },
                new OrganizedOfferDay()
                {
                    Id = 157,
                    DayNumber = 4,
                    Description = "Закуска. В 09:00 ч. ще се отправим на еднодневен тур в Токио. Meiji Jingu е шинтоистко светилище в Япония, разположено на 70 хектара, в средата на мегаполиса Токио. Тук ще забравите за суматоха на оживения град и ще се потопите в традиционния японски пейзаж, заобиколени от зеленина. Ще продължим към сградата на столичната община (Tokyo City Hall), разположена в район Shinjuku. Това е най-високото кметство в света. Сградата е проектирана от Kenzo Tange и е завършена през декември 1990 г. Дизайнът на сградата е трябвало да наподобява интегрална схема, като същевременно да напомня вид на готическа катедрала. Има двете панорамни площадки за наблюдение на 202 метра височина, гледката от които е прекрасна. Пред нас се открива целият мегаполис, а при ясно време и планината Фуджи. В 17:00 ч. обратно към хотела. Ще имаме свободно време в Ginza, eдин от най-добрите търговски райони в града с множество луксозни бутици. Нощувка",
                    ActivityId = null,
                    OrganizedOfferId = 24
                },
                new OrganizedOfferDay()
                {
                    Id = 158,
                    DayNumber = 5,
                    Description = "Закуска. Свободно време и възможност за самостоятелно разглеждане",
                    ActivityId = null,
                    OrganizedOfferId = 24
                },
                new OrganizedOfferDay()
                {
                    Id = 159,
                    DayNumber = 6,
                    Description = "Закуска. Свободно време и възможност за самостоятелно разглеждане",
                    ActivityId = null,
                    OrganizedOfferId = 24
                },
                new OrganizedOfferDay()
                {
                    Id = 160,
                    DayNumber = 7,
                    Description = "Закуска. Напускане на хотела. Връщане в София чрез прикачване в Инстанбул",
                    ActivityId = null,
                    OrganizedOfferId = 24
                },


                new OrganizedOfferDay()
                {
                    Id = 161,
                    DayNumber = 1,
                    Description = "Излитане от София в 21:10 ч. с Turkish airlines. Кацане в Истанбул в 22:35 ч. Кратък престой на летището",
                    ActivityId = null,
                    OrganizedOfferId = 25
                },
                new OrganizedOfferDay()
                {
                    Id = 162,
                    DayNumber = 2,
                    Description = "Излитане за Киото в 02:20 ч. Кацане на летище в Киото в 19:25 ч. Посрещане от представител на фирмата партньор на място. Трансфер до хотела. Нощувка",
                    ActivityId = null,
                    OrganizedOfferId = 25
                },
                new OrganizedOfferDay()
                {
                    Id = 163,
                    DayNumber = 3,
                    Description = "Закуска. Програмата ни днес ще започне с храма Кинкакуджи (Kinkakuji Temple) — дзен-будистки храм с изключително красив градински комплекс, признат за част от 17-те Исторически паметници на древно Киото и част от Световното наследство на ЮНЕСКО. Ще разгледаме и друг известен дзен будистки храм Рьоан-джи (Ryoanji Temple), след което ще продължим за традиционния обяд \"Shojin\" в храмов ресторант. Почти хилядолетие японските дзен-будисти са приготвяли шоджин или „кухня на предаността“, приготвени без месо или риба. След обяда продължаваме с един от най-известните храмове в Япония — Kiyomizu Temple, което буквално преведено означава „Храм на чистата вода“. Следва свободно време и разходка в квартала Гион — старата част на Киото, осеяна с множество ресторанти, магазини и тесни улички. В 20:00 ч. с автобус ще отидем до замъка Nijo-jo, който е бил резиденция на управляващия шогун по време на първия шогунат от периода Едо (1603-1867). 21:00 ч. е последния възможен час за влизане в замъка. Връщане в хотела пеша или с директен влак. Нощувка",
                    ActivityId = null,
                    OrganizedOfferId = 25
                },
                new OrganizedOfferDay()
                {
                    Id = 164,
                    DayNumber = 4,
                    Description = "Закука. Свободно време и възможност за самостоятелна разглеждане на града",
                    ActivityId = null,
                    OrganizedOfferId = 25
                },
                new OrganizedOfferDay()
                {
                    Id = 165,
                    DayNumber = 5,
                    Description = "Закука. Свободно време и възможност за самостоятелна разглеждане на града",
                    ActivityId = null,
                    OrganizedOfferId = 25
                },
                new OrganizedOfferDay()
                {
                    Id = 166,
                    DayNumber = 6,
                    Description = "Закука. Свободно време и възможност за самостоятелна разглеждане на града",
                    ActivityId = null,
                    OrganizedOfferId = 25
                },
                new OrganizedOfferDay()
                {
                    Id = 167,
                    DayNumber = 7,
                    Description = "Закуска. Напускане на хотела. Връщане в София чрез прикачване в Инстанбул",
                    ActivityId = null,
                    OrganizedOfferId = 25
                },


                new OrganizedOfferDay()
                {
                    Id = 168,
                    DayNumber = 1,
                    Description = "Излитане от Летище София с трансферен полет на Търкиш Еърлайнс през Истанбул",
                    ActivityId = null,
                    OrganizedOfferId = 26
                },
                new OrganizedOfferDay()
                {
                    Id = 169,
                    DayNumber = 2,
                    Description = "Кацане в Шри Ланка на летището в Коломбо рано сутринта. Трансфер до хотел. Трансферът се извършва с лицензиран автобус/минибус. При пристигане - посрещане в хотела, настаняване. Свободно време. Вечеря. Нощувка",
                    ActivityId = null,
                    OrganizedOfferId = 26
                },
                new OrganizedOfferDay()
                {
                    Id = 170,
                    DayNumber = 3,
                    Description = "Закуска. Панорамна обиколка около Канди. Вечеря. Нощувка",
                    ActivityId = null,
                    OrganizedOfferId = 26
                },
                new OrganizedOfferDay()
                {
                    Id = 171,
                    DayNumber = 4,
                    Description = "Закуска. Свободно време за плаж и разпускане",
                    ActivityId = null,
                    OrganizedOfferId = 26
                },
                new OrganizedOfferDay()
                {
                    Id = 172,
                    DayNumber = 5,
                    Description = "Закуска. Свободно време за плаж и разпускане",
                    ActivityId = null,
                    OrganizedOfferId = 26
                },
                new OrganizedOfferDay()
                {
                    Id = 173,
                    DayNumber = 6,
                    Description = "Закуска. Свободно време за плаж и разпускане",
                    ActivityId = null,
                    OrganizedOfferId = 26
                },
                new OrganizedOfferDay()
                {
                    Id = 174,
                    DayNumber = 7,
                    Description = "След закуска освобождаване на стаите и трансфер до летището за сутрешен трансферен полет за София през Истанбул",
                    ActivityId = null,
                    OrganizedOfferId = 26
                },


                new OrganizedOfferDay()
                {
                    Id = 175,
                    DayNumber = 1,
                    Description = "Кацане в Пекин. Веднага след като Вашият екскурзовод Ви посрещне на летището ще се отправите към красивият „Jingshan Park” (включено в цената). Паркът се намира на върха на хълма „Jing Shan“, чието създаване е започнало още през 1416 г., когато на същото място са започнали да трупат пръст и почва, изкопана при оформянето и изграждането на Императорския дворец, рововете и каналите около него. От  върха на хълма се открива невероятна панорама към Забраненият град и Пекин. Трансфер до хотела и нощувка",
                    ActivityId = null,
                    OrganizedOfferId = 27
                },
                new OrganizedOfferDay()
                {
                    Id = 176,
                    DayNumber = 2,
                    Description = "Закуска. Свободно време или целодневна екскурзия до площад Тиенанмън, Забранения град и „Храма на небето“. Площад Тиенанмън е един от най-впечатляващите и големи площади в света, намиращ се в центъра на Пекин и способен да побере над един милион души. Площадът носи името на вратата „Тиенанмън“ (в буквален превод „Вратата на небесното спокойствие“), построена в северната част на площада, която го отделя от Забранения град. Тук се намира мавзолеят на видния китайски политик Мао Дзъдун. Следва посещение на Забранения град, където ще се впечатлите от залите и градините на най-голямата древна дворцова структура в света. Това е най-добре запазеният императорски дворец в Китай и място с голямо историческо значение (затворен всеки понеделник). Градът получава името си, защото дворцовият комплекс е бил недостъпен за обикновените китайци. Всеки, който е бил хванат да нахлува в Забранения град без разрешение, бива подлоган на строго наказание, включително екзекуция. Изключителността на Забранения град имала за цел да подчертае божествения и върховен статут на императора като син на небето.\r\nХрамът на Небето представлява даоистки комплекс, състоящ се от храмови сгради. Разположен е на мраморна тераса в южната част на Пекин в парка \"Тиантан\". Построен е на три етажа, над които се издигат конусовидни покриви, направени от над 50 000 тъмносини глазирани керемиди и е най-добре запазилият се архитектурен паметник от династията Мин. Тук императорите са идвали, за да се молят на боговете за милост и за добра реколта. Церемонията за почитането на небето била най-специалната дейност на императорите от династият Мин и Цин- нещо, което обикновените хора нямат право да извършат. Трансфер до хотела и нощувка",
                    ActivityId = 54,
                    OrganizedOfferId = 27
                },
                new OrganizedOfferDay()
                {
                    Id = 177,
                    DayNumber = 3,
                    Description = "Закуска. Свободно време или посещение на Великата китайска стена. Juyongguan е един от трите най-известни маршрути по Великата китайска стена, заедно с Jiayuguan и Shanhaiguan. Намира се на 75 км северозападно от Пекин и минава през уникална планинска природа. Juyongguan е строен през 770-475 г. пр.н.е. и има дължина 2484 мили. Изкачването до върха е невероятно. Тази част от стената се състои от 14 високи и стръмни наблюдателни кули, които осигуряват прекрасна гледка към хълмовете. На връщане ще се отправите към парка Олимпия и Националния стадион в Пекин, наричан „Птиче гнездо“, заради футуристичния си дизайн – едно от най-внушителните съоръжения в Китай, където ще имате фото пауза. Трансфер до хотела и нощувка",
                    ActivityId = 55,
                    OrganizedOfferId = 27
                },
                new OrganizedOfferDay()
                {
                    Id = 178,
                    DayNumber = 4,
                    Description = "Закуска. Свободно време или посещение на Летния дворец и Храма на Лама „Yonghe Temple“. Сградите и дворовете на Летния дворец са красиво декорирани и заредени с много история. На негова територия се намира най-добре запазената и най-голямата императорска градина, съществуваща в Китай. Ще направите разходка с лодка до Хълма на дълголетието (предлага се на място). Следва посещение на храма „Yonghe Temple“ или Храм Лама. Храмът Лама е един от най-колоритните и оживени храмове в Пекин. Известен със своите извити покриви, страхотни стенописи, великолепни декоративни арки, гоблени, огледала и тантрически статуи, смесващи се в плътни облаци тамян. Това е най-големият будистки манастир извън Тибет, който е бил построен като имение за император Йончжън от династията Цин, когато той е бил принц. Връщане в хотела, а за тези, които имат включен пакет „Вечери“ им предстои да опитат превъзходната печена патица по пекински - тръгване от хотела 19:00-19:30, вечеря около 20:00. Нощувка",
                    ActivityId = 56,
                    OrganizedOfferId = 27
                },
                new OrganizedOfferDay()
                {
                    Id = 179,
                    DayNumber = 5,
                    Description = "Закуска. Свободно време и възможност за самостоятелно разглеждане на града",
                    ActivityId = null,
                    OrganizedOfferId = 27
                },
                new OrganizedOfferDay()
                {
                    Id = 180,
                    DayNumber = 6,
                    Description = "Закуска. Свободно време и възможност за самостоятелно разглеждане на града",
                    ActivityId = null,
                    OrganizedOfferId = 27
                },
                new OrganizedOfferDay()
                {
                    Id = 181,
                    DayNumber = 7,
                    Description = "Закуска. Напускане на хотела. Връщане в София чрез прикачване.",
                    ActivityId = null,
                    OrganizedOfferId = 27
                },


                new OrganizedOfferDay()
                {
                    Id = 182,
                    DayNumber = 1,
                    Description = "Полет от София за Сингапур през транзитно летище",
                    ActivityId = null,
                    OrganizedOfferId = 28
                },
                new OrganizedOfferDay()
                {
                    Id = 183,
                    DayNumber = 2,
                    Description = "Пристигане в Сингапур . Трансфер до хотела и настаняване. Свободно време. Привечер – разходка в Сингапур и възможност за първи впечатления от града. По желание - вечеря за двама в кабината на местното „виенско колело”, докато се наслаждавате на гледката на нощен Сингапур(уговаря се на място). Нощувка в Сингапур",
                    ActivityId = null,
                    OrganizedOfferId = 28
                },
                new OrganizedOfferDay()
                {
                    Id = 184,
                    DayNumber = 3,
                    Description = "Закуска. Туристическа обиколка на Сингапур, която започва със статуята на Мерлиона – символ на Сингапур, продължаваме с разглеждане на: Chinatown – кварталът е културен център на Сингапур и все още може да Ви даде възможност да надникнете в миналото и някогашният облик на града, защото е запазил тесните си улички, многобройни храмове, тераси и многобройните живописни пазари. Тук се посещава най-интересния китайски храм в Сингапур Thiang Hong Keng Temple. След това продължаваме с разходка в колоритния квартал “Малка Индия“ с многобройните улички, изпъстрени с богата палитра от магазини, “Колониален Сингапур”– Empress Place Building, импозантна викторианска сграда, сега музей, катедрала “Сейнт Андрю” и др. По желание - посещение на панорамната площадка на хотел “Marina Bay Sands”. След обяд – свободно време с възможност за разглеждане на една от новите забележителности на Сингапур - „The Gardens by the Bay”. По желание - посещение на „Градината на орхидеите”. Нощувка в Сингапур",
                    ActivityId = null,
                    OrganizedOfferId = 28
                },
                new OrganizedOfferDay()
                {
                    Id = 185,
                    DayNumber = 4,
                    Description = "Закуска. Свободно време. След обяд, по желание – полудневна екскурзия до остров Сентоса – „Островът на удоволствията“. Островът е най-посещаваната градска атракция, считан за прародител на Сингапурските паркове – с музеи, аквариуми, паркове, алеи за разходка и езда, невероятни плажове, ресторанти и барове. С автобус имате възможност да разгледате острова и да спирате при всяка атракция: статуята на Мерлиона, който е полу-риба/полу-лъв и е символът на Сингапур, Аквариума, Делфинариума, където имате възможност да видите шоуто на делфините и др. Свободно време с възможност за плаж. Вечерта – посещение на шоуто ”Светлина и звук“, където танцът на цветните фонтани, създаден с най-модерната техника ще Ви достави невероятно удоволствие. Връщане в хотела в Сингапур. Нощувка в Сингапур",
                    ActivityId = 57,
                    OrganizedOfferId = 28
                },
                new OrganizedOfferDay()
                {
                    Id = 186,
                    DayNumber = 5,
                    Description = "Закуска. Свободно време и възможност за разглеждане на града самостоятелно",
                    ActivityId = null,
                    OrganizedOfferId = 28
                },
                new OrganizedOfferDay()
                {
                    Id = 187,
                    DayNumber = 6,
                    Description = "Закуска. Свободно време и възможност за разглеждане на града самостоятелно",
                    ActivityId = null,
                    OrganizedOfferId = 28
                },
                new OrganizedOfferDay()
                {
                    Id = 188,
                    DayNumber = 7,
                    Description = "Закуска. Напускане ха хотела. Връщане в София през транзитно летище",
                    ActivityId = null,
                    OrganizedOfferId = 28
                },


                new OrganizedOfferDay()
                {
                    Id = 189,
                    DayNumber = 1,
                    Description = "Полет от летище София за Мале през Истанбул с Турски авиолинии. Кацане на летището в Истанбул",
                    ActivityId = null,
                    OrganizedOfferId = 29
                },
                new OrganizedOfferDay()
                {
                    Id = 190,
                    DayNumber = 2,
                    Description = "Полет за Мале. Пристигане в Мале в 08,00ч. Посрещане от фирмата ни партньор и трансфер до резорта. Пристигане в хотела и настаняване. Нощувка",
                    ActivityId = null,
                    OrganizedOfferId = 29
                },
                new OrganizedOfferDay()
                {
                    Id = 191,
                    DayNumber = 3,
                    Description = "Закуска Свободно време или допълнителна екскурзия(уговаря се на място). Нощувка",
                    ActivityId = null,
                    OrganizedOfferId = 29
                },
                new OrganizedOfferDay()
                {
                    Id = 192,
                    DayNumber = 4,
                    Description = "Закуска Свободно време или допълнителна екскурзия(уговаря се на място). Нощувка",
                    ActivityId = null,
                    OrganizedOfferId = 29
                },
                new OrganizedOfferDay()
                {
                    Id = 193,
                    DayNumber = 5,
                    Description = "Закуска Свободно време или допълнителна екскурзия(уговаря се на място). Нощувка",
                    ActivityId = null,
                    OrganizedOfferId = 29
                },
                new OrganizedOfferDay()
                {
                    Id = 194,
                    DayNumber = 6,
                    Description = "Закуска Свободно време или допълнителна екскурзия(уговаря се на място). Нощувка",
                    ActivityId = null,
                    OrganizedOfferId = 29
                },
                new OrganizedOfferDay()
                {
                    Id = 195,
                    DayNumber = 7,
                    Description = "Закуска Свободно време или допълнителна екскурзия(уговаря се на място). Нощувка",
                    ActivityId = null,
                    OrganizedOfferId = 29
                },
                new OrganizedOfferDay()
                {
                    Id = 196,
                    DayNumber = 8,
                    Description = "Закуска Свободно време или допълнителна екскурзия(уговаря се на място). Нощувка",
                    ActivityId = null,
                    OrganizedOfferId = 29
                },
                new OrganizedOfferDay()
                {
                    Id = 197,
                    DayNumber = 9,
                    Description = "Ранна закуска. Трансфер до летището в Мале за полет на Турски авиолинии в 09:40 ч. Кацане на летището в Истанбул и полет за София. Кацане на летище София в 20:45 часа",
                    ActivityId = null,
                    OrganizedOfferId = 29
                },


                new OrganizedOfferDay()
                {
                    Id = 198,
                    DayNumber = 1,
                    Description = "Среща на летище София и изпращане от представител на туроператора. Отпътуване в 10:00 ч. с чартърен полет. Кацане в 12:20 ч. на летище Хургада. Посрещане от фирмата партньор и трансфер до избрания хотел. Настаняване в хотела след 14.00 ч. Свободно време. Вечеря. Нощувка",
                    ActivityId = null,
                    OrganizedOfferId = 30
                },
                new OrganizedOfferDay()
                {
                    Id = 199,
                    DayNumber = 2,
                    Description = "Закуска. Свободно време или възможност за допълнителна полудневна екскурзия подводница Submarine. Ако не обичате да плувате, но желаете да разгледате вълшебния свят под повърхността на водата, то задължително се възползвайте от екскурзията с туристическата подводница Submarine. Подводницата се спуска на 25 метра дълбочина под водата, сред цветовете на Червено море, където за един час ще може да се насладите на изобилие от красиви корали и множество морски рибни видове. Ще се запознаете отблизо с естествената водна среда на едни от най-атрактивните морски обитатели. Продължителност около 3 часа",
                    ActivityId = 58,
                    OrganizedOfferId = 30
                },
                new OrganizedOfferDay()
                {
                    Id = 200,
                    DayNumber = 3,
                    Description = "Закуска. Свободно време или възможност за допълнителна целодневна екскурзия Луксор - Хиляди туристи от целия свят всяка година избират Луксор за своя ваканционна дестинация, за да се насладят на тези паметници на историята и архитектурата. Луксор е идеалното място и за онези, които са решили да посетят Горен Египет. В Луксор е и крайната спирка на корабните пътешествия по река Нил. Отпътуване от хотела около 04:30 ч. за Луксор – древната столица на египетските фараони. Посещение на Карнак - най-големият религиозен комплекс в света, който заема площ от 840 декара. Той е бил известен на древните египтяни като Ипет-Исут (най-святото място) и представлява град от храмове, обособен в 3 зони, посветени на върховният бог Амон, бог Монту и богинята Мут. Най-значителното здание в комплекса е храмът на Амон Ра – истински архитектурен шедьовър, включващ огромна колонна зала, различни храмови помещения и 10 пилона, най-големият от които е 113 м. Разглеждане на Алеята на сфинксовете, която свързва Луксорския и Карнакския храм, с общата дължина около 5 км. По алеята се извършвало шествието на фараоните до карнакския храм. Отпътуване към Долината на царете - пустинна равнина, заобиколена от стръмни хълмове. Разположена е на западния бряг на Нил, близо до град Тива. Тук се намира прочутата гробница на фараона Тутанкамон – една от 62-те открити гробници досега. Посещение на изумителният храм на Хатшепсут – първата жена фараон, управлявала Египет две мирни десетилетия Разглеждане Колосите на Мемнон – две масивни каменни статуи, които представят фараона Аменхотеп III в седнало положение, с ръце на коленете и поглед, насочен на изток към реката и изгряващото слънце. Посещение на местна фабрика за алабастър и музея на папируса. Връщане в хотела около 22 ч. Нощувка",
                    ActivityId = 59,
                    OrganizedOfferId = 30
                },
                new OrganizedOfferDay()
                {
                    Id = 201,
                    DayNumber = 4,
                    Description = "Закуска. Свободно време или възможност за допълнителна целодневна екскурзия Super safary. Отпътуване от хотела към 13 ч. от хотела. Ще можете да видите същността на ландшафта в пустинята – долините и красивите пясъчни планини с червеникавият им оттенък. Запознанството Ви с Египет ще е непълно, ако пропуснете пътуване в пустинята на сафари. Ще имате възможност да се сдобиете с неповторими впечатления от препускането с джипове по дюните, екстремното шофиране на квадроцикли и двуместни бъгита. Ще яздите камила и ще се запознаете отблизо с живота в пустинята, ще посетите малък зоопарк и терариум, ще се насладите на фолклорно шоу (танура, ориенталски танци, огнено шоу). Продължителност на екскурзията около 8 часа. Връщане в хотела. Нощувка",
                    ActivityId = 60,
                    OrganizedOfferId = 30
                },
                new OrganizedOfferDay()
                {
                    Id = 202,
                    DayNumber = 5,
                    Description = "Закуска. Свободно време или възможност за допълнителна целодневна екскурзия Кайро и Пирамидите в Гиза. Екскурзия до Пирамидите – едно от Седемте чудеса на Древния свят и Сфинкса в Гиза – най-големият, най-старият и най-известният от безбройните запазени сфинксове в Египет. Отпътуване от хотела около 02:00 ч. Пирамидите в Гиза от дълго време са най-посещаваната атракция около Кайро. От времето на тяхното изграждане пирамидите в Гиза въплъщават древността, мистерията – и дават повод за невероятни хипотези. Пирамидата на Хеопс е най-старата в Гиза и най-голямата в света, изградена ок. 2500 г. пр.н.е. от близо 2,3 милиона варовикови блокове, тежащи средно по 2,75 тона и придвижвани от 100 000 роби. Трите по-малки пирамиди в съседство принадлежат на Хеопсовите царици или сестри. Посещение на Египетския музей, който пази най-голямата колекция с антики от времето на фараоните в света. В музея има 160 000 артефакти, покриващи 5000 годишна история. Връщане в хотела около 00:30  ч. Нощувка",
                    ActivityId = 61,
                    OrganizedOfferId = 30
                },
                new OrganizedOfferDay()
                {
                    Id = 203,
                    DayNumber = 6,
                    Description = "Закуска. Свободно време или възможност за допълнителна полудневна екскурзия – Дайвинг в красивите рифове на Червено Море. Едно от най-предпочитаните места за гмуркане в света се намира в Египет. В подводния резерват, между разноцветни коралови рифове (тук виреят над 150 вида корали), можете да наблюдавате живота на хиляди морски обитатели. Червено море е описвано като „коридор на чудесата“за гмуркане. Отпътуване от хотела към 8 ч. сутринта. Подводният свят е очарователен, пълен с живот и цветове, непроучен и загадъчен и затова е още по-привлекателен. Гмуркането е начин да се опознае този свят, удивително съчетаващ в себе си нови впечатления, наслада от богатството на подводния свят. Морето е известно със своята разнообразна фауна и впечатляващата чистота на водата, с видимост, която често превишава 45 метра. Голяма част от уникалността на гмуркането в Червено море се дължи на впечатляващото припокриване на ярката красота на пустинята и истинската райска градина във водите на Червено море. Около 10 процента от животинските видове в Червено море не се срещат никъде другаде на Земята. Ще имате възможност да се насладите на гмуркане, прекрасна разходка с лодка и риболов и да наблюдавате невороятният и богатит животински свят на Червено море. Връщане в хотела. Вечеря. Нощувка",
                    ActivityId = 62,
                    OrganizedOfferId = 30
                },
                new OrganizedOfferDay()
                {
                    Id = 204,
                    DayNumber = 7,
                    Description = "Закуска. Свободно време или възможност за допълнителна целодневна екскурзия Orange Island и шнорхелинг. Едно от най-популярните места за екскурзия с лодка и шнорхелинг в Хургада. Екскурзията започва около 8:00 ч. и включва морска разходка с яхта с възможност да се насладите на красотата на един от прекрасните острови и съкровища на кораловия риф, белият пясък и слънчевите лъчи на Червено море. Слизане на плажа на острова за плуване и релакс. Обяд на яхтата. Едно от най-прекрасните места за гмуркане в целия свят е в околностите на острова. Две спирания за гмуркане в близост до коралови рифове. Като за тези, които не са любители на гмуркането няма да им е трудно също да видят и да се полюбуват на красивите морски видове, тъй като водата в Червено море е кристално бистра и чиста. Връщане в хотела около 16:00 часа. Вечеря. Нощувка",
                    ActivityId = 63,
                    OrganizedOfferId = 30
                },
                new OrganizedOfferDay()
                {
                    Id = 205,
                    DayNumber = 8,
                    Description = "Закуска. Освобождаване на хотела. Трансфер до летище Хургада в обявения час от фирмата партньор. Полет за София",
                    ActivityId = null,
                    OrganizedOfferId = 30
                },


                new OrganizedOfferDay()
                {
                    Id = 206,
                    DayNumber = 1,
                    Description = "Излитане от летище София с директен чартърен полет за Хургада. Посрещане на летище Хургада и трансфер до избрания хотел. Настаняване след 14:00 часа. Свободно време. Нощувка",
                    ActivityId = null,
                    OrganizedOfferId = 31
                },
                new OrganizedOfferDay()
                {
                    Id = 207,
                    DayNumber = 2,
                    Description = "Закуска. Свободно време или възможност да се впуснете в опознаване на местните забележителности с разнообразие от допълнителни екскурзиии (резерварат се и се заплащат на място в Египет)",
                    ActivityId = null,
                    OrganizedOfferId = 31
                },
                new OrganizedOfferDay()
                {
                    Id = 208,
                    DayNumber = 3,
                    Description = "Закуска. Свободно време или възможност да се впуснете в опознаване на местните забележителности с разнообразие от допълнителни екскурзиии (резерварат се и се заплащат на място в Египет)",
                    ActivityId = null,
                    OrganizedOfferId = 31
                },
                new OrganizedOfferDay()
                {
                    Id = 209,
                    DayNumber = 4,
                    Description = "Закуска. Свободно време или възможност да се впуснете в опознаване на местните забележителности с разнообразие от допълнителни екскурзиии (резерварат се и се заплащат на място в Египет)",
                    ActivityId = null,
                    OrganizedOfferId = 31
                },
                new OrganizedOfferDay()
                {
                    Id = 210,
                    DayNumber = 5,
                    Description = "Закуска. Свободно време или възможност да се впуснете в опознаване на местните забележителности с разнообразие от допълнителни екскурзиии (резерварат се и се заплащат на място в Египет)",
                    ActivityId = null,
                    OrganizedOfferId = 31
                },
                new OrganizedOfferDay()
                {
                    Id = 211,
                    DayNumber = 6,
                    Description = "Закуска. Свободно време или възможност да се впуснете в опознаване на местните забележителности с разнообразие от допълнителни екскурзиии (резерварат се и се заплащат на място в Египет)",
                    ActivityId = null,
                    OrganizedOfferId = 31
                },
                new OrganizedOfferDay()
                {
                    Id = 212,
                    DayNumber = 7,
                    Description = "Закуска. Свободно време или възможност да се впуснете в опознаване на местните забележителности с разнообразие от допълнителни екскурзиии (резерварат се и се заплащат на място в Египет)",
                    ActivityId = null,
                    OrganizedOfferId = 31
                },
                new OrganizedOfferDay()
                {
                    Id = 213,
                    DayNumber = 8,
                    Description = "Закуска в хотела. Освобождаване на стаите. Трансфер до летището и полет от Хургада за София",
                    ActivityId = null,
                    OrganizedOfferId = 31
                },


                new OrganizedOfferDay()
                {
                    Id = 214,
                    DayNumber = 1,
                    Description = "Среща в София. Транзитивен полет към Макада Бей. Среща с представител на фирмата партньор. Настаняване в хотела. Нощувка",
                    ActivityId = null,
                    OrganizedOfferId = 32
                },
                new OrganizedOfferDay()
                {
                    Id = 215,
                    DayNumber = 2,
                    Description = "Закуска. Свободно време за плаж и разпускане или ексурзия по желание(уговорена на място)",
                    ActivityId = null,
                    OrganizedOfferId = 32
                },
                new OrganizedOfferDay()
                {
                    Id = 216,
                    DayNumber = 3,
                    Description = "Закуска. Свободно време за плаж и разпускане или ексурзия по желание(уговорена на място)",
                    ActivityId = null,
                    OrganizedOfferId = 32
                },
                new OrganizedOfferDay()
                {
                    Id = 217,
                    DayNumber = 4,
                    Description = "Закуска. Свободно време за плаж и разпускане или ексурзия по желание(уговорена на място)",
                    ActivityId = null,
                    OrganizedOfferId = 32
                },
                new OrganizedOfferDay()
                {
                    Id = 218,
                    DayNumber = 5,
                    Description = "Закуска. Свободно време за плаж и разпускане или ексурзия по желание(уговорена на място)",
                    ActivityId = null,
                    OrganizedOfferId = 32
                },
                new OrganizedOfferDay()
                {
                    Id = 219,
                    DayNumber = 6,
                    Description = "Закуска. Напускане на хотела. Връщане в София чрез транзитивен полет",
                    ActivityId = null,
                    OrganizedOfferId = 32
                },


                new OrganizedOfferDay()
                {
                    Id = 220,
                    DayNumber = 1,
                    Description = "Среща в София. Транзитивен полет до дестинацията. Среща с представител на фирма партньор. Настаняване в хотела. Нощувка",
                    ActivityId = null,
                    OrganizedOfferId = 33
                },
                new OrganizedOfferDay()
                {
                    Id = 221,
                    DayNumber = 2,
                    Description = "Закуска. Панорамна обиколка около града(включено в цената). Връщане в хотела. Вечеря. Нощувка",
                    ActivityId = null,
                    OrganizedOfferId = 33
                },
                new OrganizedOfferDay()
                {
                    Id = 222,
                    DayNumber = 3,
                    Description = "Закуска. Свободно време и възможност за разхождане самостоятелно или екскурзия по желание(уговорена на място)",
                    ActivityId = null,
                    OrganizedOfferId = 33
                },
                new OrganizedOfferDay()
                {
                    Id = 223,
                    DayNumber = 4,
                    Description = "Закуска. Свободно време и възможност за разхождане самостоятелно или екскурзия по желание(уговорена на място)",
                    ActivityId = null,
                    OrganizedOfferId = 33
                },
                new OrganizedOfferDay()
                {
                    Id = 224,
                    DayNumber = 5,
                    Description = "Закуска. Свободно време и възможност за разхождане самостоятелно или екскурзия по желание(уговорена на място)",
                    ActivityId = null,
                    OrganizedOfferId = 33
                },
                new OrganizedOfferDay()
                {
                    Id = 225,
                    DayNumber = 6,
                    Description = "Закуска. Напускане на хотела. Връщане в София чрез транзитивен полет",
                    ActivityId = null,
                    OrganizedOfferId = 33
                },


                new OrganizedOfferDay()
                {
                    Id = 226,
                    DayNumber = 1,
                    Description = "Среща в София. Транзитивен полет до остров Джерба. Среща с представител на фирма партньор. Настаняване в хотела. Нощувка",
                    ActivityId = null,
                    OrganizedOfferId = 34
                },
                new OrganizedOfferDay()
                {
                    Id = 227,
                    DayNumber = 2,
                    Description = "Закуска. Панорамна обиколка около острова(включено в цената). Връщане в хотела. Вечеря. Нощувка",
                    ActivityId = null,
                    OrganizedOfferId = 34
                },
                new OrganizedOfferDay()
                {
                    Id = 228,
                    DayNumber = 3,
                    Description = "Закуска. Свободно време и възможност за плаж или екскурзия по желание(уговорена на място)",
                    ActivityId = null,
                    OrganizedOfferId = 34
                },
                new OrganizedOfferDay()
                {
                    Id = 229,
                    DayNumber = 4,
                    Description = "Закуска. Свободно време и възможност за разхождане самостоятелно или екскурзия по желание(уговорена на място)",
                    ActivityId = null,
                    OrganizedOfferId = 34
                },
                new OrganizedOfferDay()
                {
                    Id = 230,
                    DayNumber = 5,
                    Description = "Закуска. Свободно време и възможност за разхождане самостоятелно или екскурзия по желание(уговорена на място)",
                    ActivityId = null,
                    OrganizedOfferId = 34
                },
                new OrganizedOfferDay()
                {
                    Id = 231,
                    DayNumber = 6,
                    Description = "Закуска. Напускане на хотела. Връщане в София чрез транзитивен полет",
                    ActivityId = null,
                    OrganizedOfferId = 34
                },


                new OrganizedOfferDay()
                {
                    Id = 232,
                    DayNumber = 1,
                    Description = "Сборен час на Летище Варна - с полет Варна – Енфида с European Air Charter. Пристигане на летище Енфида. Трансфер до избрания хотел. Настаняване. В периода от пристигане в хотела до настаняване, туристите могат да се възползват от всички услуги, включени в концепцията на хотела. Свободно време. Нощувка",
                    ActivityId = null,
                    OrganizedOfferId = 35
                },
                new OrganizedOfferDay()
                {
                    Id = 233,
                    DayNumber = 2,
                    Description = "Свободно време за плаж и забавления",
                    ActivityId = null,
                    OrganizedOfferId = 35
                },
                new OrganizedOfferDay()
                {
                    Id = 234,
                    DayNumber = 3,
                    Description = "Свободно време за плаж и забавления или възможност за допълнителна екскурзия: Разходка с пиратски кораб - Едно вълнуващо плаване, спектакъл със пиратски танци и костюми на борда на кораб, на който всеки е мечтал да бъде като дете, вълнуващо се и готово да посрещтне това морско приключение. Върнете се назад във времето, когато сте мечтали да се качите на подобен кораб, да бъдете част от пиратско приключение, да покорявате нови брегове, да търсите скрити съкровища…",
                    ActivityId = 64,
                    OrganizedOfferId = 35
                },
                new OrganizedOfferDay()
                {
                    Id = 235,
                    DayNumber = 4,
                    Description = "Свободно време за плаж и забавления или възможност за допълнителни екскурзия: Кайруан и Ел Джем (целодневна екскурзия) - Екскурзията започва с посещение на Кайруан - най-святото за мюсюлманите място в Магреб и 4-ят по святост град за исляма. Ще разгледаме Окба джамия / Голямата джамия, издигната заедно с града през 670 г., и ще се отдадем на шопинг, а след това продължаваме обиколката на Кайруан с посещение на водните резервоари на града – построени преди повече от 1000 години. Продължаваме нашият маршрут до Ел Джем , където се намира най-добре запазения и трети в света амфитеатър. Това е един от най-впечатляващите паметници на световната история и именно той е послужил като декор за заснемането на незабравимия “Гладиатор”. Вечерта се връщаме в хотела",
                    ActivityId = 65,
                    OrganizedOfferId = 35
                },
                new OrganizedOfferDay()
                {
                    Id = 236,
                    DayNumber = 5,
                    Description = "Свободно време за плаж и забавления или възможност за допълнителни екскурзия: Полудневна екскурзия - Фригиа зоопарк. Friguia Park е частна зоологическа градина в Тунис, открита на 11 ноември 2000 г. близо до град Буфича. Зоологическата градина на Фригия се намира между градовете Енфида и Буфиша. Заема площ от 360 000 кв. м, за сравнение Московският зоопарк (вторият по големина зоопарк в Русия) заема 220 000 кв. м. В зоопарка са представени 61 вида от фауната на африканския континент. Общо зоологическата градина съдържа 420 животни. Паркът Фригия е първият парк за диви животни в Тунис, където всички животни се държат в относителна свобода, което позволява да се запазят естествените инстинкти и социалното поведение на представения вид. В допълнение към загражденията за животни в парка Фригия можете да видите шоу на морски лъвове, етническо шоу на зулусите, а през 2010 г. в парка беше открит първият делфинариум в Тунис",
                    ActivityId = 66,
                    OrganizedOfferId = 35
                },
                new OrganizedOfferDay()
                {
                    Id = 237,
                    DayNumber = 6,
                    Description = "Свободно време за плаж и забавления",
                    ActivityId = null,
                    OrganizedOfferId = 35
                },
                new OrganizedOfferDay()
                {
                    Id = 238,
                    DayNumber = 7,
                    Description = "Свободно време за плаж и забавления",
                    ActivityId = null,
                    OrganizedOfferId = 35
                },
                new OrganizedOfferDay()
                {
                    Id = 239,
                    DayNumber = 8,
                    Description = "Закуска. Tрансфер за полет Енфида – Варна с European Air Charter",
                    ActivityId = null,
                    OrganizedOfferId = 35
                }
            });
        }
    }
}
