using Microsoft.EntityFrameworkCore;
using Microsoft.EntityFrameworkCore.Metadata.Builders;
using TouristAgency.Infrastructure.Data.Models.MssqlModels;

namespace TouristAgency.Infrastructure.Data.Configurations
{
    public class RoomTypeConfiguration : IEntityTypeConfiguration<RoomType>
    {
        public void Configure(EntityTypeBuilder<RoomType> builder)
        {
            builder.HasData(new RoomType[]
            {
                new RoomType()
                {
                    Id = 1,
                    Name = "Единичина",
                    Description = "Стая, определена за един човек. Може да има едно или повече легла. Площта на единичните стаи обикновено е между 37 m² и 45 m²"
                },
                new RoomType()
                {
                    Id = 2,
                    Name = "Двойна",
                    Description = "Стая, разпределена за двама души. Може да има спалня или две единични легла. Площта на двойните стаи обикновено са между 40 m² и 45 m²"
                },
                new RoomType()
                {
                    Id = 3,
                    Name = "Тройна",
                    Description = "Стая, която може да побере трима души и е оборудвана с три единични легла, едно двойно легло и две единични или едно двойно легло или две единични. Площта на тройните стаи обикновено са между 45 m² и 65 m²"
                },
                new RoomType()
                {
                    Id = 4,
                    Name = "Четворна",
                    Description = "Стая за четирима души. Може да има две или повече легла. Площта на стаите с четири стаи обикновено са между 70 m² и 85 m²"
                },
                new RoomType()
                {
                    Id = 5,
                    Name = "Двойна-Двойна",
                    Description = "Стая с две двойни (или може би кралска спалня). Може да побере от двама до четирима души. Площта на стаите обикновено е между 50 m² до 70 m²"
                },
                new RoomType()
                {
                    Id = 6,
                    Name = "Кралска",
                    Description = "Стая с много голямо легло. Може да бъде заета от един или повече души. Площта на стаите King са обикновено между 32 m² до 50 m²"
                },
                new RoomType()
                {
                    Id = 7,
                    Name = "Президентска",
                    Description = "Най-скъпата стая, предоставена от хотела. Обикновено в един хотелски хотел се предлага само един президентски апартамент. Подобно на нормалните суити, президентският апартамент винаги има една или повече спални и жилищна площ със силен акцент върху великолепна декорация в стаята, висококачествени удобства, консумативи и лични услуги(например личен иконом по време на престоя). Площта на президентските апартаменти обикновено са между 80 m² и 350 m²"
                },
                new RoomType()
                {
                    Id = 8,
                    Name = "Мърфи",
                    Description = "Стая, оборудвана с разтегателен диван или легло Мърфи (т.е. легло, което се сгъва от стена. Стаята се трансформира от спалня през нощта в дневна през деня. Площта на типовете стаи Мърфи обикновено са между 20 m² до 40 m²"
                },
                new RoomType()
                {
                    Id = 9,
                    Name = "Кабана",
                     Description = "Този тип стая винаги е прилежаща към басейна или има свой частен басейн. Площта на типовете стаи Cabana обикновено са между 30 m² и 45 m²"
                },
                new RoomType()
                {
                    Id = 10,
                    Name = "Достъпна стая / стая за инвалиди",
                    Description = "Този тип стая е предназначена главно за гости с увреждания и по закон се изисква хотелите да осигуряват определен брой достъпни стаи, за да се избегне дискриминация.Площта на типовете стаи за достъп обикновено са между 30 m² до 42 m²"
                },
            });
        }
    }
}
